stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
#define __CM0PLUS_REV                  1        /*!< CM0PLUS Core Revision r0p1                                                */
#define __NVIC_PRIO_BITS               2        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 1        /*!< Vector Table Offset Register supported                                    */
#define __MPU_PRESENT                  1        /*!< M0+ provides an MPU                                                       */
#define __FPU_PRESENT                  0        /*!< FPU not present                                                           */
/**
  * @}
  */


 /*!< Device Electronic Signature */
#define PACKAGE_BASE          ((uint32_t)0x40001014U)        /*!< Package size data register base address               */
#define UID64_BASE            ((uint32_t)0x10001EF0U)        /*!< 64-bit Unique device Identification                   */
#define FLASHSIZE_BASE        ((uint32_t)0x40001014U)        /*!< Flash size data register base address                 */
#define RAMSIZE_BASE          ((uint32_t)0x40001014U)        /*!< RAM size data register base address                   */
#define DEV_ID_BASE           ((uint32_t)0x40000000U)        /*!< Device version and cut version register base address  */



/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"                       /*!< ARM Cortex-M0+ processor and core peripherals                             */
#include "system_stm32wl3x.h"                   /*!< system_stm32wl3x macros and typedefs System util                          */



/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Direct memory access controller (DMA)
  */

typedef struct {                                /*!< DMA Structure                                                             */
  __IO  uint32_t  ISR;                          /*!< (@ 0x00000000) Interrupt status register                                  */
  __IO  uint32_t  IFCR;                         /*!< (@ 0x00000004) Interrupt flag clear register                              */
} DMA_TypeDef;

typedef struct {
  __IO uint32_t CCR;         /*!< DMA channel x configuration register        */
  __IO uint32_t CNDTR;       /*!< DMA channel x number of data register       */
  __IO uint32_t CPAR;        /*!< DMA channel x peripheral address register   */
  __IO uint32_t CMAR;        /*!< DMA channel x memory address register       */
  __IO  uint32_t RESERVED;
} DMA_Channel_TypeDef;




/* =========================================================================================================================== */
/* ================                                          DMAMUX                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Direct memory access Multiplexer (DMAMUX)
  */

/**
  * @brief DMA Multiplexer
  */
typedef struct {              /*!< DMAMUX Structure                                                                   */
  __IO uint32_t   CxCR;       /*!< DMA Multiplexer Channel x Control Register    Address offset: 0x0004 * (channel x) */
} DMAMUX_Channel_TypeDef;


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cyclic redundancy check calculation unit (CRC)
  */

typedef struct {                                /*!< CRC Structure                                                             */
  __IO uint32_t  DR;                           /*!< (@ 0x00000000) Data register                                              */
  __IO uint32_t  IDR;                          /*!< (@ 0x00000004) Independent data register                                  */
  __IO uint32_t  CR;                           /*!< (@ 0x00000008) Control register                                           */
  __IO  uint32_t  RESERVED;
  __IO uint32_t  INIT;                         /*!< (@ 0x00000010) Initial CRC value                                          */
  __IO uint32_t  POL;                          /*!< (@ 0x00000014) Polynomial                                                 */
} CRC_TypeDef;                                  /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           IWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Independent watchdog (IWDG)
  */

typedef struct {                                /*!< IWDG Structure                                                            */
  __IO  uint32_t  KR;                           /*!< (@ 0x00000000) Key register                                               */
  __IO uint32_t  PR;                           /*!< (@ 0x00000004) Prescaler register                                         */
  __IO uint32_t  RLR;                          /*!< (@ 0x00000008) Reload register                                            */
  __IO  uint32_t  SR;                           /*!< (@ 0x0000000C) Status register                                            */
  __IO uint32_t  WINR;                         /*!< (@ 0x00000010) Window register                                            */
} IWDG_TypeDef;                                 /*!< Size = 20 (0x14)                                                          */


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter-integrated circuit (I2C)
  */

typedef struct {                                /*!< I2C1 Structure                                                            */
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  OAR1;                         /*!< (@ 0x00000008) Own address register 1                                     */
  __IO uint32_t  OAR2;                         /*!< (@ 0x0000000C) Own address register 2                                     */
  __IO uint32_t  TIMINGR;                      /*!< (@ 0x00000010) Timing register                                            */
  __IO uint32_t  TIMEOUTR;                     /*!< (@ 0x00000014) Timeout register                                           */
  __IO uint32_t  ISR;                          /*!< (@ 0x00000018) Interrupt and Status register                              */
  __IO  uint32_t  ICR;                          /*!< (@ 0x0000001C) Interrupt clear register                                   */
  __IO  uint32_t  PECR;                         /*!< (@ 0x00000020) PEC register                                               */
  __IO  uint32_t  RXDR;                         /*!< (@ 0x00000024) Receive data register                                      */
  __IO uint32_t  TXDR;                         /*!< (@ 0x00000028) Transmit data register                                     */
} I2C_TypeDef;                                  /*!< Size = 44 (0x2C)                                                          */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief FLASH (FLASH)
  */

typedef struct {                                /*!< FLASH Structure                                                           */
  __IO uint32_t  COMMAND;                      /*!< (@ 0x00000000) Command register                                           */
  __IO uint32_t  CONFIG;                       /*!< (@ 0x00000004) Configuration register                                     */
  __IO uint32_t  IRQSTAT;                      /*!< (@ 0x00000008) Interrupt status register                                  */
  __IO uint32_t  IRQMASK;                      /*!< (@ 0x0000000C) Interrupt mask register                                    */
  __IO uint32_t  IRQRAW;                       /*!< (@ 0x00000010) Intertupt raw status register                              */
  __IO  uint32_t  SIZE;                         /*!< (@ 0x00000014) SIZE register                                              */
  __IO uint32_t  ADDRESS;                      /*!< (@ 0x00000018) Address register                                           */
  __IO  uint32_t  RESERVED[2];
  __IO  uint32_t  LFSRVAL;            /*!< (@ 0x00000024) LFSRVAL register            */
  __IO  uint32_t RESERVED2[3];
  __IO uint32_t  PAGEPROT0;                    /*!< (@ 0x00000034) Main Flash page protection register 0                      */
  __IO uint32_t  PAGEPROT1;                    /*!< (@ 0x00000038) Main Flash page protection register 1                      */
  __IO  uint32_t  RESERVED1;
  __IO uint32_t  DATA0;                        /*!< (@ 0x00000040) Data register 0                                            */
  __IO uint32_t  DATA1;                        /*!< (@ 0x00000044) Data register 1                                            */
  __IO uint32_t  DATA2;                        /*!< (@ 0x00000048) Data register 2                                            */
  __IO uint32_t  DATA3;                        /*!< (@ 0x0000004C) Data register 3                                            */
} FLASH_TypeDef;                                /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface/Inter-IC sound (SPI)
  */

typedef struct {                                /*!< SPI Structure                                                             */
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  SR;                           /*!< (@ 0x00000008) Status register                                            */
  __IO uint32_t  DR;                           /*!< (@ 0x0000000C) Data register                                              */
  __IO uint32_t  CRCPR;                        /*!< (@ 0x00000010) CRC polynomial register                                    */
  __IO uint32_t   RXCRCR;                       /*!< (@ 0x00000014) RX CRC register                                            */
  __IO uint32_t   TXCRCR;                       /*!< (@ 0x00000018) TX CRC register                                            */
  __IO uint32_t  I2SCFGR;                      /*!< (@ 0x0000001C) I2S configuration register                                 */
  __IO uint32_t  I2SPR;                        /*!< (@ 0x00000020) I2S prescaler register                                     */
} SPI_TypeDef;                                  /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

