stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
typedef struct{ /*!< RCC Structure  */
  __IO uint32_t CR;       /*!< (@ 0x00000000) CR register                 */
  __IO uint32_t ICSCR;    /*!< (@ 0x00000004) ICSCR register              */
  __IO uint32_t CFGR;     /*!< (@ 0x00000008) CFGR register               */
  __IO uint32_t CSSWCR;   /*!< (@ 0x0000000C) CSSWCR register             */
  __IO uint32_t KRMR;     /*!< (@ 0x00000010) KRMR register               */
  __IO  uint32_t RESERVED;
  __IO uint32_t CIER;     /*!< (@ 0x00000018) CIER register               */
  __IO uint32_t CIFR;     /*!< (@ 0x0000001C) CIFR register               */
  __IO uint32_t CSCMDR;   /*!< (@ 0x00000020) CSCMDR register             */
  __IO  uint32_t RESERVED1[3];
  __IO uint32_t AHBRSTR;  /*!< (@ 0x00000030) AHBRSTR register            */
  __IO uint32_t APB0RSTR; /*!< (@ 0x00000034) APB0RSTR register           */
  __IO uint32_t APB1RSTR; /*!< (@ 0x00000038) APB1RSTR register           */
  __IO  uint32_t RESERVED2;
  __IO uint32_t APB2RSTR; /*!< (@ 0x00000040) APB2RSTR register           */
  __IO  uint32_t RESERVED3[3];
  __IO uint32_t AHBENR;   /*!< (@ 0x00000050) AHBENR register             */
  __IO uint32_t APB0ENR;  /*!< (@ 0x00000054) APB0ENR register            */
  __IO uint32_t APB1ENR;  /*!< (@ 0x00000058) APB1ENR register            */
  __IO  uint32_t RESERVED4;
  __IO uint32_t APB2ENR;  /*!< (@ 0x00000060) APB2ENR register            */
  __IO  uint32_t RESERVED5[12];
  __IO uint32_t CSR;      /*!< (@ 0x00000094) CSR register                */
  __IO uint32_t RFSWHSECR;/*!< (@ 0x00000098) RFSWHSECR register          */
  __IO  uint32_t RFHSECR;  /*!< (@ 0x0000009C) RFHSECR register            */
  __IO uint32_t AHBSMENR; /*!< (@ 0x000000A0) AHBSMENR register           */
  __IO uint32_t APB0SMENR;/*!< (@ 0x000000A4) APB0SMENR register          */
  __IO uint32_t APB1SMENR;/*!< (@ 0x000000A8) APB1SMENR register          */
} RCC_TypeDef;             /*!< Size = 172 (0xAC) */



/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control (PWR)
  */

typedef struct{ /*!< PWR Structure  */
  __IO uint32_t CR1;       /*!< (@ 0x00000000) CR1 register                 */
  __IO uint32_t CR2;       /*!< (@ 0x00000004) CR2 register                 */
  __IO uint32_t IEWU;      /*!< (@ 0x00000008) IEWU register                */
  __IO uint32_t IWUP;      /*!< (@ 0x0000000C) IWUP register                */
  __IO uint32_t IWUF;      /*!< (@ 0x00000010) IWUF register                */
  __IO  uint32_t SR2;       /*!< (@ 0x00000014) SR2 register                 */
  __IO  uint32_t RESERVED;
  __IO uint32_t CR5;       /*!< (@ 0x0000001C) CR5 register                 */
  __IO uint32_t PUCRA;     /*!< (@ 0x00000020) PUCRA register               */
  __IO uint32_t PDCRA;     /*!< (@ 0x00000024) PDCRA register               */
  __IO uint32_t PUCRB;     /*!< (@ 0x00000028) PUCRB register               */
  __IO uint32_t PDCRB;     /*!< (@ 0x0000002C) PDCRB register               */
  __IO uint32_t EWUA;      /*!< (@ 0x00000030) EWUA register                */
  __IO uint32_t WUPA;      /*!< (@ 0x00000034) WUPA register                */
  __IO uint32_t WUFA;      /*!< (@ 0x00000038) WUFA register                */
  __IO  uint32_t RESERVED1;
  __IO uint32_t EWUB;      /*!< (@ 0x00000040) EWUB register                */
  __IO uint32_t WUPB;      /*!< (@ 0x00000044) WUPB register                */
  __IO uint32_t WUFB;      /*!< (@ 0x00000048) WUFB register                */
  __IO uint32_t SDWN_WUEN; /*!< (@ 0x0000004C) SDWN_WUEN register           */
  __IO uint32_t SDWN_WUPOL;/*!< (@ 0x00000050) SDWN_WUPOL register          */
  __IO uint32_t SDWN_WUF;  /*!< (@ 0x00000054) SDWN_WUF register            */
  __IO uint32_t BOF_TUNE;  /*!< (@ 0x00000058) BOF_TUNE register            */
  __IO  uint32_t RESERVED2[10];
  __IO uint32_t DBGR;      /*!< (@ 0x00000084) DBGR register                */
  __IO uint32_t EXTSRR;    /*!< (@ 0x00000088) EXTSRR register              */
  __IO  uint32_t RESERVED3;
  __IO  uint32_t TRIMR;     /*!< (@ 0x00000090) TRIMR register               */
  __IO uint32_t ENGTRIM;   /*!< (@ 0x00000094) ENGTRIM register             */
  __IO  uint32_t RESERVED4[2];
  __IO uint32_t ENGTRIM2;  /*!< (@ 0x000000A0) ENGTRIM register             */
} PWR_TypeDef;              /*!< Size = 164 (0xA4) */



/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct {                                /*!< SYSCFG Structure                                                                        */
  __IO  uint32_t  DIE_ID;                       /*!< (@ 0x00000000) Die ID register                                                          */
  __IO  uint32_t  JTAG_ID;                      /*!< (@ 0x00000004) JTAG ID register                                                         */
  __IO uint32_t  I2C_FMP_CTRL;                 /*!< (@ 0x00000008) I2C Fast-Mode Plus pin capability control register                       */
  __IO uint32_t  IO_DTR;                       /*!< (@ 0x0000000C) I/O Interrupt detection type register                                    */
  __IO uint32_t  IO_IBER;                      /*!< (@ 0x00000010) I/O Interrupt Edge register                                              */
  __IO uint32_t  IO_IEVR;                      /*!< (@ 0x00000014) I/O Interrupt polarity event register                                    */
  __IO uint32_t  IO_IER;                       /*!< (@ 0x00000018) I/O Interrupt Enable register                                            */
  __IO uint32_t  IO_ISCR;                      /*!< (@ 0x0000001C) I/O Interrupt Status and Clear register                                  */
  __IO uint32_t  PWRC_IER;                     /*!< (@ 0x00000020) Power Controller Interrupt Enable register                               */
  __IO uint32_t  PWRC_ISCR;                    /*!< (@ 0x00000024) Power Controller Interrupt Status and Clear register                     */
  __IO uint32_t  GPIO_SWA_CTRL;                /*!< (@ 0x00000028) I/O analog switch control register                                       */
  __IO uint32_t  INTAI_DTR;                    /*!< (@ 0x0000002C) Internal asynchronous interrupt detection type register                  */
  __IO uint32_t  INTAI_IBER;                   /*!< (@ 0x00000030) Internal asynchronous interrupt edge register                            */
  __IO uint32_t  INTAI_IEVR;                   /*!< (@ 0x00000034) Internal asynchronous interrupt polarity event register                  */
  __IO uint32_t  INTAI_IER;                    /*!< (@ 0x00000038) Internal asynchronous interrupt enable register                          */
  __IO uint32_t  INTAI_ISCR;                   /*!< (@ 0x0000003C) Internal asynchronous interrupt detection status and clear register      */
  __IO  uint32_t  SR1;                          /*!< (@ 0x00000040) SYSCFG status register 1                                                 */
} SYSCFG_TypeDef;                               /*!< Size = 68 (0x44)                                                                        */



/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Random number generator (RNG)
  */

typedef struct {                                /*!< RNG Structure                                                             */
  __IO uint32_t  CR;                           /*!< (@ 0x00000000) Control register                                           */
  __IO uint32_t  SR;                           /*!< (@ 0x00000004) Status register                                            */
  __IO  uint32_t  VAL;                          /*!< (@ 0x00000008) Data register                                              */
} RNG_TypeDef;                                  /*!< Size = 12 (0xC)                                                           */



/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIO)
  */

typedef struct {                                /*!< GPIO Structure                                                            */
  __IO uint32_t  MODER;                        /*!< (@ 0x00000000) GPIO port mode register                                    */
  __IO uint32_t  OTYPER;                       /*!< (@ 0x00000004) GPIO port output type register                             */
  __IO uint32_t  OSPEEDR;                      /*!< (@ 0x00000008) GPIO port output speed register                            */
  __IO uint32_t  PUPDR;                        /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
  __IO  uint32_t  IDR;                          /*!< (@ 0x00000010) GPIO port input data register                              */
  __IO uint32_t  ODR;                          /*!< (@ 0x00000014) GPIO port output data register                             */
  __IO  uint32_t  BSRR;                         /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
  __IO uint32_t  LCKR;                         /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
  __IO uint32_t  AFR[2];                       /*!< (@ 0x00000020) GPIO alternate function register                           */
  __IO  uint32_t  BRR;                          /*!< (@ 0x00000028) GPIO bit reset register                                    */
} GPIO_TypeDef;                                 /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                            TIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIM)
  */

