stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
typedef struct {                                /*!< TIMx Structure                                                            */
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  SMCR;                         /*!< (@ 0x00000008) Slave mode control register                                */
  __IO uint32_t  DIER;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
  __IO uint32_t  SR;                           /*!< (@ 0x00000010) Status register                                            */
  __IO  uint32_t  EGR;                          /*!< (@ 0x00000014) Event generation register                                  */
  __IO uint32_t  CCMR1;                        /*!< (@ 0x00000018) Input capture and output compare mode register 1           */
  __IO uint32_t  CCMR2;                        /*!< (@ 0x0000001C) Input capture and output compare mode register 2           */
  __IO uint32_t  CCER;                         /*!< (@ 0x00000020) Capture/compare enable register                            */
  __IO uint32_t  CNT;                          /*!< (@ 0x00000024) Counter                                                    */
  __IO uint32_t  PSC;                          /*!< (@ 0x00000028) Prescaler                                                  */
  __IO uint32_t  ARR;                          /*!< (@ 0x0000002C) Auto-reload register                                       */
  __IO uint32_t  RCR;                          /*!< (@ 0x00000030) Repetition counter register                                */
  __IO uint32_t  CCR1;                         /*!< (@ 0x00000034) Capture/compare register 1                                 */
  __IO uint32_t  CCR2;                         /*!< (@ 0x00000038) Capture/compare register 2                                 */
  __IO uint32_t  CCR3;                         /*!< (@ 0x0000003C) Capture/compare register 3                                 */
  __IO uint32_t  CCR4;                         /*!< (@ 0x00000040) Capture/compare register 4                                 */
  __IO uint32_t  BDTR;                         /*!< (@ 0x00000044) Break and dead-time register                               */
  __IO uint32_t  DCR;                          /*!< (@ 0x00000048) DMA control register                                       */
  __IO uint32_t  DMAR;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
  __IO uint32_t  OR;                           /*!< (@ 0x00000050) Option register 1                                          */
  __IO  uint32_t  RESERVED[3];
  __IO uint32_t  AF1;                          /*!< (@ 0x00000060) TIM alternate function option register 1                   */
  __IO  uint32_t  RESERVED1;
  __IO uint32_t  TISEL;                        /*!< (@ 0x00000068) Input selection register                                   */
} TIM_TypeDef;                                  /*!< Size = 108 (0x6C)                                                         */



/* =========================================================================================================================== */
/* ================                                           USART                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver transmitter (USART)
  */

typedef struct {                                /*!< USART Structure                                                           */
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IO uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IO uint32_t  GTPR;                         /*!< (@ 0x00000010) Guard time and prescaler register                          */
  __IO uint32_t  RTOR;                         /*!< (@ 0x00000014) Receiver timeout register                                  */
  __IO  uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IO  uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __IO  uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IO  uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IO uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
  __IO uint32_t  PRESC;                        /*!< (@ 0x0000002C) Prescaler register                                         */
} USART_TypeDef;                                /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< RTC Structure                                                             */
  __IO uint32_t  TR;                           /*!< (@ 0x00000000) Time register                                              */
  __IO uint32_t  DR;                           /*!< (@ 0x00000004) Date register                                              */
  __IO uint32_t  CR;                           /*!< (@ 0x00000008) Control register                                           */
  __IO uint32_t  ISR;                          /*!< (@ 0x0000000C) Initialization and status register                         */
  __IO uint32_t  PRER;                         /*!< (@ 0x00000010) Prescaler register                                         */
  __IO uint32_t  WUTR;                         /*!< (@ 0x00000014) Wakeup timer register                                      */
  __IO  uint32_t  RESERVED;
  __IO uint32_t  ALRMAR;                       /*!< (@ 0x0000001C) Alarm A register                                           */
  __IO  uint32_t  RESERVED1;
  __IO  uint32_t  WPR;                          /*!< (@ 0x00000024) Write protection register                                  */
  __IO  uint32_t  SSR;                          /*!< (@ 0x00000028) Sub second register                                        */
  __IO  uint32_t  SHIFTR;                       /*!< (@ 0x0000002C) Shift control register                                     */
  __IO  uint32_t  TSTR;                         /*!< (@ 0x00000030) Timestamp time register                                    */
  __IO  uint32_t  TSDR;                         /*!< (@ 0x00000034) Timestamp date register                                    */
  __IO  uint32_t  TSSSR;                        /*!< (@ 0x00000038) Timestamp sub second register                              */
  __IO uint32_t  CALR;                         /*!< (@ 0x0000003C) Calibration register                                       */
  __IO uint32_t  TAMPCR;                       /*!< (@ 0x00000040) Tamper configuration register                              */
  __IO uint32_t  ALRMASSR;                     /*!< (@ 0x00000044) Alarm A sub second register                                */
  __IO  uint32_t  RESERVED2;
  __IO uint32_t  OR;                           /*!< (@ 0x0000004C) Option register                                            */
  __IO uint32_t  BKP0R;                        /*!< (@ 0x00000050) Backup register 0                                          */
  __IO uint32_t  BKP1R;                        /*!< (@ 0x00000054) Backup register 1                                          */
} RTC_TypeDef;                                  /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                            AES                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced encryption standard hardware accelerator (AES)
  */

typedef struct {              /*!< AES Structure                                                                               */
  __IO uint32_t   CR;        /*!< (@ 0x00000000) Control Register                                                             */
  __IO  uint32_t   SR;        /*!< (@ 0x00000004) Status Register                                                              */
  __IO uint32_t   DINR;      /*!< (@ 0x00000008) Data Input register                                                          */
  __IO  uint32_t   DOUTR;     /*!< (@ 0x0000000C) Data Output register                                                         */
  __IO uint32_t   KEYR0;     /*!< (@ 0x00000010) Key register 0                                                               */
  __IO uint32_t   KEYR1;     /*!< (@ 0x00000014) Key register 1                                                               */
  __IO uint32_t   KEYR2;     /*!< (@ 0x00000018) Key register 2                                                               */
  __IO uint32_t   KEYR3;     /*!< (@ 0x0000001C) Key register 3                                                               */
  __IO uint32_t   IVR0;      /*!< (@ 0x00000020) Initialization vector register 0                                             */
  __IO uint32_t   IVR1;      /*!< (@ 0x00000024) Initialization vector register 1                                             */
  __IO uint32_t   IVR2;      /*!< (@ 0x00000028) Initialization vector register 2                                             */
  __IO uint32_t   IVR3;      /*!< (@ 0x0000002C) Initialization vector register 3                                             */
  __IO uint32_t   KEYR4;     /*!< (@ 0x00000030) Key register 4                                                               */
  __IO uint32_t   KEYR5;     /*!< (@ 0x00000034) Key register 5                                                               */
  __IO uint32_t   KEYR6;     /*!< (@ 0x00000038) Key register 6                                                               */
  __IO uint32_t   KEYR7;     /*!< (@ 0x0000003C) Key register 7                                                               */
  __IO uint32_t   SUSP0;     /*!< (@ 0x00000040) Suspend register 0                                                           */
  __IO uint32_t   SUSP1;     /*!< (@ 0x00000044) Suspend register 1                                                           */
  __IO uint32_t   SUSP2;     /*!< (@ 0x00000048) Suspend register 2                                                           */
  __IO uint32_t   SUSP3;     /*!< (@ 0x0000004C) Suspend register 3                                                           */
  __IO uint32_t   SUSP4;     /*!< (@ 0x00000050) Suspend register 4                                                           */
  __IO uint32_t   SUSP5;     /*!< (@ 0x00000054) Suspend register 5                                                           */
  __IO uint32_t   SUSP6;     /*!< (@ 0x00000058) Suspend register 6                                                           */
  __IO uint32_t   SUSP7;     /*!< (@ 0x0000005C) Suspend register 7                                                           */
} AES_TypeDef;                /*!< Size = 96 (0x60)                                                                            */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ADC (ADC)
  */

typedef struct {                                /*!< ADC Structure                                                             */
  __IO  uint32_t  VERSION_ID;                   /*!< (@ 0x00000000) VERSION_ID register                                        */
  __IO uint32_t  CONF;                         /*!< (@ 0x00000004) ADC configuration register                                 */
  __IO uint32_t  CTRL;                         /*!< (@ 0x00000008) ADC control register                                       */
  __IO  uint32_t  RESERVED[2];
  __IO uint32_t  SWITCH;                       /*!< (@ 0x00000014) ADC switch control for Input Selection                     */
  __IO  uint32_t  RESERVED1;
  __IO uint32_t  DS_CONF;                      /*!< (@ 0x0000001C) Downsampler configuration register                         */
  __IO uint32_t  SEQ_1;                        /*!< (@ 0x00000020) ADC regular sequence programming register 1                */
  __IO uint32_t  SEQ_2;                        /*!< (@ 0x00000024) ADC regular sequence programming register 2                */
  __IO uint32_t  COMP_1;                       /*!< (@ 0x00000028) ADC Gain & offset correction values register 1             */
  __IO uint32_t  COMP_2;                       /*!< (@ 0x0000002C) ADC Gain & offset correction values register 2             */
  __IO uint32_t  COMP_3;                       /*!< (@ 0x00000030) ADC Gain & offset correction values register 3             */
  __IO uint32_t  COMP_4;                       /*!< (@ 0x00000034) ADC Gain & offset correction values register 4             */
  __IO uint32_t  COMP_SEL;                     /*!< (@ 0x00000038) ADC Gain & Offset selection values register                */
  __IO uint32_t  WD_TH;                        /*!< (@ 0x0000003C) ADC watchdog threshold register register                   */
  __IO uint32_t  WD_CONF;                      /*!< (@ 0x00000040) ADC watchdog configuration register                        */
  __IO  uint32_t  DS_DATAOUT;                   /*!< (@ 0x00000044) Downsampler Data output register                           */
  __IO  uint32_t  RESERVED2;
  __IO uint32_t  IRQ_STATUS;                   /*!< (@ 0x0000004C) Interrupt Status register                                  */
  __IO uint32_t  IRQ_ENABLE;                   /*!< (@ 0x00000050) Enable/disable Interrupts                                  */
} ADC_TypeDef;                                  /*!< Size = 84 (0x54)                                                          */




/* =========================================================================================================================== */
/* ================                                     DBGMCU                                                ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU debug component (DBGMCU)
  */

typedef struct{ /*!< DBGMCU Structure  */
  __IO uint32_t CR;                /*!< (@ 0x00000000) CR register                   */
  __IO uint32_t DBG_APB0_FZ;       /*!< (@ 0x00000004) DBG_APB0_FZ register          */
  __IO uint32_t DBG_APB1_FZ;       /*!< (@ 0x00000008) DBG_APB1_FZ register          */
} DBGMCU_TypeDef;                      /*!< Size = 12 (0x0C) */





/* =========================================================================================================================== */
/* ================                                   MR_SUBG_RADIO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Radio
  */

typedef struct{ /*!< MR_SUBG_RADIO Structure  */
  __IO uint32_t RF_FSM0_TIMEOUT;       /*!< (@ 0x00000000) RF_FSM0_TIMEOUT register                */
  __IO uint32_t RF_FSM1_TIMEOUT;       /*!< (@ 0x00000004) RF_FSM1_TIMEOUT register                */
  __IO uint32_t RF_FSM2_TIMEOUT;       /*!< (@ 0x00000008) RF_FSM2_TIMEOUT register                */
  __IO uint32_t RF_FSM3_TIMEOUT;       /*!< (@ 0x0000000C) RF_FSM3_TIMEOUT register                */
  __IO uint32_t RF_FSM4_TIMEOUT;       /*!< (@ 0x00000010) RF_FSM4_TIMEOUT register                */
  __IO uint32_t RF_FSM5_TIMEOUT;       /*!< (@ 0x00000014) RF_FSM5_TIMEOUT register                */
  __IO uint32_t RF_FSM6_TIMEOUT;       /*!< (@ 0x00000018) RF_FSM6_TIMEOUT register                */
  __IO uint32_t RF_FSM7_TIMEOUT;       /*!< (@ 0x0000001C) RF_FSM7_TIMEOUT register                */
  __IO uint32_t AFC0_CONFIG;           /*!< (@ 0x00000020) AFC0_CONFIG register                    */
  __IO uint32_t AFC1_CONFIG;           /*!< (@ 0x00000024) AFC1_CONFIG register                    */
  __IO uint32_t AFC2_CONFIG;           /*!< (@ 0x00000028) AFC2_CONFIG register                    */
  __IO uint32_t AFC3_CONFIG;           /*!< (@ 0x0000002C) AFC3_CONFIG register                    */
  __IO uint32_t CLKREC_CTRL0;          /*!< (@ 0x00000030) CLKREC_CTRL0 register                   */
  __IO uint32_t CLKREC_CTRL1;          /*!< (@ 0x00000034) CLKREC_CTRL1 register                   */
  __IO uint32_t DCREM_CTRL0;           /*!< (@ 0x00000038) DCREM_CTRL0 register                    */
  __IO uint32_t DCREM_CTRL1;           /*!< (@ 0x0000003C) DCREM_CTRL1 register                    */
  __IO uint32_t IQC_CTRL0;             /*!< (@ 0x00000040) IQC_CTRL0 register                      */
  __IO uint32_t IQC_CTRL1;             /*!< (@ 0x00000044) IQC_CTRL1 register                      */
  __IO uint32_t IQC_CTRL2;             /*!< (@ 0x00000048) IQC_CTRL2 register                      */
  __IO uint32_t IQC_CTRL3;             /*!< (@ 0x0000004C) IQC_CTRL3 register                      */
  __IO  uint32_t RESERVED;
  __IO uint32_t AGC0_CTRL;             /*!< (@ 0x00000054) AGC0_CTRL register                      */
  __IO uint32_t AGC1_CTRL;             /*!< (@ 0x00000058) AGC1_CTRL register                      */
  __IO uint32_t AGC2_CTRL;             /*!< (@ 0x0000005C) AGC2_CTRL register                      */
  __IO uint32_t AGC3_CTRL;             /*!< (@ 0x00000060) AGC3_CTRL register                      */
  __IO uint32_t AGC4_CTRL;             /*!< (@ 0x00000064) AGC4_CTRL register                      */
  __IO uint32_t AGC_ATTEN0;            /*!< (@ 0x00000068) AGC_ATTEN0 register                     */
  __IO uint32_t AGC_ATTEN1;            /*!< (@ 0x0000006C) AGC_ATTEN1 register                     */
  __IO uint32_t AGC_ATTEN2;            /*!< (@ 0x00000070) AGC_ATTEN2 register                     */
  __IO uint32_t AGC_ATTEN3;            /*!< (@ 0x00000074) AGC_ATTEN3 register                     */
  __IO uint32_t AGC_ATTEN4;            /*!< (@ 0x00000078) AGC_ATTEN4 register                     */
  __IO uint32_t AGC_ATTEN5;            /*!< (@ 0x0000007C) AGC_ATTEN5 register                     */
  __IO uint32_t AGC_ATTEN6;            /*!< (@ 0x00000080) AGC_ATTEN6 register                     */
  __IO uint32_t AGC_ATTEN7;            /*!< (@ 0x00000084) AGC_ATTEN7 register                     */
  __IO uint32_t AGC_ATTEN8;            /*!< (@ 0x00000088) AGC_ATTEN8 register                     */
  __IO uint32_t AGC_ATTEN9;            /*!< (@ 0x0000008C) AGC_ATTEN9 register                     */
  __IO uint32_t AGC1_ATTEN_TRIM;       /*!< (@ 0x00000090) AGC1_ATTEN_TRIM register                */
  __IO uint32_t AGC2_ATTEN_TRIM;       /*!< (@ 0x00000094) AGC2_ATTEN_TRIM register                */
  __IO uint32_t AGC3_ATTEN_TRIM;       /*!< (@ 0x00000098) AGC3_ATTEN_TRIM register                */
  __IO uint32_t AGC4_ATTEN_TRIM;       /*!< (@ 0x0000009C) AGC4_ATTEN_TRIM register                */
  __IO  uint32_t AGC_PGA_HWTRIM_OUT;    /*!< (@ 0x000000A0) AGC_PGA_HWTRIM_OUT register             */
  __IO  uint32_t RESERVED1;
  __IO uint32_t PA_REG;                /*!< (@ 0x000000A8) PA_REG register                         */
  __IO  uint32_t PA_HWTRIM_OUT;         /*!< (@ 0x000000AC) PA_HWTRIM_OUT register                  */
  __IO  uint32_t RESERVED2[3];
  __IO uint32_t RSSI_FLT;              /*!< (@ 0x000000BC) RSSI_FLT register                       */
  __IO  uint32_t RESERVED3[2];
  __IO uint32_t SYNTH2_ANA_ENG;        /*!< (@ 0x000000C8) SYNTH2_ANA_ENG register                 */
  __IO  uint32_t RESERVED4[7];
  __IO  uint32_t RXADC_HWDELAYTRIM_OUT; /*!< (@ 0x000000E8) RXADC_HWDELAYTRIM_OUT register          */
  __IO  uint32_t RESERVED5[2];
  __IO  uint32_t RX_AAF_HWTRIM_OUT;     /*!< (@ 0x000000F4) RX_AAF_HWTRIM_OUT register              */
  __IO  uint32_t RESERVED6[2];
  __IO uint32_t SINGEN_ANA_ENG;        /*!< (@ 0x00000100) SINGEN_ANA_ENG register                 */
  __IO  uint32_t RESERVED7;
  __IO  uint32_t RF_INFO_OUT;          /*!< (@ 0x00000108) RF_INFO_OUT register                */
  __IO  uint32_t RFANA_PLL_IN;         /*!< (@ 0x0000010C) RFANA_PLL_IN register                */
  __IO  uint32_t RESERVED8[5];
  __IO uint32_t RF_FSM8_TIMEOUT;       /*!< (@ 0x00000124) RF_FSM8_TIMEOUT register                */
  __IO uint32_t RF_FSM9_TIMEOUT;       /*!< (@ 0x00000128) RF_FSM9_TIMEOUT register                */
  __IO uint32_t RF_FSM10_TIMEOUT;      /*!< (@ 0x0000012C) RF_FSM10_TIMEOUT register               */
  __IO  uint32_t RESERVED9[5];
  __IO uint32_t SUBG_DIG_CTRL0;        /*!< (@ 0x00000144) SUBG_DIG_CTRL0 register                 */
} MR_SUBG_RADIO_TypeDef;                          /*!< Size = 328 (0x148) */



/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_STATIC                                     ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Static
  */

