stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
typedef struct{ /*!< MR_SUBG_GLOB_STATIC Structure  */
  __IO uint32_t PCKT_CONFIG;       /*!< (@ 0x00000000) PCKT_CONFIG register              */
  __IO uint32_t SYNC;              /*!< (@ 0x00000004) SYNC register                     */
  __IO uint32_t SEC_SYNC;          /*!< (@ 0x00000008) SEC_SYNC register                 */
  __IO uint32_t CRC_INIT;          /*!< (@ 0x0000000C) CRC_INIT register                 */
  __IO uint32_t PCKT_CTRL;         /*!< (@ 0x00000010) PCKT_CTRL register                */
  __IO uint32_t DATABUFFER0_PTR;   /*!< (@ 0x00000014) DATABUFFER0_PTR register          */
  __IO uint32_t DATABUFFER1_PTR;   /*!< (@ 0x00000018) DATABUFFER1_PTR register          */
  __IO uint32_t DATABUFFER_SIZE;   /*!< (@ 0x0000001C) DATABUFFER_SIZE register          */
  __IO uint32_t PA_LEVEL_3_0;      /*!< (@ 0x00000020) PA_LEVEL_3_0 register             */
  __IO uint32_t PA_LEVEL_7_4;      /*!< (@ 0x00000024) PA_LEVEL_7_4 register             */
  __IO uint32_t PA_CONFIG;         /*!< (@ 0x00000028) PA_CONFIG register                */
  __IO uint32_t IF_CTRL;           /*!< (@ 0x0000002C) IF_CTRL register                  */
  __IO uint32_t AS_QI_CTRL;        /*!< (@ 0x00000030) AS_QI_CTRL register               */
  __IO uint32_t IQC_CONFIG;        /*!< (@ 0x00000034) IQC_CONFIG register               */
  __IO uint32_t DSSS_CTRL;         /*!< (@ 0x00000038) DSSS_CTRL register                */
} MR_SUBG_GLOB_STATIC_TypeDef;                      /*!< Size = 60 (0x3C) */


/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_DYNAMIC                                    ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Dynamic
  */

typedef struct{ /*!< MR_SUBG_GLOB_DYNAMIC Structure  */
  __IO uint32_t PCKTLEN_CONFIG;       /*!< (@ 0x00000000) PCKTLEN_CONFIG register            */
  __IO uint32_t MOD0_CONFIG;          /*!< (@ 0x00000004) MOD0_CONFIG register               */
  __IO uint32_t MOD1_CONFIG;          /*!< (@ 0x00000008) MOD1_CONFIG register               */
  __IO uint32_t SYNTH_FREQ;           /*!< (@ 0x0000000C) SYNTH_FREQ register                */
  __IO uint32_t VCO_CAL_CONFIG;       /*!< (@ 0x00000010) VCO_CAL_CONFIG register            */
  __IO uint32_t RX_TIMER;             /*!< (@ 0x00000014) RX_TIMER register                  */
  __IO uint32_t DATABUFFER_THR;       /*!< (@ 0x00000018) DATABUFFER_THR register            */
  __IO uint32_t RFSEQ_IRQ_ENABLE;     /*!< (@ 0x0000001C) RFSEQ_IRQ_ENABLE register          */
  __IO uint32_t ADDITIONAL_CTRL;      /*!< (@ 0x00000020) ADDITIONAL_CTRL register           */
  __IO uint32_t FAST_RX_TIMER;        /*!< (@ 0x00000024) FAST_RX_TIMER register             */
  __IO uint32_t COMMAND;              /*!< (@ 0x00000028) COMMAND register                   */
} MR_SUBG_GLOB_DYNAMIC_TypeDef;                         /*!< Size = 44 (0x2C) */


/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_STATUS                                     ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Status
  */

typedef struct{ /*!< MR_SUBG_GLOB_STATUS Structure  */
  __IO uint32_t RFSEQ_IRQ_STATUS;       /*!< (@ 0x00000000) RFSEQ_IRQ_STATUS register             */
  __IO uint32_t RFSEQ_STATUS_DETAIL;    /*!< (@ 0x00000004) RFSEQ_STATUS_DETAIL register          */
  __IO  uint32_t RADIO_FSM_INFO;         /*!< (@ 0x00000008) RADIO_FSM_INFO register               */
  __IO  uint32_t RX_INDICATOR;           /*!< (@ 0x0000000C) RX_INDICATOR register                 */
  __IO  uint32_t RX_INFO_REG;            /*!< (@ 0x00000010) RX_INFO_REG register                  */
  __IO  uint32_t RX_CRC_REG;             /*!< (@ 0x00000014) RX_CRC_REG register                   */
  __IO  uint32_t QI_INFO;                /*!< (@ 0x00000018) QI_INFO register                      */
  __IO  uint32_t DATABUFFER_INFO;        /*!< (@ 0x0000001C) DATABUFFER_INFO register              */
  __IO  uint32_t TIME_CAPTURE;           /*!< (@ 0x00000020) TIME_CAPTURE register                 */
  __IO  uint32_t IQC_CORRECTION_OUT;     /*!< (@ 0x00000024) IQC_CORRECTION_OUT register           */
  __IO  uint32_t PA_SAFEASK_OUT;         /*!< (@ 0x00000028) PA_SAFEASK_OUT register               */
  __IO  uint32_t VCO_CALIB_OUT;          /*!< (@ 0x0000002C) VCO_CALIB_OUT register                */
  __IO  uint32_t SEQ_INFO;               /*!< (@ 0x00000030) SEQ_INFO register                     */
  __IO  uint32_t SEQ_EVENT_STATUS;       /*!< (@ 0x00000034) SEQ_EVENT_STATUS register             */
} MR_SUBG_GLOB_STATUS_TypeDef;                           /*!< Size = 56 (0x38) */



/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_MISC                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Misc
  */

typedef struct{ /*!< MR_SUBG_GLOB_MISC Structure  */
  __IO  uint32_t RFIP_VERSION;       /*!< (@ 0x00000000) RFIP_VERSION register               */
  __IO  uint32_t RRM_UDRA_CTRL;      /*!< (@ 0x00000004) RRM_UDRA_CTRL register              */
  __IO uint32_t SEQUENCER_CTRL;     /*!< (@ 0x00000008) SEQUENCER_CTRL register             */
  __IO  uint32_t ABSOLUTE_TIME;      /*!< (@ 0x0000000C) ABSOLUTE_TIME register              */
  __IO  uint32_t SCM_COUNTER_VAL;    /*!< (@ 0x00000010) SCM_COUNTER_VAL register            */
  __IO uint32_t SCM_MIN_MAX;        /*!< (@ 0x00000014) SCM_MIN_MAX register                */
  __IO uint32_t WAKEUP_IRQ_STATUS;  /*!< (@ 0x00000018) WAKEUP_IRQ_STATUS register          */
} MR_SUBG_GLOB_MISC_TypeDef;                       /*!< Size = 28 (0x1C) */



/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_RETAINED                                   ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Retained
  */

