stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    DCR    =====================================================*/
#define TIM_DCR_DBL_Pos                                                    (8UL)        /*!<TIM DCR: DBL (Bit 8) */
#define TIM_DCR_DBL_Msk                                                    (0x1f00UL)        /*!< TIM DCR: DBL (Bitfield-Mask: 0x1f) */
#define TIM_DCR_DBL                                                        TIM_DCR_DBL_Msk
#define TIM_DCR_DBL_0                                                      (0x1U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBL_1                                                      (0x2U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBL_2                                                      (0x4U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBL_3                                                      (0x8U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBL_4                                                      (0x10U << TIM_DCR_DBL_Pos)
#define TIM_DCR_DBA_Pos                                                    (0UL)        /*!<TIM DCR: DBA (Bit 0) */
#define TIM_DCR_DBA_Msk                                                    (0x1fUL)        /*!< TIM DCR: DBA (Bitfield-Mask: 0x1f) */
#define TIM_DCR_DBA                                                        TIM_DCR_DBA_Msk
#define TIM_DCR_DBA_0                                                      (0x1U << TIM_DCR_DBA_Pos)
#define TIM_DCR_DBA_1                                                      (0x2U << TIM_DCR_DBA_Pos)
#define TIM_DCR_DBA_2                                                      (0x4U << TIM_DCR_DBA_Pos)
#define TIM_DCR_DBA_3                                                      (0x8U << TIM_DCR_DBA_Pos)
#define TIM_DCR_DBA_4                                                      (0x10U << TIM_DCR_DBA_Pos)

/* =====================================================    DMAR    =====================================================*/
#define TIM_DMAR_DMAB_Pos                                                  (0UL)        /*!<TIM DMAR: DMAB (Bit 0) */
#define TIM_DMAR_DMAB_Msk                                                  (0xffffUL)        /*!< TIM DMAR: DMAB (Bitfield-Mask: 0xffff) */
#define TIM_DMAR_DMAB                                                      TIM_DMAR_DMAB_Msk
#define TIM_DMAR_DMAB_0                                                    (0x1U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_1                                                    (0x2U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_2                                                    (0x4U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_3                                                    (0x8U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_4                                                    (0x10U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_5                                                    (0x20U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_6                                                    (0x40U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_7                                                    (0x80U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_8                                                    (0x100U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_9                                                    (0x200U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_10                                                   (0x400U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_11                                                   (0x800U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_12                                                   (0x1000U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_13                                                   (0x2000U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_14                                                   (0x4000U << TIM_DMAR_DMAB_Pos)
#define TIM_DMAR_DMAB_15                                                   (0x8000U << TIM_DMAR_DMAB_Pos)

/* ==================================================    TIM2 OR    =================================================== */
#define TIM2_OR_TI4_RMP_Pos       (2U)
#define TIM2_OR_TI4_RMP_Msk       (0x1UL << TIM2_OR_TI4_RMP_Pos)             /*!< 0x00000004 */
#define TIM2_OR_TI4_RMP           TIM2_OR_TI4_RMP_Msk                        /*!< TI4 RMP Input capture 4 remap*/
#define TIM2_OR_ETR_RMP_Pos       (0U)
#define TIM2_OR_ETR_RMP_Msk       (0x1UL << TIM2_OR_ETR_RMP_Pos)             /*!< 0x00000001 */
#define TIM2_OR_ETR_RMP           TIM2_OR_ETR_RMP_Msk                        /*!< ETR_RMP External trigger remap */

/* ==================================================    TIM16 OR    =================================================== */
#define TIM16_OR_TI1_RMP_Pos      (1U)
#define TIM16_OR_TI1_RMP_Msk      (0x3UL << TIM16_OR_TI1_RMP_Pos)            /*!< 0x00000006 */
#define TIM16_OR_TI1_RMP          TIM16_OR_TI1_RMP_Msk                       /*!<Timer 16 input 1 connection. */
#define TIM16_OR_TI1_RMP_0        (0x1UL << TIM16_OR_TI1_RMP_Pos)            /*!< 0x00000002 */
#define TIM16_OR_TI1_RMP_1        (0x2UL << TIM16_OR_TI1_RMP_Pos)            /*!< 0x00000004 */

/* =====================================================    AF1    =====================================================*/
#define TIM_AF1_ETRSEL_Pos                                                 (14UL)        /*!<TIM AF1: ETRSEL (Bit 14) */
#define TIM_AF1_ETRSEL_Msk                                                 (0x3c000UL)        /*!< TIM AF1: ETRSEL (Bitfield-Mask: 0x0f) */
#define TIM_AF1_ETRSEL                                                     TIM_AF1_ETRSEL_Msk
#define TIM_AF1_ETRSEL_0                                                   (0x1U << TIM_AF1_ETRSEL_Pos)
#define TIM_AF1_ETRSEL_1                                                   (0x2U << TIM_AF1_ETRSEL_Pos)
#define TIM_AF1_ETRSEL_2                                                   (0x4U << TIM_AF1_ETRSEL_Pos)
#define TIM_AF1_ETRSEL_3                                                   (0x8U << TIM_AF1_ETRSEL_Pos)
#define TIM_AF1_BKCMP1P_Pos                                                (10UL)        /*!<TIM AF1: BKCMP1P (Bit 10) */
#define TIM_AF1_BKCMP1P_Msk                                                (0x400UL)        /*!< TIM AF1: BKCMP1P (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP1P                                                    TIM_AF1_BKCMP1P_Msk
#define TIM_AF1_BKINP_Pos                                                  (9UL)        /*!<TIM AF1: BKINP (Bit 9) */
#define TIM_AF1_BKINP_Msk                                                  (0x200UL)        /*!< TIM AF1: BKINP (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKINP                                                      TIM_AF1_BKINP_Msk
#define TIM_AF1_BKCMP1E_Pos                                                (1UL)        /*!<TIM AF1: BKCMP1E (Bit 1) */
#define TIM_AF1_BKCMP1E_Msk                                                (0x2UL)        /*!< TIM AF1: BKCMP1E (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP1E                                                    TIM_AF1_BKCMP1E_Msk
#define TIM_AF1_BKINE_Pos                                                  (0UL)        /*!<TIM AF1: BKINE (Bit 0) */
#define TIM_AF1_BKINE_Msk                                                  (0x1UL)        /*!< TIM AF1: BKINE (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKINE                                                      TIM_AF1_BKINE_Msk

/* =====================================================    TISEL    =====================================================*/
#define TIM_TISEL_TI4SEL_Pos                                               (24UL)        /*!<TIM TISEL: TI4SEL (Bit 24) */
#define TIM_TISEL_TI4SEL_Msk                                               (0xf000000UL)        /*!< TIM TISEL: TI4SEL (Bitfield-Mask: 0x0f) */
#define TIM_TISEL_TI4SEL                                                   TIM_TISEL_TI4SEL_Msk
#define TIM_TISEL_TI4SEL_0                                                 (0x1U << TIM_TISEL_TI4SEL_Pos)
#define TIM_TISEL_TI4SEL_1                                                 (0x2U << TIM_TISEL_TI4SEL_Pos)
#define TIM_TISEL_TI4SEL_2                                                 (0x4U << TIM_TISEL_TI4SEL_Pos)
#define TIM_TISEL_TI4SEL_3                                                 (0x8U << TIM_TISEL_TI4SEL_Pos)
#define TIM_TISEL_TI3SEL_Pos                                               (16UL)        /*!<TIM TISEL: TI3SEL (Bit 16) */
#define TIM_TISEL_TI3SEL_Msk                                               (0xf0000UL)        /*!< TIM TISEL: TI3SEL (Bitfield-Mask: 0x0f) */
#define TIM_TISEL_TI3SEL                                                   TIM_TISEL_TI3SEL_Msk
#define TIM_TISEL_TI3SEL_0                                                 (0x1U << TIM_TISEL_TI3SEL_Pos)
#define TIM_TISEL_TI3SEL_1                                                 (0x2U << TIM_TISEL_TI3SEL_Pos)
#define TIM_TISEL_TI3SEL_2                                                 (0x4U << TIM_TISEL_TI3SEL_Pos)
#define TIM_TISEL_TI3SEL_3                                                 (0x8U << TIM_TISEL_TI3SEL_Pos)
#define TIM_TISEL_TI2SEL_Pos                                               (8UL)        /*!<TIM TISEL: TI2SEL (Bit 8) */
#define TIM_TISEL_TI2SEL_Msk                                               (0xf00UL)        /*!< TIM TISEL: TI2SEL (Bitfield-Mask: 0x0f) */
#define TIM_TISEL_TI2SEL                                                   TIM_TISEL_TI2SEL_Msk
#define TIM_TISEL_TI2SEL_0                                                 (0x1U << TIM_TISEL_TI2SEL_Pos)
#define TIM_TISEL_TI2SEL_1                                                 (0x2U << TIM_TISEL_TI2SEL_Pos)
#define TIM_TISEL_TI2SEL_2                                                 (0x4U << TIM_TISEL_TI2SEL_Pos)
#define TIM_TISEL_TI2SEL_3                                                 (0x8U << TIM_TISEL_TI2SEL_Pos)
#define TIM_TISEL_TI1SEL_Pos                                               (0UL)        /*!<TIM TISEL: TI1SEL (Bit 0) */
#define TIM_TISEL_TI1SEL_Msk                                               (0xfUL)        /*!< TIM TISEL: TI1SEL (Bitfield-Mask: 0x0f) */
#define TIM_TISEL_TI1SEL                                                   TIM_TISEL_TI1SEL_Msk
#define TIM_TISEL_TI1SEL_0                                                 (0x1U << TIM_TISEL_TI1SEL_Pos)
#define TIM_TISEL_TI1SEL_1                                                 (0x2U << TIM_TISEL_TI1SEL_Pos)
#define TIM_TISEL_TI1SEL_2                                                 (0x4U << TIM_TISEL_TI1SEL_Pos)
#define TIM_TISEL_TI1SEL_3                                                 (0x8U << TIM_TISEL_TI1SEL_Pos)


