stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    ISR    =====================================================*/
#define I2C_ISR_ADDCODE_Pos                                                (17UL)        /*!<I2C ISR: ADDCODE (Bit 17) */
#define I2C_ISR_ADDCODE_Msk                                                (0xfe0000UL)        /*!< I2C ISR: ADDCODE (Bitfield-Mask: 0x7f) */
#define I2C_ISR_ADDCODE                                                    I2C_ISR_ADDCODE_Msk
#define I2C_ISR_ADDCODE_0                                                  (0x1U << I2C_ISR_ADDCODE_Pos)
#define I2C_ISR_ADDCODE_1                                                  (0x2U << I2C_ISR_ADDCODE_Pos)
#define I2C_ISR_ADDCODE_2                                                  (0x4U << I2C_ISR_ADDCODE_Pos)
#define I2C_ISR_ADDCODE_3                                                  (0x8U << I2C_ISR_ADDCODE_Pos)
#define I2C_ISR_ADDCODE_4                                                  (0x10U << I2C_ISR_ADDCODE_Pos)
#define I2C_ISR_ADDCODE_5                                                  (0x20U << I2C_ISR_ADDCODE_Pos)
#define I2C_ISR_ADDCODE_6                                                  (0x40U << I2C_ISR_ADDCODE_Pos)
#define I2C_ISR_DIR_Pos                                                    (16UL)        /*!<I2C ISR: DIR (Bit 16) */
#define I2C_ISR_DIR_Msk                                                    (0x10000UL)        /*!< I2C ISR: DIR (Bitfield-Mask: 0x01) */
#define I2C_ISR_DIR                                                        I2C_ISR_DIR_Msk
#define I2C_ISR_BUSY_Pos                                                   (15UL)        /*!<I2C ISR: BUSY (Bit 15) */
#define I2C_ISR_BUSY_Msk                                                   (0x8000UL)        /*!< I2C ISR: BUSY (Bitfield-Mask: 0x01) */
#define I2C_ISR_BUSY                                                       I2C_ISR_BUSY_Msk
#define I2C_ISR_ALERT_Pos                                                  (13UL)        /*!<I2C ISR: ALERT (Bit 13) */
#define I2C_ISR_ALERT_Msk                                                  (0x2000UL)        /*!< I2C ISR: ALERT (Bitfield-Mask: 0x01) */
#define I2C_ISR_ALERT                                                      I2C_ISR_ALERT_Msk
#define I2C_ISR_TIMEOUT_Pos                                                (12UL)        /*!<I2C ISR: TIMEOUT (Bit 12) */
#define I2C_ISR_TIMEOUT_Msk                                                (0x1000UL)        /*!< I2C ISR: TIMEOUT (Bitfield-Mask: 0x01) */
#define I2C_ISR_TIMEOUT                                                    I2C_ISR_TIMEOUT_Msk
#define I2C_ISR_PECERR_Pos                                                 (11UL)        /*!<I2C ISR: PECERR (Bit 11) */
#define I2C_ISR_PECERR_Msk                                                 (0x800UL)        /*!< I2C ISR: PECERR (Bitfield-Mask: 0x01) */
#define I2C_ISR_PECERR                                                     I2C_ISR_PECERR_Msk
#define I2C_ISR_OVR_Pos                                                    (10UL)        /*!<I2C ISR: OVR (Bit 10) */
#define I2C_ISR_OVR_Msk                                                    (0x400UL)        /*!< I2C ISR: OVR (Bitfield-Mask: 0x01) */
#define I2C_ISR_OVR                                                        I2C_ISR_OVR_Msk
#define I2C_ISR_ARLO_Pos                                                   (9UL)        /*!<I2C ISR: ARLO (Bit 9) */
#define I2C_ISR_ARLO_Msk                                                   (0x200UL)        /*!< I2C ISR: ARLO (Bitfield-Mask: 0x01) */
#define I2C_ISR_ARLO                                                       I2C_ISR_ARLO_Msk
#define I2C_ISR_BERR_Pos                                                   (8UL)        /*!<I2C ISR: BERR (Bit 8) */
#define I2C_ISR_BERR_Msk                                                   (0x100UL)        /*!< I2C ISR: BERR (Bitfield-Mask: 0x01) */
#define I2C_ISR_BERR                                                       I2C_ISR_BERR_Msk
#define I2C_ISR_TCR_Pos                                                    (7UL)        /*!<I2C ISR: TCR (Bit 7) */
#define I2C_ISR_TCR_Msk                                                    (0x80UL)        /*!< I2C ISR: TCR (Bitfield-Mask: 0x01) */
#define I2C_ISR_TCR                                                        I2C_ISR_TCR_Msk
#define I2C_ISR_TC_Pos                                                     (6UL)        /*!<I2C ISR: TC (Bit 6) */
#define I2C_ISR_TC_Msk                                                     (0x40UL)        /*!< I2C ISR: TC (Bitfield-Mask: 0x01) */
#define I2C_ISR_TC                                                         I2C_ISR_TC_Msk
#define I2C_ISR_STOPF_Pos                                                  (5UL)        /*!<I2C ISR: STOPF (Bit 5) */
#define I2C_ISR_STOPF_Msk                                                  (0x20UL)        /*!< I2C ISR: STOPF (Bitfield-Mask: 0x01) */
#define I2C_ISR_STOPF                                                      I2C_ISR_STOPF_Msk
#define I2C_ISR_NACKF_Pos                                                  (4UL)        /*!<I2C ISR: NACKF (Bit 4) */
#define I2C_ISR_NACKF_Msk                                                  (0x10UL)        /*!< I2C ISR: NACKF (Bitfield-Mask: 0x01) */
#define I2C_ISR_NACKF                                                      I2C_ISR_NACKF_Msk
#define I2C_ISR_ADDR_Pos                                                   (3UL)        /*!<I2C ISR: ADDR (Bit 3) */
#define I2C_ISR_ADDR_Msk                                                   (0x8UL)        /*!< I2C ISR: ADDR (Bitfield-Mask: 0x01) */
#define I2C_ISR_ADDR                                                       I2C_ISR_ADDR_Msk
#define I2C_ISR_RXNE_Pos                                                   (2UL)        /*!<I2C ISR: RXNE (Bit 2) */
#define I2C_ISR_RXNE_Msk                                                   (0x4UL)        /*!< I2C ISR: RXNE (Bitfield-Mask: 0x01) */
#define I2C_ISR_RXNE                                                       I2C_ISR_RXNE_Msk
#define I2C_ISR_TXIS_Pos                                                   (1UL)        /*!<I2C ISR: TXIS (Bit 1) */
#define I2C_ISR_TXIS_Msk                                                   (0x2UL)        /*!< I2C ISR: TXIS (Bitfield-Mask: 0x01) */
#define I2C_ISR_TXIS                                                       I2C_ISR_TXIS_Msk
#define I2C_ISR_TXE_Pos                                                    (0UL)        /*!<I2C ISR: TXE (Bit 0) */
#define I2C_ISR_TXE_Msk                                                    (0x1UL)        /*!< I2C ISR: TXE (Bitfield-Mask: 0x01) */
#define I2C_ISR_TXE                                                        I2C_ISR_TXE_Msk

