stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* ============================================================================================================================*/
/*=====================                                       USART                                       =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR1    =====================================================*/
#define USART_CR1_RXFFIE_Pos                                               (31UL)        /*!<USART CR1: RXFFIE (Bit 31) */
#define USART_CR1_RXFFIE_Msk                                               (0x80000000UL)        /*!< USART CR1: RXFFIE (Bitfield-Mask: 0x01) */
#define USART_CR1_RXFFIE                                                   USART_CR1_RXFFIE_Msk
#define USART_CR1_TXFEIE_Pos                                               (30UL)        /*!<USART CR1: TXFEIE (Bit 30) */
#define USART_CR1_TXFEIE_Msk                                               (0x40000000UL)        /*!< USART CR1: TXFEIE (Bitfield-Mask: 0x01) */
#define USART_CR1_TXFEIE                                                   USART_CR1_TXFEIE_Msk
#define USART_CR1_FIFOEN_Pos                                               (29UL)        /*!<USART CR1: FIFOEN (Bit 29) */
#define USART_CR1_FIFOEN_Msk                                               (0x20000000UL)        /*!< USART CR1: FIFOEN (Bitfield-Mask: 0x01) */
#define USART_CR1_FIFOEN                                                   USART_CR1_FIFOEN_Msk
#define USART_CR1_EOBIE_Pos                                                (27UL)        /*!<USART CR1: EOBIE (Bit 27) */
#define USART_CR1_EOBIE_Msk                                                (0x8000000UL)        /*!< USART CR1: EOBIE (Bitfield-Mask: 0x01) */
#define USART_CR1_EOBIE                                                    USART_CR1_EOBIE_Msk
#define USART_CR1_RTOIE_Pos                                                (26UL)        /*!<USART CR1: RTOIE (Bit 26) */
#define USART_CR1_RTOIE_Msk                                                (0x4000000UL)        /*!< USART CR1: RTOIE (Bitfield-Mask: 0x01) */
#define USART_CR1_RTOIE                                                    USART_CR1_RTOIE_Msk
#define USART_CR1_DEAT_Pos                                                 (21UL)        /*!<USART CR1: DEAT (Bit 21) */
#define USART_CR1_DEAT_Msk                                                 (0x3e00000UL)        /*!< USART CR1: DEAT (Bitfield-Mask: 0x1f) */
#define USART_CR1_DEAT                                                     USART_CR1_DEAT_Msk
#define USART_CR1_DEAT_0                                                   (0x1U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEAT_1                                                   (0x2U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEAT_2                                                   (0x4U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEAT_3                                                   (0x8U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEAT_4                                                   (0x10U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEDT_Pos                                                 (16UL)        /*!<USART CR1: DEDT (Bit 16) */
#define USART_CR1_DEDT_Msk                                                 (0x1f0000UL)        /*!< USART CR1: DEDT (Bitfield-Mask: 0x1f) */
#define USART_CR1_DEDT                                                     USART_CR1_DEDT_Msk
#define USART_CR1_DEDT_0                                                   (0x1U << USART_CR1_DEDT_Pos)
#define USART_CR1_DEDT_1                                                   (0x2U << USART_CR1_DEDT_Pos)
#define USART_CR1_DEDT_2                                                   (0x4U << USART_CR1_DEDT_Pos)
#define USART_CR1_DEDT_3                                                   (0x8U << USART_CR1_DEDT_Pos)
#define USART_CR1_DEDT_4                                                   (0x10U << USART_CR1_DEDT_Pos)
#define USART_CR1_OVER8_Pos                                                (15UL)        /*!<USART CR1: OVER8 (Bit 15) */
#define USART_CR1_OVER8_Msk                                                (0x8000UL)        /*!< USART CR1: OVER8 (Bitfield-Mask: 0x01) */
#define USART_CR1_OVER8                                                    USART_CR1_OVER8_Msk
#define USART_CR1_CMIE_Pos                                                 (14UL)        /*!<USART CR1: CMIE (Bit 14) */
#define USART_CR1_CMIE_Msk                                                 (0x4000UL)        /*!< USART CR1: CMIE (Bitfield-Mask: 0x01) */
#define USART_CR1_CMIE                                                     USART_CR1_CMIE_Msk
#define USART_CR1_MME_Pos                                                  (13UL)        /*!<USART CR1: MME (Bit 13) */
#define USART_CR1_MME_Msk                                                  (0x2000UL)        /*!< USART CR1: MME (Bitfield-Mask: 0x01) */
#define USART_CR1_MME                                                      USART_CR1_MME_Msk
#define USART_CR1_M_Pos                                                    (12UL)        /*!<USART CR1: M (Bit 12) */
#define USART_CR1_M_Msk                                                    (0x10001000UL)        /*!< USART CR1: M (Bitfield-Mask: 0x10001) */
#define USART_CR1_M                                                        USART_CR1_M_Msk
#define USART_CR1_M0                                                       (0x1U << USART_CR1_M_Pos)
#define USART_CR1_M1                                                       (0x10000U << USART_CR1_M_Pos)
#define USART_CR1_WAKE_Pos                                                 (11UL)        /*!<USART CR1: WAKE (Bit 11) */
#define USART_CR1_WAKE_Msk                                                 (0x800UL)        /*!< USART CR1: WAKE (Bitfield-Mask: 0x01) */
#define USART_CR1_WAKE                                                     USART_CR1_WAKE_Msk
#define USART_CR1_PCE_Pos                                                  (10UL)        /*!<USART CR1: PCE (Bit 10) */
#define USART_CR1_PCE_Msk                                                  (0x400UL)        /*!< USART CR1: PCE (Bitfield-Mask: 0x01) */
#define USART_CR1_PCE                                                      USART_CR1_PCE_Msk
#define USART_CR1_PS_Pos                                                   (9UL)        /*!<USART CR1: PS (Bit 9) */
#define USART_CR1_PS_Msk                                                   (0x200UL)        /*!< USART CR1: PS (Bitfield-Mask: 0x01) */
#define USART_CR1_PS                                                       USART_CR1_PS_Msk
#define USART_CR1_PEIE_Pos                                                 (8UL)        /*!<USART CR1: PEIE (Bit 8) */
#define USART_CR1_PEIE_Msk                                                 (0x100UL)        /*!< USART CR1: PEIE (Bitfield-Mask: 0x01) */
#define USART_CR1_PEIE                                                     USART_CR1_PEIE_Msk
#define USART_CR1_TXEIE_TXFNFIE_Pos                                        (7UL)        /*!<USART CR1: TXEIE_TXFNFIE (Bit 7) */
#define USART_CR1_TXEIE_TXFNFIE_Msk                                        (0x80UL)        /*!< USART CR1: TXEIE_TXFNFIE (Bitfield-Mask: 0x01) */
#define USART_CR1_TXEIE_TXFNFIE                                            USART_CR1_TXEIE_TXFNFIE_Msk
#define USART_CR1_TCIE_Pos                                                 (6UL)        /*!<USART CR1: TCIE (Bit 6) */
#define USART_CR1_TCIE_Msk                                                 (0x40UL)        /*!< USART CR1: TCIE (Bitfield-Mask: 0x01) */
#define USART_CR1_TCIE                                                     USART_CR1_TCIE_Msk
#define USART_CR1_RXNEIE_RXFNEIE_Pos                                       (5UL)        /*!<USART CR1: RXNEIE_RXFNEIE (Bit 5) */
#define USART_CR1_RXNEIE_RXFNEIE_Msk                                       (0x20UL)        /*!< USART CR1: RXNEIE_RXFNEIE (Bitfield-Mask: 0x01) */
#define USART_CR1_RXNEIE_RXFNEIE                                           USART_CR1_RXNEIE_RXFNEIE_Msk
#define USART_CR1_IDLEIE_Pos                                               (4UL)        /*!<USART CR1: IDLEIE (Bit 4) */
#define USART_CR1_IDLEIE_Msk                                               (0x10UL)        /*!< USART CR1: IDLEIE (Bitfield-Mask: 0x01) */
#define USART_CR1_IDLEIE                                                   USART_CR1_IDLEIE_Msk
#define USART_CR1_TE_Pos                                                   (3UL)        /*!<USART CR1: TE (Bit 3) */
#define USART_CR1_TE_Msk                                                   (0x8UL)        /*!< USART CR1: TE (Bitfield-Mask: 0x01) */
#define USART_CR1_TE                                                       USART_CR1_TE_Msk
#define USART_CR1_RE_Pos                                                   (2UL)        /*!<USART CR1: RE (Bit 2) */
#define USART_CR1_RE_Msk                                                   (0x4UL)        /*!< USART CR1: RE (Bitfield-Mask: 0x01) */
#define USART_CR1_RE                                                       USART_CR1_RE_Msk
#define USART_CR1_UESM_Pos                                                 (1UL)        /*!<USART CR1: UESM (Bit 1) */
#define USART_CR1_UESM_Msk                                                 (0x2UL)        /*!< USART CR1: UESM (Bitfield-Mask: 0x01) */
#define USART_CR1_UESM                                                     USART_CR1_UESM_Msk
#define USART_CR1_UE_Pos                                                   (0UL)        /*!<USART CR1: UE (Bit 0) */
#define USART_CR1_UE_Msk                                                   (0x1UL)        /*!< USART CR1: UE (Bitfield-Mask: 0x01) */
#define USART_CR1_UE                                                       USART_CR1_UE_Msk

/* =====================================================    CR2    =====================================================*/
#define USART_CR2_ADD_Pos                                                  (24UL)        /*!<USART CR2: ADD (Bit 24) */
#define USART_CR2_ADD_Msk                                                  (0xff000000UL)        /*!< USART CR2: ADD (Bitfield-Mask: 0xff) */
#define USART_CR2_ADD                                                      USART_CR2_ADD_Msk
#define USART_CR2_ADD_0                                                    (0x1U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_1                                                    (0x2U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_2                                                    (0x4U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_3                                                    (0x8U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_4                                                    (0x10U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_5                                                    (0x20U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_6                                                    (0x40U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_7                                                    (0x80U << USART_CR2_ADD_Pos)
#define USART_CR2_RTOEN_Pos                                                (23UL)        /*!<USART CR2: RTOEN (Bit 23) */
#define USART_CR2_RTOEN_Msk                                                (0x800000UL)        /*!< USART CR2: RTOEN (Bitfield-Mask: 0x01) */
#define USART_CR2_RTOEN                                                    USART_CR2_RTOEN_Msk
#define USART_CR2_ABRMODE_Pos                                              (21UL)        /*!<USART CR2: ABRMODE (Bit 21) */
#define USART_CR2_ABRMODE_Msk                                              (0x600000UL)        /*!< USART CR2: ABRMODE (Bitfield-Mask: 0x03) */
#define USART_CR2_ABRMODE                                                  USART_CR2_ABRMODE_Msk
#define USART_CR2_ABRMODE_0                                                (0x1U << USART_CR2_ABRMODE_Pos)
#define USART_CR2_ABRMODE_1                                                (0x2U << USART_CR2_ABRMODE_Pos)
#define USART_CR2_ABREN_Pos                                                (20UL)        /*!<USART CR2: ABREN (Bit 20) */
#define USART_CR2_ABREN_Msk                                                (0x100000UL)        /*!< USART CR2: ABREN (Bitfield-Mask: 0x01) */
#define USART_CR2_ABREN                                                    USART_CR2_ABREN_Msk
#define USART_CR2_MSBFIRST_Pos                                             (19UL)        /*!<USART CR2: MSBFIRST (Bit 19) */
#define USART_CR2_MSBFIRST_Msk                                             (0x80000UL)        /*!< USART CR2: MSBFIRST (Bitfield-Mask: 0x01) */
#define USART_CR2_MSBFIRST                                                 USART_CR2_MSBFIRST_Msk
#define USART_CR2_DATAINV_Pos                                              (18UL)        /*!<USART CR2: DATAINV (Bit 18) */
#define USART_CR2_DATAINV_Msk                                              (0x40000UL)        /*!< USART CR2: DATAINV (Bitfield-Mask: 0x01) */
#define USART_CR2_DATAINV                                                  USART_CR2_DATAINV_Msk
#define USART_CR2_TXINV_Pos                                                (17UL)        /*!<USART CR2: TXINV (Bit 17) */
#define USART_CR2_TXINV_Msk                                                (0x20000UL)        /*!< USART CR2: TXINV (Bitfield-Mask: 0x01) */
#define USART_CR2_TXINV                                                    USART_CR2_TXINV_Msk
#define USART_CR2_RXINV_Pos                                                (16UL)        /*!<USART CR2: RXINV (Bit 16) */
#define USART_CR2_RXINV_Msk                                                (0x10000UL)        /*!< USART CR2: RXINV (Bitfield-Mask: 0x01) */
#define USART_CR2_RXINV                                                    USART_CR2_RXINV_Msk
#define USART_CR2_SWAP_Pos                                                 (15UL)        /*!<USART CR2: SWAP (Bit 15) */
#define USART_CR2_SWAP_Msk                                                 (0x8000UL)        /*!< USART CR2: SWAP (Bitfield-Mask: 0x01) */
#define USART_CR2_SWAP                                                     USART_CR2_SWAP_Msk
#define USART_CR2_LINEN_Pos                                                (14UL)        /*!<USART CR2: LINEN (Bit 14) */
#define USART_CR2_LINEN_Msk                                                (0x4000UL)        /*!< USART CR2: LINEN (Bitfield-Mask: 0x01) */
#define USART_CR2_LINEN                                                    USART_CR2_LINEN_Msk
#define USART_CR2_STOP_Pos                                                 (12UL)        /*!<USART CR2: STOP (Bit 12) */
#define USART_CR2_STOP_Msk                                                 (0x3000UL)        /*!< USART CR2: STOP (Bitfield-Mask: 0x03) */
#define USART_CR2_STOP                                                     USART_CR2_STOP_Msk
#define USART_CR2_STOP_0                                                   (0x1U << USART_CR2_STOP_Pos)
#define USART_CR2_STOP_1                                                   (0x2U << USART_CR2_STOP_Pos)
#define USART_CR2_CLKEN_Pos                                                (11UL)        /*!<USART CR2: CLKEN (Bit 11) */
#define USART_CR2_CLKEN_Msk                                                (0x800UL)        /*!< USART CR2: CLKEN (Bitfield-Mask: 0x01) */
#define USART_CR2_CLKEN                                                    USART_CR2_CLKEN_Msk
#define USART_CR2_CPOL_Pos                                                 (10UL)        /*!<USART CR2: CPOL (Bit 10) */
#define USART_CR2_CPOL_Msk                                                 (0x400UL)        /*!< USART CR2: CPOL (Bitfield-Mask: 0x01) */
#define USART_CR2_CPOL                                                     USART_CR2_CPOL_Msk
#define USART_CR2_CPHA_Pos                                                 (9UL)        /*!<USART CR2: CPHA (Bit 9) */
#define USART_CR2_CPHA_Msk                                                 (0x200UL)        /*!< USART CR2: CPHA (Bitfield-Mask: 0x01) */
#define USART_CR2_CPHA                                                     USART_CR2_CPHA_Msk
#define USART_CR2_LBCL_Pos                                                 (8UL)        /*!<USART CR2: LBCL (Bit 8) */
#define USART_CR2_LBCL_Msk                                                 (0x100UL)        /*!< USART CR2: LBCL (Bitfield-Mask: 0x01) */
#define USART_CR2_LBCL                                                     USART_CR2_LBCL_Msk
#define USART_CR2_LBDIE_Pos                                                (6UL)        /*!<USART CR2: LBDIE (Bit 6) */
#define USART_CR2_LBDIE_Msk                                                (0x40UL)        /*!< USART CR2: LBDIE (Bitfield-Mask: 0x01) */
#define USART_CR2_LBDIE                                                    USART_CR2_LBDIE_Msk
#define USART_CR2_LBDL_Pos                                                 (5UL)        /*!<USART CR2: LBDL (Bit 5) */
#define USART_CR2_LBDL_Msk                                                 (0x20UL)        /*!< USART CR2: LBDL (Bitfield-Mask: 0x01) */
#define USART_CR2_LBDL                                                     USART_CR2_LBDL_Msk
#define USART_CR2_ADDM7_Pos                                                (4UL)        /*!<USART CR2: ADDM7 (Bit 4) */
#define USART_CR2_ADDM7_Msk                                                (0x10UL)        /*!< USART CR2: ADDM7 (Bitfield-Mask: 0x01) */
#define USART_CR2_ADDM7                                                    USART_CR2_ADDM7_Msk
#define USART_CR2_DIS_NSS_Pos                                              (3UL)        /*!<USART CR2: DIS_NSS (Bit 3) */
#define USART_CR2_DIS_NSS_Msk                                              (0x8UL)        /*!< USART CR2: DIS_NSS (Bitfield-Mask: 0x01) */
#define USART_CR2_DIS_NSS                                                  USART_CR2_DIS_NSS_Msk
#define USART_CR2_SLVEN_Pos                                                (0UL)        /*!<USART CR2: SLVEN (Bit 0) */
#define USART_CR2_SLVEN_Msk                                                (0x1UL)        /*!< USART CR2: SLVEN (Bitfield-Mask: 0x01) */
#define USART_CR2_SLVEN                                                    USART_CR2_SLVEN_Msk

