stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    CR3    =====================================================*/
#define USART_CR3_TXFTCFG_Pos                                              (29UL)        /*!<USART CR3: TXFTCFG (Bit 29) */
#define USART_CR3_TXFTCFG_Msk                                              (0xe0000000UL)        /*!< USART CR3: TXFTCFG (Bitfield-Mask: 0x07) */
#define USART_CR3_TXFTCFG                                                  USART_CR3_TXFTCFG_Msk
#define USART_CR3_TXFTCFG_0                                                (0x1U << USART_CR3_TXFTCFG_Pos)
#define USART_CR3_TXFTCFG_1                                                (0x2U << USART_CR3_TXFTCFG_Pos)
#define USART_CR3_TXFTCFG_2                                                (0x4U << USART_CR3_TXFTCFG_Pos)
#define USART_CR3_RXFTIE_Pos                                               (28UL)        /*!<USART CR3: RXFTIE (Bit 28) */
#define USART_CR3_RXFTIE_Msk                                               (0x10000000UL)        /*!< USART CR3: RXFTIE (Bitfield-Mask: 0x01) */
#define USART_CR3_RXFTIE                                                   USART_CR3_RXFTIE_Msk
#define USART_CR3_RXFTCFG_Pos                                              (25UL)        /*!<USART CR3: RXFTCFG (Bit 25) */
#define USART_CR3_RXFTCFG_Msk                                              (0xe000000UL)        /*!< USART CR3: RXFTCFG (Bitfield-Mask: 0x07) */
#define USART_CR3_RXFTCFG                                                  USART_CR3_RXFTCFG_Msk
#define USART_CR3_RXFTCFG_0                                                (0x1U << USART_CR3_RXFTCFG_Pos)
#define USART_CR3_RXFTCFG_1                                                (0x2U << USART_CR3_RXFTCFG_Pos)
#define USART_CR3_RXFTCFG_2                                                (0x4U << USART_CR3_RXFTCFG_Pos)
#define USART_CR3_TCBGTIE_Pos                                              (24UL)        /*!<USART CR3: TCBGTIE (Bit 24) */
#define USART_CR3_TCBGTIE_Msk                                              (0x1000000UL)        /*!< USART CR3: TCBGTIE (Bitfield-Mask: 0x01) */
#define USART_CR3_TCBGTIE                                                  USART_CR3_TCBGTIE_Msk
#define USART_CR3_TXFTIE_Pos                                               (23UL)        /*!<USART CR3: TXFTIE (Bit 23) */
#define USART_CR3_TXFTIE_Msk                                               (0x800000UL)        /*!< USART CR3: TXFTIE (Bitfield-Mask: 0x01) */
#define USART_CR3_TXFTIE                                                   USART_CR3_TXFTIE_Msk
#define USART_CR3_WUFIE_Pos                                                (22UL)        /*!<USART CR3: WUFIE (Bit 22) */
#define USART_CR3_WUFIE_Msk                                                (0x400000UL)        /*!< USART CR3: WUFIE (Bitfield-Mask: 0x01) */
#define USART_CR3_WUFIE                                                    USART_CR3_WUFIE_Msk
#define USART_CR3_WUS_Pos                                                  (20UL)        /*!<USART CR3: WUS (Bit 20) */
#define USART_CR3_WUS_Msk                                                  (0x300000UL)        /*!< USART CR3: WUS (Bitfield-Mask: 0x03) */
#define USART_CR3_WUS                                                      USART_CR3_WUS_Msk
#define USART_CR3_WUS_0                                                    (0x1U << USART_CR3_WUS_Pos)
#define USART_CR3_WUS_1                                                    (0x2U << USART_CR3_WUS_Pos)
#define USART_CR3_SCARCNT_Pos                                              (17UL)        /*!<USART CR3: SCARCNT (Bit 17) */
#define USART_CR3_SCARCNT_Msk                                              (0xe0000UL)        /*!< USART CR3: SCARCNT (Bitfield-Mask: 0x07) */
#define USART_CR3_SCARCNT                                                  USART_CR3_SCARCNT_Msk
#define USART_CR3_SCARCNT_0                                                (0x1U << USART_CR3_SCARCNT_Pos)
#define USART_CR3_SCARCNT_1                                                (0x2U << USART_CR3_SCARCNT_Pos)
#define USART_CR3_SCARCNT_2                                                (0x4U << USART_CR3_SCARCNT_Pos)
#define USART_CR3_DEP_Pos                                                  (15UL)        /*!<USART CR3: DEP (Bit 15) */
#define USART_CR3_DEP_Msk                                                  (0x8000UL)        /*!< USART CR3: DEP (Bitfield-Mask: 0x01) */
#define USART_CR3_DEP                                                      USART_CR3_DEP_Msk
#define USART_CR3_DEM_Pos                                                  (14UL)        /*!<USART CR3: DEM (Bit 14) */
#define USART_CR3_DEM_Msk                                                  (0x4000UL)        /*!< USART CR3: DEM (Bitfield-Mask: 0x01) */
#define USART_CR3_DEM                                                      USART_CR3_DEM_Msk
#define USART_CR3_DDRE_Pos                                                 (13UL)        /*!<USART CR3: DDRE (Bit 13) */
#define USART_CR3_DDRE_Msk                                                 (0x2000UL)        /*!< USART CR3: DDRE (Bitfield-Mask: 0x01) */
#define USART_CR3_DDRE                                                     USART_CR3_DDRE_Msk
#define USART_CR3_OVRDIS_Pos                                               (12UL)        /*!<USART CR3: OVRDIS (Bit 12) */
#define USART_CR3_OVRDIS_Msk                                               (0x1000UL)        /*!< USART CR3: OVRDIS (Bitfield-Mask: 0x01) */
#define USART_CR3_OVRDIS                                                   USART_CR3_OVRDIS_Msk
#define USART_CR3_ONEBIT_Pos                                               (11UL)        /*!<USART CR3: ONEBIT (Bit 11) */
#define USART_CR3_ONEBIT_Msk                                               (0x800UL)        /*!< USART CR3: ONEBIT (Bitfield-Mask: 0x01) */
#define USART_CR3_ONEBIT                                                   USART_CR3_ONEBIT_Msk
#define USART_CR3_CTSIE_Pos                                                (10UL)        /*!<USART CR3: CTSIE (Bit 10) */
#define USART_CR3_CTSIE_Msk                                                (0x400UL)        /*!< USART CR3: CTSIE (Bitfield-Mask: 0x01) */
#define USART_CR3_CTSIE                                                    USART_CR3_CTSIE_Msk
#define USART_CR3_CTSE_Pos                                                 (9UL)        /*!<USART CR3: CTSE (Bit 9) */
#define USART_CR3_CTSE_Msk                                                 (0x200UL)        /*!< USART CR3: CTSE (Bitfield-Mask: 0x01) */
#define USART_CR3_CTSE                                                     USART_CR3_CTSE_Msk
#define USART_CR3_RTSE_Pos                                                 (8UL)        /*!<USART CR3: RTSE (Bit 8) */
#define USART_CR3_RTSE_Msk                                                 (0x100UL)        /*!< USART CR3: RTSE (Bitfield-Mask: 0x01) */
#define USART_CR3_RTSE                                                     USART_CR3_RTSE_Msk
#define USART_CR3_DMAT_Pos                                                 (7UL)        /*!<USART CR3: DMAT (Bit 7) */
#define USART_CR3_DMAT_Msk                                                 (0x80UL)        /*!< USART CR3: DMAT (Bitfield-Mask: 0x01) */
#define USART_CR3_DMAT                                                     USART_CR3_DMAT_Msk
#define USART_CR3_DMAR_Pos                                                 (6UL)        /*!<USART CR3: DMAR (Bit 6) */
#define USART_CR3_DMAR_Msk                                                 (0x40UL)        /*!< USART CR3: DMAR (Bitfield-Mask: 0x01) */
#define USART_CR3_DMAR                                                     USART_CR3_DMAR_Msk
#define USART_CR3_SCEN_Pos                                                 (5UL)        /*!<USART CR3: SCEN (Bit 5) */
#define USART_CR3_SCEN_Msk                                                 (0x20UL)        /*!< USART CR3: SCEN (Bitfield-Mask: 0x01) */
#define USART_CR3_SCEN                                                     USART_CR3_SCEN_Msk
#define USART_CR3_NACK_Pos                                                 (4UL)        /*!<USART CR3: NACK (Bit 4) */
#define USART_CR3_NACK_Msk                                                 (0x10UL)        /*!< USART CR3: NACK (Bitfield-Mask: 0x01) */
#define USART_CR3_NACK                                                     USART_CR3_NACK_Msk
#define USART_CR3_HDSEL_Pos                                                (3UL)        /*!<USART CR3: HDSEL (Bit 3) */
#define USART_CR3_HDSEL_Msk                                                (0x8UL)        /*!< USART CR3: HDSEL (Bitfield-Mask: 0x01) */
#define USART_CR3_HDSEL                                                    USART_CR3_HDSEL_Msk
#define USART_CR3_IRLP_Pos                                                 (2UL)        /*!<USART CR3: IRLP (Bit 2) */
#define USART_CR3_IRLP_Msk                                                 (0x4UL)        /*!< USART CR3: IRLP (Bitfield-Mask: 0x01) */
#define USART_CR3_IRLP                                                     USART_CR3_IRLP_Msk
#define USART_CR3_IREN_Pos                                                 (1UL)        /*!<USART CR3: IREN (Bit 1) */
#define USART_CR3_IREN_Msk                                                 (0x2UL)        /*!< USART CR3: IREN (Bitfield-Mask: 0x01) */
#define USART_CR3_IREN                                                     USART_CR3_IREN_Msk
#define USART_CR3_EIE_Pos                                                  (0UL)        /*!<USART CR3: EIE (Bit 0) */
#define USART_CR3_EIE_Msk                                                  (0x1UL)        /*!< USART CR3: EIE (Bitfield-Mask: 0x01) */
#define USART_CR3_EIE                                                      USART_CR3_EIE_Msk

/* =====================================================    BRR    =====================================================*/
#define USART_BRR_BRR_Pos                                                  (0UL)        /*!<USART BRR: BRR (Bit 0) */
#define USART_BRR_BRR_Msk                                                  (0xfffffUL)        /*!< USART BRR: BRR (Bitfield-Mask: 0xfffff) */
#define USART_BRR_BRR                                                      USART_BRR_BRR_Msk
#define USART_BRR_BRR_0                                                    (0x1U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_1                                                    (0x2U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_2                                                    (0x4U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_3                                                    (0x8U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_4                                                    (0x10U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_5                                                    (0x20U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_6                                                    (0x40U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_7                                                    (0x80U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_8                                                    (0x100U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_9                                                    (0x200U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_10                                                   (0x400U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_11                                                   (0x800U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_12                                                   (0x1000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_13                                                   (0x2000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_14                                                   (0x4000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_15                                                   (0x8000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_16                                                   (0x10000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_17                                                   (0x20000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_18                                                   (0x40000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_19                                                   (0x80000U << USART_BRR_BRR_Pos)

