stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    GTPR    =====================================================*/
#define USART_GTPR_GT_Pos                                                  (8UL)        /*!<USART GTPR: GT (Bit 8) */
#define USART_GTPR_GT_Msk                                                  (0xff00UL)        /*!< USART GTPR: GT (Bitfield-Mask: 0xff) */
#define USART_GTPR_GT                                                      USART_GTPR_GT_Msk
#define USART_GTPR_GT_0                                                    (0x1U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_1                                                    (0x2U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_2                                                    (0x4U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_3                                                    (0x8U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_4                                                    (0x10U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_5                                                    (0x20U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_6                                                    (0x40U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_7                                                    (0x80U << USART_GTPR_GT_Pos)
#define USART_GTPR_PSC_Pos                                                 (0UL)        /*!<USART GTPR: PSC (Bit 0) */
#define USART_GTPR_PSC_Msk                                                 (0xffUL)        /*!< USART GTPR: PSC (Bitfield-Mask: 0xff) */
#define USART_GTPR_PSC                                                     USART_GTPR_PSC_Msk
#define USART_GTPR_PSC_0                                                   (0x1U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_1                                                   (0x2U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_2                                                   (0x4U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_3                                                   (0x8U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_4                                                   (0x10U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_5                                                   (0x20U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_6                                                   (0x40U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_7                                                   (0x80U << USART_GTPR_PSC_Pos)

/* =====================================================    RTOR    =====================================================*/
#define USART_RTOR_BLEN_Pos                                                (24UL)        /*!<USART RTOR: BLEN (Bit 24) */
#define USART_RTOR_BLEN_Msk                                                (0xff000000UL)        /*!< USART RTOR: BLEN (Bitfield-Mask: 0xff) */
#define USART_RTOR_BLEN                                                    USART_RTOR_BLEN_Msk
#define USART_RTOR_BLEN_0                                                  (0x1U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_1                                                  (0x2U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_2                                                  (0x4U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_3                                                  (0x8U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_4                                                  (0x10U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_5                                                  (0x20U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_6                                                  (0x40U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_7                                                  (0x80U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_RTO_Pos                                                 (0UL)        /*!<USART RTOR: RTO (Bit 0) */
#define USART_RTOR_RTO_Msk                                                 (0xffffffUL)        /*!< USART RTOR: RTO (Bitfield-Mask: 0xffffff) */
#define USART_RTOR_RTO                                                     USART_RTOR_RTO_Msk
#define USART_RTOR_RTO_0                                                   (0x1U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_1                                                   (0x2U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_2                                                   (0x4U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_3                                                   (0x8U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_4                                                   (0x10U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_5                                                   (0x20U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_6                                                   (0x40U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_7                                                   (0x80U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_8                                                   (0x100U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_9                                                   (0x200U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_10                                                  (0x400U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_11                                                  (0x800U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_12                                                  (0x1000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_13                                                  (0x2000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_14                                                  (0x4000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_15                                                  (0x8000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_16                                                  (0x10000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_17                                                  (0x20000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_18                                                  (0x40000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_19                                                  (0x80000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_20                                                  (0x100000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_21                                                  (0x200000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_22                                                  (0x400000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_23                                                  (0x800000U << USART_RTOR_RTO_Pos)

/* =====================================================    RQR    =====================================================*/
#define USART_RQR_TXFRQ_Pos                                                (4UL)        /*!<USART RQR: TXFRQ (Bit 4) */
#define USART_RQR_TXFRQ_Msk                                                (0x10UL)        /*!< USART RQR: TXFRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_TXFRQ                                                    USART_RQR_TXFRQ_Msk
#define USART_RQR_RXFRQ_Pos                                                (3UL)        /*!<USART RQR: RXFRQ (Bit 3) */
#define USART_RQR_RXFRQ_Msk                                                (0x8UL)        /*!< USART RQR: RXFRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_RXFRQ                                                    USART_RQR_RXFRQ_Msk
#define USART_RQR_MMRQ_Pos                                                 (2UL)        /*!<USART RQR: MMRQ (Bit 2) */
#define USART_RQR_MMRQ_Msk                                                 (0x4UL)        /*!< USART RQR: MMRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_MMRQ                                                     USART_RQR_MMRQ_Msk
#define USART_RQR_SBKRQ_Pos                                                (1UL)        /*!<USART RQR: SBKRQ (Bit 1) */
#define USART_RQR_SBKRQ_Msk                                                (0x2UL)        /*!< USART RQR: SBKRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_SBKRQ                                                    USART_RQR_SBKRQ_Msk
#define USART_RQR_ABRRQ_Pos                                                (0UL)        /*!<USART RQR: ABRRQ (Bit 0) */
#define USART_RQR_ABRRQ_Msk                                                (0x1UL)        /*!< USART RQR: ABRRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_ABRRQ                                                    USART_RQR_ABRRQ_Msk

