stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    ISR    =====================================================*/
#define USART_ISR_TXFT_Pos                                                 (27UL)        /*!<USART ISR: TXFT (Bit 27) */
#define USART_ISR_TXFT_Msk                                                 (0x8000000UL)        /*!< USART ISR: TXFT (Bitfield-Mask: 0x01) */
#define USART_ISR_TXFT                                                     USART_ISR_TXFT_Msk
#define USART_ISR_RXFT_Pos                                                 (26UL)        /*!<USART ISR: RXFT (Bit 26) */
#define USART_ISR_RXFT_Msk                                                 (0x4000000UL)        /*!< USART ISR: RXFT (Bitfield-Mask: 0x01) */
#define USART_ISR_RXFT                                                     USART_ISR_RXFT_Msk
#define USART_ISR_TCBGT_Pos                                                (25UL)        /*!<USART ISR: TCBGT (Bit 25) */
#define USART_ISR_TCBGT_Msk                                                (0x2000000UL)        /*!< USART ISR: TCBGT (Bitfield-Mask: 0x01) */
#define USART_ISR_TCBGT                                                    USART_ISR_TCBGT_Msk
#define USART_ISR_RXFF_Pos                                                 (24UL)        /*!<USART ISR: RXFF (Bit 24) */
#define USART_ISR_RXFF_Msk                                                 (0x1000000UL)        /*!< USART ISR: RXFF (Bitfield-Mask: 0x01) */
#define USART_ISR_RXFF                                                     USART_ISR_RXFF_Msk
#define USART_ISR_TXFE_Pos                                                 (23UL)        /*!<USART ISR: TXFE (Bit 23) */
#define USART_ISR_TXFE_Msk                                                 (0x800000UL)        /*!< USART ISR: TXFE (Bitfield-Mask: 0x01) */
#define USART_ISR_TXFE                                                     USART_ISR_TXFE_Msk
#define USART_ISR_REACK_Pos                                                (22UL)        /*!<USART ISR: REACK (Bit 22) */
#define USART_ISR_REACK_Msk                                                (0x400000UL)        /*!< USART ISR: REACK (Bitfield-Mask: 0x01) */
#define USART_ISR_REACK                                                    USART_ISR_REACK_Msk
#define USART_ISR_TEACK_Pos                                                (21UL)        /*!<USART ISR: TEACK (Bit 21) */
#define USART_ISR_TEACK_Msk                                                (0x200000UL)        /*!< USART ISR: TEACK (Bitfield-Mask: 0x01) */
#define USART_ISR_TEACK                                                    USART_ISR_TEACK_Msk
#define USART_ISR_WUF_Pos                                                  (20UL)        /*!<USART ISR: WUF (Bit 20) */
#define USART_ISR_WUF_Msk                                                  (0x100000UL)        /*!< USART ISR: WUF (Bitfield-Mask: 0x01) */
#define USART_ISR_WUF                                                      USART_ISR_WUF_Msk
#define USART_ISR_RWU_Pos                                                  (19UL)        /*!<USART ISR: RWU (Bit 19) */
#define USART_ISR_RWU_Msk                                                  (0x80000UL)        /*!< USART ISR: RWU (Bitfield-Mask: 0x01) */
#define USART_ISR_RWU                                                      USART_ISR_RWU_Msk
#define USART_ISR_SBKF_Pos                                                 (18UL)        /*!<USART ISR: SBKF (Bit 18) */
#define USART_ISR_SBKF_Msk                                                 (0x40000UL)        /*!< USART ISR: SBKF (Bitfield-Mask: 0x01) */
#define USART_ISR_SBKF                                                     USART_ISR_SBKF_Msk
#define USART_ISR_CMF_Pos                                                  (17UL)        /*!<USART ISR: CMF (Bit 17) */
#define USART_ISR_CMF_Msk                                                  (0x20000UL)        /*!< USART ISR: CMF (Bitfield-Mask: 0x01) */
#define USART_ISR_CMF                                                      USART_ISR_CMF_Msk
#define USART_ISR_BUSY_Pos                                                 (16UL)        /*!<USART ISR: BUSY (Bit 16) */
#define USART_ISR_BUSY_Msk                                                 (0x10000UL)        /*!< USART ISR: BUSY (Bitfield-Mask: 0x01) */
#define USART_ISR_BUSY                                                     USART_ISR_BUSY_Msk
#define USART_ISR_ABRF_Pos                                                 (15UL)        /*!<USART ISR: ABRF (Bit 15) */
#define USART_ISR_ABRF_Msk                                                 (0x8000UL)        /*!< USART ISR: ABRF (Bitfield-Mask: 0x01) */
#define USART_ISR_ABRF                                                     USART_ISR_ABRF_Msk
#define USART_ISR_ABRE_Pos                                                 (14UL)        /*!<USART ISR: ABRE (Bit 14) */
#define USART_ISR_ABRE_Msk                                                 (0x4000UL)        /*!< USART ISR: ABRE (Bitfield-Mask: 0x01) */
#define USART_ISR_ABRE                                                     USART_ISR_ABRE_Msk
#define USART_ISR_UDR_Pos                                                  (13UL)        /*!<USART ISR: UDR (Bit 13) */
#define USART_ISR_UDR_Msk                                                  (0x2000UL)        /*!< USART ISR: UDR (Bitfield-Mask: 0x01) */
#define USART_ISR_UDR                                                      USART_ISR_UDR_Msk
#define USART_ISR_EOBF_Pos                                                 (12UL)        /*!<USART ISR: EOBF (Bit 12) */
#define USART_ISR_EOBF_Msk                                                 (0x1000UL)        /*!< USART ISR: EOBF (Bitfield-Mask: 0x01) */
#define USART_ISR_EOBF                                                     USART_ISR_EOBF_Msk
#define USART_ISR_RTOF_Pos                                                 (11UL)        /*!<USART ISR: RTOF (Bit 11) */
#define USART_ISR_RTOF_Msk                                                 (0x800UL)        /*!< USART ISR: RTOF (Bitfield-Mask: 0x01) */
#define USART_ISR_RTOF                                                     USART_ISR_RTOF_Msk
#define USART_ISR_CTS_Pos                                                  (10UL)        /*!<USART ISR: CTS (Bit 10) */
#define USART_ISR_CTS_Msk                                                  (0x400UL)        /*!< USART ISR: CTS (Bitfield-Mask: 0x01) */
#define USART_ISR_CTS                                                      USART_ISR_CTS_Msk
#define USART_ISR_CTSIF_Pos                                                (9UL)        /*!<USART ISR: CTSIF (Bit 9) */
#define USART_ISR_CTSIF_Msk                                                (0x200UL)        /*!< USART ISR: CTSIF (Bitfield-Mask: 0x01) */
#define USART_ISR_CTSIF                                                    USART_ISR_CTSIF_Msk
#define USART_ISR_LBDF_Pos                                                 (8UL)        /*!<USART ISR: LBDF (Bit 8) */
#define USART_ISR_LBDF_Msk                                                 (0x100UL)        /*!< USART ISR: LBDF (Bitfield-Mask: 0x01) */
#define USART_ISR_LBDF                                                     USART_ISR_LBDF_Msk
#define USART_ISR_TXE_TXFNF_Pos                                            (7UL)        /*!<USART ISR: TXE_TXFNF (Bit 7) */
#define USART_ISR_TXE_TXFNF_Msk                                            (0x80UL)        /*!< USART ISR: TXE_TXFNF (Bitfield-Mask: 0x01) */
#define USART_ISR_TXE_TXFNF                                                USART_ISR_TXE_TXFNF_Msk
#define USART_ISR_TC_Pos                                                   (6UL)        /*!<USART ISR: TC (Bit 6) */
#define USART_ISR_TC_Msk                                                   (0x40UL)        /*!< USART ISR: TC (Bitfield-Mask: 0x01) */
#define USART_ISR_TC                                                       USART_ISR_TC_Msk
#define USART_ISR_RXNE_RXFNE_Pos                                           (5UL)        /*!<USART ISR: RXNE_RXFNE (Bit 5) */
#define USART_ISR_RXNE_RXFNE_Msk                                           (0x20UL)        /*!< USART ISR: RXNE_RXFNE (Bitfield-Mask: 0x01) */
#define USART_ISR_RXNE_RXFNE                                               USART_ISR_RXNE_RXFNE_Msk
#define USART_ISR_IDLE_Pos                                                 (4UL)        /*!<USART ISR: IDLE (Bit 4) */
#define USART_ISR_IDLE_Msk                                                 (0x10UL)        /*!< USART ISR: IDLE (Bitfield-Mask: 0x01) */
#define USART_ISR_IDLE                                                     USART_ISR_IDLE_Msk
#define USART_ISR_ORE_Pos                                                  (3UL)        /*!<USART ISR: ORE (Bit 3) */
#define USART_ISR_ORE_Msk                                                  (0x8UL)        /*!< USART ISR: ORE (Bitfield-Mask: 0x01) */
#define USART_ISR_ORE                                                      USART_ISR_ORE_Msk
#define USART_ISR_NE_Pos                                                   (2UL)        /*!<USART ISR: NE (Bit 2) */
#define USART_ISR_NE_Msk                                                   (0x4UL)        /*!< USART ISR: NE (Bitfield-Mask: 0x01) */
#define USART_ISR_NE                                                       USART_ISR_NE_Msk
#define USART_ISR_FE_Pos                                                   (1UL)        /*!<USART ISR: FE (Bit 1) */
#define USART_ISR_FE_Msk                                                   (0x2UL)        /*!< USART ISR: FE (Bitfield-Mask: 0x01) */
#define USART_ISR_FE                                                       USART_ISR_FE_Msk
#define USART_ISR_PE_Pos                                                   (0UL)        /*!<USART ISR: PE (Bit 0) */
#define USART_ISR_PE_Msk                                                   (0x1UL)        /*!< USART ISR: PE (Bitfield-Mask: 0x01) */
#define USART_ISR_PE                                                       USART_ISR_PE_Msk

