stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    ICR    =====================================================*/
#define USART_ICR_WUCF_Pos                                                 (20UL)        /*!<USART ICR: WUCF (Bit 20) */
#define USART_ICR_WUCF_Msk                                                 (0x100000UL)        /*!< USART ICR: WUCF (Bitfield-Mask: 0x01) */
#define USART_ICR_WUCF                                                     USART_ICR_WUCF_Msk
#define USART_ICR_CMCF_Pos                                                 (17UL)        /*!<USART ICR: CMCF (Bit 17) */
#define USART_ICR_CMCF_Msk                                                 (0x20000UL)        /*!< USART ICR: CMCF (Bitfield-Mask: 0x01) */
#define USART_ICR_CMCF                                                     USART_ICR_CMCF_Msk
#define USART_ICR_UDRCF_Pos                                                (13UL)        /*!<USART ICR: UDRCF (Bit 13) */
#define USART_ICR_UDRCF_Msk                                                (0x2000UL)        /*!< USART ICR: UDRCF (Bitfield-Mask: 0x01) */
#define USART_ICR_UDRCF                                                    USART_ICR_UDRCF_Msk
#define USART_ICR_EOBCF_Pos                                                (12UL)        /*!<USART ICR: EOBCF (Bit 12) */
#define USART_ICR_EOBCF_Msk                                                (0x1000UL)        /*!< USART ICR: EOBCF (Bitfield-Mask: 0x01) */
#define USART_ICR_EOBCF                                                    USART_ICR_EOBCF_Msk
#define USART_ICR_RTOCF_Pos                                                (11UL)        /*!<USART ICR: RTOCF (Bit 11) */
#define USART_ICR_RTOCF_Msk                                                (0x800UL)        /*!< USART ICR: RTOCF (Bitfield-Mask: 0x01) */
#define USART_ICR_RTOCF                                                    USART_ICR_RTOCF_Msk
#define USART_ICR_CTSCF_Pos                                                (9UL)        /*!<USART ICR: CTSCF (Bit 9) */
#define USART_ICR_CTSCF_Msk                                                (0x200UL)        /*!< USART ICR: CTSCF (Bitfield-Mask: 0x01) */
#define USART_ICR_CTSCF                                                    USART_ICR_CTSCF_Msk
#define USART_ICR_LBDCF_Pos                                                (8UL)        /*!<USART ICR: LBDCF (Bit 8) */
#define USART_ICR_LBDCF_Msk                                                (0x100UL)        /*!< USART ICR: LBDCF (Bitfield-Mask: 0x01) */
#define USART_ICR_LBDCF                                                    USART_ICR_LBDCF_Msk
#define USART_ICR_TCBGTCF_Pos                                              (7UL)        /*!<USART ICR: TCBGTCF (Bit 7) */
#define USART_ICR_TCBGTCF_Msk                                              (0x80UL)        /*!< USART ICR: TCBGTCF (Bitfield-Mask: 0x01) */
#define USART_ICR_TCBGTCF                                                  USART_ICR_TCBGTCF_Msk
#define USART_ICR_TCCF_Pos                                                 (6UL)        /*!<USART ICR: TCCF (Bit 6) */
#define USART_ICR_TCCF_Msk                                                 (0x40UL)        /*!< USART ICR: TCCF (Bitfield-Mask: 0x01) */
#define USART_ICR_TCCF                                                     USART_ICR_TCCF_Msk
#define USART_ICR_TXFECF_Pos                                               (5UL)        /*!<USART ICR: TXFECF (Bit 5) */
#define USART_ICR_TXFECF_Msk                                               (0x20UL)        /*!< USART ICR: TXFECF (Bitfield-Mask: 0x01) */
#define USART_ICR_TXFECF                                                   USART_ICR_TXFECF_Msk
#define USART_ICR_IDLECF_Pos                                               (4UL)        /*!<USART ICR: IDLECF (Bit 4) */
#define USART_ICR_IDLECF_Msk                                               (0x10UL)        /*!< USART ICR: IDLECF (Bitfield-Mask: 0x01) */
#define USART_ICR_IDLECF                                                   USART_ICR_IDLECF_Msk
#define USART_ICR_ORECF_Pos                                                (3UL)        /*!<USART ICR: ORECF (Bit 3) */
#define USART_ICR_ORECF_Msk                                                (0x8UL)        /*!< USART ICR: ORECF (Bitfield-Mask: 0x01) */
#define USART_ICR_ORECF                                                    USART_ICR_ORECF_Msk
#define USART_ICR_NECF_Pos                                                 (2UL)        /*!<USART ICR: NECF (Bit 2) */
#define USART_ICR_NECF_Msk                                                 (0x4UL)        /*!< USART ICR: NECF (Bitfield-Mask: 0x01) */
#define USART_ICR_NECF                                                     USART_ICR_NECF_Msk
#define USART_ICR_FECF_Pos                                                 (1UL)        /*!<USART ICR: FECF (Bit 1) */
#define USART_ICR_FECF_Msk                                                 (0x2UL)        /*!< USART ICR: FECF (Bitfield-Mask: 0x01) */
#define USART_ICR_FECF                                                     USART_ICR_FECF_Msk
#define USART_ICR_PECF_Pos                                                 (0UL)        /*!<USART ICR: PECF (Bit 0) */
#define USART_ICR_PECF_Msk                                                 (0x1UL)        /*!< USART ICR: PECF (Bitfield-Mask: 0x01) */
#define USART_ICR_PECF                                                     USART_ICR_PECF_Msk

/* =====================================================    RDR    =====================================================*/
#define USART_RDR_RDR_Pos                                                  (0UL)        /*!<USART RDR: RDR (Bit 0) */
#define USART_RDR_RDR_Msk                                                  (0x1ffUL)        /*!< USART RDR: RDR (Bitfield-Mask: 0x1ff) */
#define USART_RDR_RDR                                                      USART_RDR_RDR_Msk
#define USART_RDR_RDR_0                                                    (0x1U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_1                                                    (0x2U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_2                                                    (0x4U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_3                                                    (0x8U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_4                                                    (0x10U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_5                                                    (0x20U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_6                                                    (0x40U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_7                                                    (0x80U << USART_RDR_RDR_Pos)
#define USART_RDR_RDR_8                                                    (0x100U << USART_RDR_RDR_Pos)

/* =====================================================    TDR    =====================================================*/
#define USART_TDR_TDR_Pos                                                  (0UL)        /*!<USART TDR: TDR (Bit 0) */
#define USART_TDR_TDR_Msk                                                  (0x1ffUL)        /*!< USART TDR: TDR (Bitfield-Mask: 0x1ff) */
#define USART_TDR_TDR                                                      USART_TDR_TDR_Msk
#define USART_TDR_TDR_0                                                    (0x1U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_1                                                    (0x2U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_2                                                    (0x4U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_3                                                    (0x8U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_4                                                    (0x10U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_5                                                    (0x20U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_6                                                    (0x40U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_7                                                    (0x80U << USART_TDR_TDR_Pos)
#define USART_TDR_TDR_8                                                    (0x100U << USART_TDR_TDR_Pos)

/* =====================================================    PRESC    =====================================================*/
#define USART_PRESC_PRESCALER_Pos                                          (0UL)        /*!<USART PRESC: PRESCALER (Bit 0) */
#define USART_PRESC_PRESCALER_Msk                                          (0xfUL)        /*!< USART PRESC: PRESCALER (Bitfield-Mask: 0x0f) */
#define USART_PRESC_PRESCALER                                              USART_PRESC_PRESCALER_Msk
#define USART_PRESC_PRESCALER_0                                            (0x1U << USART_PRESC_PRESCALER_Pos)
#define USART_PRESC_PRESCALER_1                                            (0x2U << USART_PRESC_PRESCALER_Pos)
#define USART_PRESC_PRESCALER_2                                            (0x4U << USART_PRESC_PRESCALER_Pos)
#define USART_PRESC_PRESCALER_3                                            (0x8U << USART_PRESC_PRESCALER_Pos)


