stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    COMP_4    =====================================================*/
#define ADC_COMP_4_OFFSET4_Pos                                             (12UL)        /*!<ADC COMP_4: OFFSET4 (Bit 12) */
#define ADC_COMP_4_OFFSET4_Msk                                             (0xff000UL)        /*!< ADC COMP_4: OFFSET4 (Bitfield-Mask: 0xff) */
#define ADC_COMP_4_OFFSET4                                                 ADC_COMP_4_OFFSET4_Msk
#define ADC_COMP_4_OFFSET4_0                                               (0x1U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_1                                               (0x2U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_2                                               (0x4U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_3                                               (0x8U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_4                                               (0x10U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_5                                               (0x20U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_6                                               (0x40U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_OFFSET4_7                                               (0x80U << ADC_COMP_4_OFFSET4_Pos)
#define ADC_COMP_4_GAIN4_Pos                                               (0UL)        /*!<ADC COMP_4: GAIN4 (Bit 0) */
#define ADC_COMP_4_GAIN4_Msk                                               (0xfffUL)        /*!< ADC COMP_4: GAIN4 (Bitfield-Mask: 0xfff) */
#define ADC_COMP_4_GAIN4                                                   ADC_COMP_4_GAIN4_Msk
#define ADC_COMP_4_GAIN4_0                                                 (0x1U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_1                                                 (0x2U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_2                                                 (0x4U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_3                                                 (0x8U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_4                                                 (0x10U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_5                                                 (0x20U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_6                                                 (0x40U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_7                                                 (0x80U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_8                                                 (0x100U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_9                                                 (0x200U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_10                                                (0x400U << ADC_COMP_4_GAIN4_Pos)
#define ADC_COMP_4_GAIN4_11                                                (0x800U << ADC_COMP_4_GAIN4_Pos)

/* =====================================================    COMP_SEL    =====================================================*/
#define ADC_COMP_SEL_OFFSET_GAIN8_Pos                                      (16UL)        /*!<ADC COMP_SEL: OFFSET_GAIN8 (Bit 16) */
#define ADC_COMP_SEL_OFFSET_GAIN8_Msk                                      (0x30000UL)        /*!< ADC COMP_SEL: OFFSET_GAIN8 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN8                                          ADC_COMP_SEL_OFFSET_GAIN8_Msk
#define ADC_COMP_SEL_OFFSET_GAIN8_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN8_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN8_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN8_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN7_Pos                                      (14UL)        /*!<ADC COMP_SEL: OFFSET_GAIN7 (Bit 14) */
#define ADC_COMP_SEL_OFFSET_GAIN7_Msk                                      (0xc000UL)        /*!< ADC COMP_SEL: OFFSET_GAIN7 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN7                                          ADC_COMP_SEL_OFFSET_GAIN7_Msk
#define ADC_COMP_SEL_OFFSET_GAIN7_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN7_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN7_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN7_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN6_Pos                                      (12UL)        /*!<ADC COMP_SEL: OFFSET_GAIN6 (Bit 12) */
#define ADC_COMP_SEL_OFFSET_GAIN6_Msk                                      (0x3000UL)        /*!< ADC COMP_SEL: OFFSET_GAIN6 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN6                                          ADC_COMP_SEL_OFFSET_GAIN6_Msk
#define ADC_COMP_SEL_OFFSET_GAIN6_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN6_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN6_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN6_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN5_Pos                                      (10UL)        /*!<ADC COMP_SEL: OFFSET_GAIN5 (Bit 10) */
#define ADC_COMP_SEL_OFFSET_GAIN5_Msk                                      (0xc00UL)        /*!< ADC COMP_SEL: OFFSET_GAIN5 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN5                                          ADC_COMP_SEL_OFFSET_GAIN5_Msk
#define ADC_COMP_SEL_OFFSET_GAIN5_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN5_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN5_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN5_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN4_Pos                                      (8UL)        /*!<ADC COMP_SEL: OFFSET_GAIN4 (Bit 8) */
#define ADC_COMP_SEL_OFFSET_GAIN4_Msk                                      (0x300UL)        /*!< ADC COMP_SEL: OFFSET_GAIN4 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN4                                          ADC_COMP_SEL_OFFSET_GAIN4_Msk
#define ADC_COMP_SEL_OFFSET_GAIN4_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN4_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN4_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN4_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN3_Pos                                      (6UL)        /*!<ADC COMP_SEL: OFFSET_GAIN3 (Bit 6) */
#define ADC_COMP_SEL_OFFSET_GAIN3_Msk                                      (0xc0UL)        /*!< ADC COMP_SEL: OFFSET_GAIN3 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN3                                          ADC_COMP_SEL_OFFSET_GAIN3_Msk
#define ADC_COMP_SEL_OFFSET_GAIN3_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN3_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN3_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN3_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN2_Pos                                      (4UL)        /*!<ADC COMP_SEL: OFFSET_GAIN2 (Bit 4) */
#define ADC_COMP_SEL_OFFSET_GAIN2_Msk                                      (0x30UL)        /*!< ADC COMP_SEL: OFFSET_GAIN2 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN2                                          ADC_COMP_SEL_OFFSET_GAIN2_Msk
#define ADC_COMP_SEL_OFFSET_GAIN2_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN2_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN2_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN2_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN1_Pos                                      (2UL)        /*!<ADC COMP_SEL: OFFSET_GAIN1 (Bit 2) */
#define ADC_COMP_SEL_OFFSET_GAIN1_Msk                                      (0xcUL)        /*!< ADC COMP_SEL: OFFSET_GAIN1 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN1                                          ADC_COMP_SEL_OFFSET_GAIN1_Msk
#define ADC_COMP_SEL_OFFSET_GAIN1_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN1_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN1_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN1_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN0_Pos                                      (0UL)        /*!<ADC COMP_SEL: OFFSET_GAIN0 (Bit 0) */
#define ADC_COMP_SEL_OFFSET_GAIN0_Msk                                      (0x3UL)        /*!< ADC COMP_SEL: OFFSET_GAIN0 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN0                                          ADC_COMP_SEL_OFFSET_GAIN0_Msk
#define ADC_COMP_SEL_OFFSET_GAIN0_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN0_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN0_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN0_Pos)

