stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* ============================================================================================================================*/
/*=====================                                       GPIO                                       =====================*/
/* ============================================================================================================================*/

/* =====================================================    MODER    =====================================================*/
#define GPIO_MODER_MODE15_Pos                                              (30UL)        /*!<GPIO MODER: MODE15 (Bit 30) */
#define GPIO_MODER_MODE15_Msk                                              (0xc0000000UL)        /*!< GPIO MODER: MODE15 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE15                                                  GPIO_MODER_MODE15_Msk
#define GPIO_MODER_MODE15_0                                                (0x1U << GPIO_MODER_MODE15_Pos)
#define GPIO_MODER_MODE15_1                                                (0x2U << GPIO_MODER_MODE15_Pos)
#define GPIO_MODER_MODE14_Pos                                              (28UL)        /*!<GPIO MODER: MODE14 (Bit 28) */
#define GPIO_MODER_MODE14_Msk                                              (0x30000000UL)        /*!< GPIO MODER: MODE14 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE14                                                  GPIO_MODER_MODE14_Msk
#define GPIO_MODER_MODE14_0                                                (0x1U << GPIO_MODER_MODE14_Pos)
#define GPIO_MODER_MODE14_1                                                (0x2U << GPIO_MODER_MODE14_Pos)
#define GPIO_MODER_MODE13_Pos                                              (26UL)        /*!<GPIO MODER: MODE13 (Bit 26) */
#define GPIO_MODER_MODE13_Msk                                              (0xc000000UL)        /*!< GPIO MODER: MODE13 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE13                                                  GPIO_MODER_MODE13_Msk
#define GPIO_MODER_MODE13_0                                                (0x1U << GPIO_MODER_MODE13_Pos)
#define GPIO_MODER_MODE13_1                                                (0x2U << GPIO_MODER_MODE13_Pos)
#define GPIO_MODER_MODE12_Pos                                              (24UL)        /*!<GPIO MODER: MODE12 (Bit 24) */
#define GPIO_MODER_MODE12_Msk                                              (0x3000000UL)        /*!< GPIO MODER: MODE12 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE12                                                  GPIO_MODER_MODE12_Msk
#define GPIO_MODER_MODE12_0                                                (0x1U << GPIO_MODER_MODE12_Pos)
#define GPIO_MODER_MODE12_1                                                (0x2U << GPIO_MODER_MODE12_Pos)
#define GPIO_MODER_MODE11_Pos                                              (22UL)        /*!<GPIO MODER: MODE11 (Bit 22) */
#define GPIO_MODER_MODE11_Msk                                              (0xc00000UL)        /*!< GPIO MODER: MODE11 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE11                                                  GPIO_MODER_MODE11_Msk
#define GPIO_MODER_MODE11_0                                                (0x1U << GPIO_MODER_MODE11_Pos)
#define GPIO_MODER_MODE11_1                                                (0x2U << GPIO_MODER_MODE11_Pos)
#define GPIO_MODER_MODE10_Pos                                              (20UL)        /*!<GPIO MODER: MODE10 (Bit 20) */
#define GPIO_MODER_MODE10_Msk                                              (0x300000UL)        /*!< GPIO MODER: MODE10 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE10                                                  GPIO_MODER_MODE10_Msk
#define GPIO_MODER_MODE10_0                                                (0x1U << GPIO_MODER_MODE10_Pos)
#define GPIO_MODER_MODE10_1                                                (0x2U << GPIO_MODER_MODE10_Pos)
#define GPIO_MODER_MODE9_Pos                                               (18UL)        /*!<GPIO MODER: MODE9 (Bit 18) */
#define GPIO_MODER_MODE9_Msk                                               (0xc0000UL)        /*!< GPIO MODER: MODE9 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE9                                                   GPIO_MODER_MODE9_Msk
#define GPIO_MODER_MODE9_0                                                 (0x1U << GPIO_MODER_MODE9_Pos)
#define GPIO_MODER_MODE9_1                                                 (0x2U << GPIO_MODER_MODE9_Pos)
#define GPIO_MODER_MODE8_Pos                                               (16UL)        /*!<GPIO MODER: MODE8 (Bit 16) */
#define GPIO_MODER_MODE8_Msk                                               (0x30000UL)        /*!< GPIO MODER: MODE8 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE8                                                   GPIO_MODER_MODE8_Msk
#define GPIO_MODER_MODE8_0                                                 (0x1U << GPIO_MODER_MODE8_Pos)
#define GPIO_MODER_MODE8_1                                                 (0x2U << GPIO_MODER_MODE8_Pos)
#define GPIO_MODER_MODE7_Pos                                               (14UL)        /*!<GPIO MODER: MODE7 (Bit 14) */
#define GPIO_MODER_MODE7_Msk                                               (0xc000UL)        /*!< GPIO MODER: MODE7 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE7                                                   GPIO_MODER_MODE7_Msk
#define GPIO_MODER_MODE7_0                                                 (0x1U << GPIO_MODER_MODE7_Pos)
#define GPIO_MODER_MODE7_1                                                 (0x2U << GPIO_MODER_MODE7_Pos)
#define GPIO_MODER_MODE6_Pos                                               (12UL)        /*!<GPIO MODER: MODE6 (Bit 12) */
#define GPIO_MODER_MODE6_Msk                                               (0x3000UL)        /*!< GPIO MODER: MODE6 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE6                                                   GPIO_MODER_MODE6_Msk
#define GPIO_MODER_MODE6_0                                                 (0x1U << GPIO_MODER_MODE6_Pos)
#define GPIO_MODER_MODE6_1                                                 (0x2U << GPIO_MODER_MODE6_Pos)
#define GPIO_MODER_MODE5_Pos                                               (10UL)        /*!<GPIO MODER: MODE5 (Bit 10) */
#define GPIO_MODER_MODE5_Msk                                               (0xc00UL)        /*!< GPIO MODER: MODE5 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE5                                                   GPIO_MODER_MODE5_Msk
#define GPIO_MODER_MODE5_0                                                 (0x1U << GPIO_MODER_MODE5_Pos)
#define GPIO_MODER_MODE5_1                                                 (0x2U << GPIO_MODER_MODE5_Pos)
#define GPIO_MODER_MODE4_Pos                                               (8UL)        /*!<GPIO MODER: MODE4 (Bit 8) */
#define GPIO_MODER_MODE4_Msk                                               (0x300UL)        /*!< GPIO MODER: MODE4 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE4                                                   GPIO_MODER_MODE4_Msk
#define GPIO_MODER_MODE4_0                                                 (0x1U << GPIO_MODER_MODE4_Pos)
#define GPIO_MODER_MODE4_1                                                 (0x2U << GPIO_MODER_MODE4_Pos)
#define GPIO_MODER_MODE3_Pos                                               (6UL)        /*!<GPIO MODER: MODE3 (Bit 6) */
#define GPIO_MODER_MODE3_Msk                                               (0xc0UL)        /*!< GPIO MODER: MODE3 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE3                                                   GPIO_MODER_MODE3_Msk
#define GPIO_MODER_MODE3_0                                                 (0x1U << GPIO_MODER_MODE3_Pos)
#define GPIO_MODER_MODE3_1                                                 (0x2U << GPIO_MODER_MODE3_Pos)
#define GPIO_MODER_MODE2_Pos                                               (4UL)        /*!<GPIO MODER: MODE2 (Bit 4) */
#define GPIO_MODER_MODE2_Msk                                               (0x30UL)        /*!< GPIO MODER: MODE2 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE2                                                   GPIO_MODER_MODE2_Msk
#define GPIO_MODER_MODE2_0                                                 (0x1U << GPIO_MODER_MODE2_Pos)
#define GPIO_MODER_MODE2_1                                                 (0x2U << GPIO_MODER_MODE2_Pos)
#define GPIO_MODER_MODE1_Pos                                               (2UL)        /*!<GPIO MODER: MODE1 (Bit 2) */
#define GPIO_MODER_MODE1_Msk                                               (0xcUL)        /*!< GPIO MODER: MODE1 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE1                                                   GPIO_MODER_MODE1_Msk
#define GPIO_MODER_MODE1_0                                                 (0x1U << GPIO_MODER_MODE1_Pos)
#define GPIO_MODER_MODE1_1                                                 (0x2U << GPIO_MODER_MODE1_Pos)
#define GPIO_MODER_MODE0_Pos                                               (0UL)        /*!<GPIO MODER: MODE0 (Bit 0) */
#define GPIO_MODER_MODE0_Msk                                               (0x3UL)        /*!< GPIO MODER: MODE0 (Bitfield-Mask: 0x03) */
#define GPIO_MODER_MODE0                                                   GPIO_MODER_MODE0_Msk
#define GPIO_MODER_MODE0_0                                                 (0x1U << GPIO_MODER_MODE0_Pos)
#define GPIO_MODER_MODE0_1                                                 (0x2U << GPIO_MODER_MODE0_Pos)

/* =====================================================    OTYPER    =====================================================*/
#define GPIO_OTYPER_OT15_Pos                                               (15UL)        /*!<GPIO OTYPER: OT15 (Bit 15) */
#define GPIO_OTYPER_OT15_Msk                                               (0x8000UL)        /*!< GPIO OTYPER: OT15 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT15                                                   GPIO_OTYPER_OT15_Msk
#define GPIO_OTYPER_OT14_Pos                                               (14UL)        /*!<GPIO OTYPER: OT14 (Bit 14) */
#define GPIO_OTYPER_OT14_Msk                                               (0x4000UL)        /*!< GPIO OTYPER: OT14 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT14                                                   GPIO_OTYPER_OT14_Msk
#define GPIO_OTYPER_OT13_Pos                                               (13UL)        /*!<GPIO OTYPER: OT13 (Bit 13) */
#define GPIO_OTYPER_OT13_Msk                                               (0x2000UL)        /*!< GPIO OTYPER: OT13 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT13                                                   GPIO_OTYPER_OT13_Msk
#define GPIO_OTYPER_OT12_Pos                                               (12UL)        /*!<GPIO OTYPER: OT12 (Bit 12) */
#define GPIO_OTYPER_OT12_Msk                                               (0x1000UL)        /*!< GPIO OTYPER: OT12 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT12                                                   GPIO_OTYPER_OT12_Msk
#define GPIO_OTYPER_OT11_Pos                                               (11UL)        /*!<GPIO OTYPER: OT11 (Bit 11) */
#define GPIO_OTYPER_OT11_Msk                                               (0x800UL)        /*!< GPIO OTYPER: OT11 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT11                                                   GPIO_OTYPER_OT11_Msk
#define GPIO_OTYPER_OT10_Pos                                               (10UL)        /*!<GPIO OTYPER: OT10 (Bit 10) */
#define GPIO_OTYPER_OT10_Msk                                               (0x400UL)        /*!< GPIO OTYPER: OT10 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT10                                                   GPIO_OTYPER_OT10_Msk
#define GPIO_OTYPER_OT9_Pos                                                (9UL)        /*!<GPIO OTYPER: OT9 (Bit 9) */
#define GPIO_OTYPER_OT9_Msk                                                (0x200UL)        /*!< GPIO OTYPER: OT9 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT9                                                    GPIO_OTYPER_OT9_Msk
#define GPIO_OTYPER_OT8_Pos                                                (8UL)        /*!<GPIO OTYPER: OT8 (Bit 8) */
#define GPIO_OTYPER_OT8_Msk                                                (0x100UL)        /*!< GPIO OTYPER: OT8 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT8                                                    GPIO_OTYPER_OT8_Msk
#define GPIO_OTYPER_OT7_Pos                                                (7UL)        /*!<GPIO OTYPER: OT7 (Bit 7) */
#define GPIO_OTYPER_OT7_Msk                                                (0x80UL)        /*!< GPIO OTYPER: OT7 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT7                                                    GPIO_OTYPER_OT7_Msk
#define GPIO_OTYPER_OT6_Pos                                                (6UL)        /*!<GPIO OTYPER: OT6 (Bit 6) */
#define GPIO_OTYPER_OT6_Msk                                                (0x40UL)        /*!< GPIO OTYPER: OT6 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT6                                                    GPIO_OTYPER_OT6_Msk
#define GPIO_OTYPER_OT5_Pos                                                (5UL)        /*!<GPIO OTYPER: OT5 (Bit 5) */
#define GPIO_OTYPER_OT5_Msk                                                (0x20UL)        /*!< GPIO OTYPER: OT5 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT5                                                    GPIO_OTYPER_OT5_Msk
#define GPIO_OTYPER_OT4_Pos                                                (4UL)        /*!<GPIO OTYPER: OT4 (Bit 4) */
#define GPIO_OTYPER_OT4_Msk                                                (0x10UL)        /*!< GPIO OTYPER: OT4 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT4                                                    GPIO_OTYPER_OT4_Msk
#define GPIO_OTYPER_OT3_Pos                                                (3UL)        /*!<GPIO OTYPER: OT3 (Bit 3) */
#define GPIO_OTYPER_OT3_Msk                                                (0x8UL)        /*!< GPIO OTYPER: OT3 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT3                                                    GPIO_OTYPER_OT3_Msk
#define GPIO_OTYPER_OT2_Pos                                                (2UL)        /*!<GPIO OTYPER: OT2 (Bit 2) */
#define GPIO_OTYPER_OT2_Msk                                                (0x4UL)        /*!< GPIO OTYPER: OT2 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT2                                                    GPIO_OTYPER_OT2_Msk
#define GPIO_OTYPER_OT1_Pos                                                (1UL)        /*!<GPIO OTYPER: OT1 (Bit 1) */
#define GPIO_OTYPER_OT1_Msk                                                (0x2UL)        /*!< GPIO OTYPER: OT1 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT1                                                    GPIO_OTYPER_OT1_Msk
#define GPIO_OTYPER_OT0_Pos                                                (0UL)        /*!<GPIO OTYPER: OT0 (Bit 0) */
#define GPIO_OTYPER_OT0_Msk                                                (0x1UL)        /*!< GPIO OTYPER: OT0 (Bitfield-Mask: 0x01) */
#define GPIO_OTYPER_OT0                                                    GPIO_OTYPER_OT0_Msk

