stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    OSPEEDR    =====================================================*/
#define GPIO_OSPEEDR_OSPEED15_Pos                                          (30UL)        /*!<GPIO OSPEEDR: OSPEED15 (Bit 30) */
#define GPIO_OSPEEDR_OSPEED15_Msk                                          (0xc0000000UL)        /*!< GPIO OSPEEDR: OSPEED15 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED15                                              GPIO_OSPEEDR_OSPEED15_Msk
#define GPIO_OSPEEDR_OSPEED15_0                                            (0x1U << GPIO_OSPEEDR_OSPEED15_Pos)
#define GPIO_OSPEEDR_OSPEED15_1                                            (0x2U << GPIO_OSPEEDR_OSPEED15_Pos)
#define GPIO_OSPEEDR_OSPEED14_Pos                                          (28UL)        /*!<GPIO OSPEEDR: OSPEED14 (Bit 28) */
#define GPIO_OSPEEDR_OSPEED14_Msk                                          (0x30000000UL)        /*!< GPIO OSPEEDR: OSPEED14 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED14                                              GPIO_OSPEEDR_OSPEED14_Msk
#define GPIO_OSPEEDR_OSPEED14_0                                            (0x1U << GPIO_OSPEEDR_OSPEED14_Pos)
#define GPIO_OSPEEDR_OSPEED14_1                                            (0x2U << GPIO_OSPEEDR_OSPEED14_Pos)
#define GPIO_OSPEEDR_OSPEED13_Pos                                          (26UL)        /*!<GPIO OSPEEDR: OSPEED13 (Bit 26) */
#define GPIO_OSPEEDR_OSPEED13_Msk                                          (0xc000000UL)        /*!< GPIO OSPEEDR: OSPEED13 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED13                                              GPIO_OSPEEDR_OSPEED13_Msk
#define GPIO_OSPEEDR_OSPEED13_0                                            (0x1U << GPIO_OSPEEDR_OSPEED13_Pos)
#define GPIO_OSPEEDR_OSPEED13_1                                            (0x2U << GPIO_OSPEEDR_OSPEED13_Pos)
#define GPIO_OSPEEDR_OSPEED12_Pos                                          (24UL)        /*!<GPIO OSPEEDR: OSPEED12 (Bit 24) */
#define GPIO_OSPEEDR_OSPEED12_Msk                                          (0x3000000UL)        /*!< GPIO OSPEEDR: OSPEED12 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED12                                              GPIO_OSPEEDR_OSPEED12_Msk
#define GPIO_OSPEEDR_OSPEED12_0                                            (0x1U << GPIO_OSPEEDR_OSPEED12_Pos)
#define GPIO_OSPEEDR_OSPEED12_1                                            (0x2U << GPIO_OSPEEDR_OSPEED12_Pos)
#define GPIO_OSPEEDR_OSPEED11_Pos                                          (22UL)        /*!<GPIO OSPEEDR: OSPEED11 (Bit 22) */
#define GPIO_OSPEEDR_OSPEED11_Msk                                          (0xc00000UL)        /*!< GPIO OSPEEDR: OSPEED11 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED11                                              GPIO_OSPEEDR_OSPEED11_Msk
#define GPIO_OSPEEDR_OSPEED11_0                                            (0x1U << GPIO_OSPEEDR_OSPEED11_Pos)
#define GPIO_OSPEEDR_OSPEED11_1                                            (0x2U << GPIO_OSPEEDR_OSPEED11_Pos)
#define GPIO_OSPEEDR_OSPEED10_Pos                                          (20UL)        /*!<GPIO OSPEEDR: OSPEED10 (Bit 20) */
#define GPIO_OSPEEDR_OSPEED10_Msk                                          (0x300000UL)        /*!< GPIO OSPEEDR: OSPEED10 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED10                                              GPIO_OSPEEDR_OSPEED10_Msk
#define GPIO_OSPEEDR_OSPEED10_0                                            (0x1U << GPIO_OSPEEDR_OSPEED10_Pos)
#define GPIO_OSPEEDR_OSPEED10_1                                            (0x2U << GPIO_OSPEEDR_OSPEED10_Pos)
#define GPIO_OSPEEDR_OSPEED9_Pos                                           (18UL)        /*!<GPIO OSPEEDR: OSPEED9 (Bit 18) */
#define GPIO_OSPEEDR_OSPEED9_Msk                                           (0xc0000UL)        /*!< GPIO OSPEEDR: OSPEED9 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED9                                               GPIO_OSPEEDR_OSPEED9_Msk
#define GPIO_OSPEEDR_OSPEED9_0                                             (0x1U << GPIO_OSPEEDR_OSPEED9_Pos)
#define GPIO_OSPEEDR_OSPEED9_1                                             (0x2U << GPIO_OSPEEDR_OSPEED9_Pos)
#define GPIO_OSPEEDR_OSPEED8_Pos                                           (16UL)        /*!<GPIO OSPEEDR: OSPEED8 (Bit 16) */
#define GPIO_OSPEEDR_OSPEED8_Msk                                           (0x30000UL)        /*!< GPIO OSPEEDR: OSPEED8 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED8                                               GPIO_OSPEEDR_OSPEED8_Msk
#define GPIO_OSPEEDR_OSPEED8_0                                             (0x1U << GPIO_OSPEEDR_OSPEED8_Pos)
#define GPIO_OSPEEDR_OSPEED8_1                                             (0x2U << GPIO_OSPEEDR_OSPEED8_Pos)
#define GPIO_OSPEEDR_OSPEED7_Pos                                           (14UL)        /*!<GPIO OSPEEDR: OSPEED7 (Bit 14) */
#define GPIO_OSPEEDR_OSPEED7_Msk                                           (0xc000UL)        /*!< GPIO OSPEEDR: OSPEED7 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED7                                               GPIO_OSPEEDR_OSPEED7_Msk
#define GPIO_OSPEEDR_OSPEED7_0                                             (0x1U << GPIO_OSPEEDR_OSPEED7_Pos)
#define GPIO_OSPEEDR_OSPEED7_1                                             (0x2U << GPIO_OSPEEDR_OSPEED7_Pos)
#define GPIO_OSPEEDR_OSPEED6_Pos                                           (12UL)        /*!<GPIO OSPEEDR: OSPEED6 (Bit 12) */
#define GPIO_OSPEEDR_OSPEED6_Msk                                           (0x3000UL)        /*!< GPIO OSPEEDR: OSPEED6 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED6                                               GPIO_OSPEEDR_OSPEED6_Msk
#define GPIO_OSPEEDR_OSPEED6_0                                             (0x1U << GPIO_OSPEEDR_OSPEED6_Pos)
#define GPIO_OSPEEDR_OSPEED6_1                                             (0x2U << GPIO_OSPEEDR_OSPEED6_Pos)
#define GPIO_OSPEEDR_OSPEED5_Pos                                           (10UL)        /*!<GPIO OSPEEDR: OSPEED5 (Bit 10) */
#define GPIO_OSPEEDR_OSPEED5_Msk                                           (0xc00UL)        /*!< GPIO OSPEEDR: OSPEED5 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED5                                               GPIO_OSPEEDR_OSPEED5_Msk
#define GPIO_OSPEEDR_OSPEED5_0                                             (0x1U << GPIO_OSPEEDR_OSPEED5_Pos)
#define GPIO_OSPEEDR_OSPEED5_1                                             (0x2U << GPIO_OSPEEDR_OSPEED5_Pos)
#define GPIO_OSPEEDR_OSPEED4_Pos                                           (8UL)        /*!<GPIO OSPEEDR: OSPEED4 (Bit 8) */
#define GPIO_OSPEEDR_OSPEED4_Msk                                           (0x300UL)        /*!< GPIO OSPEEDR: OSPEED4 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED4                                               GPIO_OSPEEDR_OSPEED4_Msk
#define GPIO_OSPEEDR_OSPEED4_0                                             (0x1U << GPIO_OSPEEDR_OSPEED4_Pos)
#define GPIO_OSPEEDR_OSPEED4_1                                             (0x2U << GPIO_OSPEEDR_OSPEED4_Pos)
#define GPIO_OSPEEDR_OSPEED3_Pos                                           (6UL)        /*!<GPIO OSPEEDR: OSPEED3 (Bit 6) */
#define GPIO_OSPEEDR_OSPEED3_Msk                                           (0xc0UL)        /*!< GPIO OSPEEDR: OSPEED3 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED3                                               GPIO_OSPEEDR_OSPEED3_Msk
#define GPIO_OSPEEDR_OSPEED3_0                                             (0x1U << GPIO_OSPEEDR_OSPEED3_Pos)
#define GPIO_OSPEEDR_OSPEED3_1                                             (0x2U << GPIO_OSPEEDR_OSPEED3_Pos)
#define GPIO_OSPEEDR_OSPEED2_Pos                                           (4UL)        /*!<GPIO OSPEEDR: OSPEED2 (Bit 4) */
#define GPIO_OSPEEDR_OSPEED2_Msk                                           (0x30UL)        /*!< GPIO OSPEEDR: OSPEED2 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED2                                               GPIO_OSPEEDR_OSPEED2_Msk
#define GPIO_OSPEEDR_OSPEED2_0                                             (0x1U << GPIO_OSPEEDR_OSPEED2_Pos)
#define GPIO_OSPEEDR_OSPEED2_1                                             (0x2U << GPIO_OSPEEDR_OSPEED2_Pos)
#define GPIO_OSPEEDR_OSPEED1_Pos                                           (2UL)        /*!<GPIO OSPEEDR: OSPEED1 (Bit 2) */
#define GPIO_OSPEEDR_OSPEED1_Msk                                           (0xcUL)        /*!< GPIO OSPEEDR: OSPEED1 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED1                                               GPIO_OSPEEDR_OSPEED1_Msk
#define GPIO_OSPEEDR_OSPEED1_0                                             (0x1U << GPIO_OSPEEDR_OSPEED1_Pos)
#define GPIO_OSPEEDR_OSPEED1_1                                             (0x2U << GPIO_OSPEEDR_OSPEED1_Pos)
#define GPIO_OSPEEDR_OSPEED0_Pos                                           (0UL)        /*!<GPIO OSPEEDR: OSPEED0 (Bit 0) */
#define GPIO_OSPEEDR_OSPEED0_Msk                                           (0x3UL)        /*!< GPIO OSPEEDR: OSPEED0 (Bitfield-Mask: 0x03) */
#define GPIO_OSPEEDR_OSPEED0                                               GPIO_OSPEEDR_OSPEED0_Msk
#define GPIO_OSPEEDR_OSPEED0_0                                             (0x1U << GPIO_OSPEEDR_OSPEED0_Pos)
#define GPIO_OSPEEDR_OSPEED0_1                                             (0x2U << GPIO_OSPEEDR_OSPEED0_Pos)

/* =====================================================    PUPDR    =====================================================*/
#define GPIO_PUPDR_PUPD15_Pos                                              (30UL)        /*!<GPIO PUPDR: PUPD15 (Bit 30) */
#define GPIO_PUPDR_PUPD15_Msk                                              (0xc0000000UL)        /*!< GPIO PUPDR: PUPD15 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD15                                                  GPIO_PUPDR_PUPD15_Msk
#define GPIO_PUPDR_PUPD15_0                                                (0x1U << GPIO_PUPDR_PUPD15_Pos)
#define GPIO_PUPDR_PUPD15_1                                                (0x2U << GPIO_PUPDR_PUPD15_Pos)
#define GPIO_PUPDR_PUPD14_Pos                                              (28UL)        /*!<GPIO PUPDR: PUPD14 (Bit 28) */
#define GPIO_PUPDR_PUPD14_Msk                                              (0x30000000UL)        /*!< GPIO PUPDR: PUPD14 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD14                                                  GPIO_PUPDR_PUPD14_Msk
#define GPIO_PUPDR_PUPD14_0                                                (0x1U << GPIO_PUPDR_PUPD14_Pos)
#define GPIO_PUPDR_PUPD14_1                                                (0x2U << GPIO_PUPDR_PUPD14_Pos)
#define GPIO_PUPDR_PUPD13_Pos                                              (26UL)        /*!<GPIO PUPDR: PUPD13 (Bit 26) */
#define GPIO_PUPDR_PUPD13_Msk                                              (0xc000000UL)        /*!< GPIO PUPDR: PUPD13 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD13                                                  GPIO_PUPDR_PUPD13_Msk
#define GPIO_PUPDR_PUPD13_0                                                (0x1U << GPIO_PUPDR_PUPD13_Pos)
#define GPIO_PUPDR_PUPD13_1                                                (0x2U << GPIO_PUPDR_PUPD13_Pos)
#define GPIO_PUPDR_PUPD12_Pos                                              (24UL)        /*!<GPIO PUPDR: PUPD12 (Bit 24) */
#define GPIO_PUPDR_PUPD12_Msk                                              (0x3000000UL)        /*!< GPIO PUPDR: PUPD12 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD12                                                  GPIO_PUPDR_PUPD12_Msk
#define GPIO_PUPDR_PUPD12_0                                                (0x1U << GPIO_PUPDR_PUPD12_Pos)
#define GPIO_PUPDR_PUPD12_1                                                (0x2U << GPIO_PUPDR_PUPD12_Pos)
#define GPIO_PUPDR_PUPD11_Pos                                              (22UL)        /*!<GPIO PUPDR: PUPD11 (Bit 22) */
#define GPIO_PUPDR_PUPD11_Msk                                              (0xc00000UL)        /*!< GPIO PUPDR: PUPD11 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD11                                                  GPIO_PUPDR_PUPD11_Msk
#define GPIO_PUPDR_PUPD11_0                                                (0x1U << GPIO_PUPDR_PUPD11_Pos)
#define GPIO_PUPDR_PUPD11_1                                                (0x2U << GPIO_PUPDR_PUPD11_Pos)
#define GPIO_PUPDR_PUPD10_Pos                                              (20UL)        /*!<GPIO PUPDR: PUPD10 (Bit 20) */
#define GPIO_PUPDR_PUPD10_Msk                                              (0x300000UL)        /*!< GPIO PUPDR: PUPD10 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD10                                                  GPIO_PUPDR_PUPD10_Msk
#define GPIO_PUPDR_PUPD10_0                                                (0x1U << GPIO_PUPDR_PUPD10_Pos)
#define GPIO_PUPDR_PUPD10_1                                                (0x2U << GPIO_PUPDR_PUPD10_Pos)
#define GPIO_PUPDR_PUPD9_Pos                                               (18UL)        /*!<GPIO PUPDR: PUPD9 (Bit 18) */
#define GPIO_PUPDR_PUPD9_Msk                                               (0xc0000UL)        /*!< GPIO PUPDR: PUPD9 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD9                                                   GPIO_PUPDR_PUPD9_Msk
#define GPIO_PUPDR_PUPD9_0                                                 (0x1U << GPIO_PUPDR_PUPD9_Pos)
#define GPIO_PUPDR_PUPD9_1                                                 (0x2U << GPIO_PUPDR_PUPD9_Pos)
#define GPIO_PUPDR_PUPD8_Pos                                               (16UL)        /*!<GPIO PUPDR: PUPD8 (Bit 16) */
#define GPIO_PUPDR_PUPD8_Msk                                               (0x30000UL)        /*!< GPIO PUPDR: PUPD8 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD8                                                   GPIO_PUPDR_PUPD8_Msk
#define GPIO_PUPDR_PUPD8_0                                                 (0x1U << GPIO_PUPDR_PUPD8_Pos)
#define GPIO_PUPDR_PUPD8_1                                                 (0x2U << GPIO_PUPDR_PUPD8_Pos)
#define GPIO_PUPDR_PUPD7_Pos                                               (14UL)        /*!<GPIO PUPDR: PUPD7 (Bit 14) */
#define GPIO_PUPDR_PUPD7_Msk                                               (0xc000UL)        /*!< GPIO PUPDR: PUPD7 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD7                                                   GPIO_PUPDR_PUPD7_Msk
#define GPIO_PUPDR_PUPD7_0                                                 (0x1U << GPIO_PUPDR_PUPD7_Pos)
#define GPIO_PUPDR_PUPD7_1                                                 (0x2U << GPIO_PUPDR_PUPD7_Pos)
#define GPIO_PUPDR_PUPD6_Pos                                               (12UL)        /*!<GPIO PUPDR: PUPD6 (Bit 12) */
#define GPIO_PUPDR_PUPD6_Msk                                               (0x3000UL)        /*!< GPIO PUPDR: PUPD6 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD6                                                   GPIO_PUPDR_PUPD6_Msk
#define GPIO_PUPDR_PUPD6_0                                                 (0x1U << GPIO_PUPDR_PUPD6_Pos)
#define GPIO_PUPDR_PUPD6_1                                                 (0x2U << GPIO_PUPDR_PUPD6_Pos)
#define GPIO_PUPDR_PUPD5_Pos                                               (10UL)        /*!<GPIO PUPDR: PUPD5 (Bit 10) */
#define GPIO_PUPDR_PUPD5_Msk                                               (0xc00UL)        /*!< GPIO PUPDR: PUPD5 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD5                                                   GPIO_PUPDR_PUPD5_Msk
#define GPIO_PUPDR_PUPD5_0                                                 (0x1U << GPIO_PUPDR_PUPD5_Pos)
#define GPIO_PUPDR_PUPD5_1                                                 (0x2U << GPIO_PUPDR_PUPD5_Pos)
#define GPIO_PUPDR_PUPD4_Pos                                               (8UL)        /*!<GPIO PUPDR: PUPD4 (Bit 8) */
#define GPIO_PUPDR_PUPD4_Msk                                               (0x300UL)        /*!< GPIO PUPDR: PUPD4 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD4                                                   GPIO_PUPDR_PUPD4_Msk
#define GPIO_PUPDR_PUPD4_0                                                 (0x1U << GPIO_PUPDR_PUPD4_Pos)
#define GPIO_PUPDR_PUPD4_1                                                 (0x2U << GPIO_PUPDR_PUPD4_Pos)
#define GPIO_PUPDR_PUPD3_Pos                                               (6UL)        /*!<GPIO PUPDR: PUPD3 (Bit 6) */
#define GPIO_PUPDR_PUPD3_Msk                                               (0xc0UL)        /*!< GPIO PUPDR: PUPD3 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD3                                                   GPIO_PUPDR_PUPD3_Msk
#define GPIO_PUPDR_PUPD3_0                                                 (0x1U << GPIO_PUPDR_PUPD3_Pos)
#define GPIO_PUPDR_PUPD3_1                                                 (0x2U << GPIO_PUPDR_PUPD3_Pos)
#define GPIO_PUPDR_PUPD2_Pos                                               (4UL)        /*!<GPIO PUPDR: PUPD2 (Bit 4) */
#define GPIO_PUPDR_PUPD2_Msk                                               (0x30UL)        /*!< GPIO PUPDR: PUPD2 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD2                                                   GPIO_PUPDR_PUPD2_Msk
#define GPIO_PUPDR_PUPD2_0                                                 (0x1U << GPIO_PUPDR_PUPD2_Pos)
#define GPIO_PUPDR_PUPD2_1                                                 (0x2U << GPIO_PUPDR_PUPD2_Pos)
#define GPIO_PUPDR_PUPD1_Pos                                               (2UL)        /*!<GPIO PUPDR: PUPD1 (Bit 2) */
#define GPIO_PUPDR_PUPD1_Msk                                               (0xcUL)        /*!< GPIO PUPDR: PUPD1 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD1                                                   GPIO_PUPDR_PUPD1_Msk
#define GPIO_PUPDR_PUPD1_0                                                 (0x1U << GPIO_PUPDR_PUPD1_Pos)
#define GPIO_PUPDR_PUPD1_1                                                 (0x2U << GPIO_PUPDR_PUPD1_Pos)
#define GPIO_PUPDR_PUPD0_Pos                                               (0UL)        /*!<GPIO PUPDR: PUPD0 (Bit 0) */
#define GPIO_PUPDR_PUPD0_Msk                                               (0x3UL)        /*!< GPIO PUPDR: PUPD0 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD0                                                   GPIO_PUPDR_PUPD0_Msk
#define GPIO_PUPDR_PUPD0_0                                                 (0x1U << GPIO_PUPDR_PUPD0_Pos)
#define GPIO_PUPDR_PUPD0_1                                                 (0x2U << GPIO_PUPDR_PUPD0_Pos)

