stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    APB0RSTR    =====================================================*/
#define RCC_APB0RSTR_DBGMCURST_Pos                                         (15UL)        /*!<RCC APB0RSTR: DBGMCURST (Bit 15) */
#define RCC_APB0RSTR_DBGMCURST_Msk                                         (0x8000UL)        /*!< RCC APB0RSTR: DBGMCURST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_DBGMCURST                                             RCC_APB0RSTR_DBGMCURST_Msk
#define RCC_APB0RSTR_WDGRST_Pos                                            (14UL)        /*!<RCC APB0RSTR: WDGRST (Bit 14) */
#define RCC_APB0RSTR_WDGRST_Msk                                            (0x4000UL)        /*!< RCC APB0RSTR: WDGRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_WDGRST                                                RCC_APB0RSTR_WDGRST_Msk
#define RCC_APB0RSTR_RTCRST_Pos                                            (12UL)        /*!<RCC APB0RSTR: RTCRST (Bit 12) */
#define RCC_APB0RSTR_RTCRST_Msk                                            (0x1000UL)        /*!< RCC APB0RSTR: RTCRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_RTCRST                                                RCC_APB0RSTR_RTCRST_Msk
#define RCC_APB0RSTR_SYSCFGRST_Pos                                         (8UL)        /*!<RCC APB0RSTR: SYSCFGRST (Bit 8) */
#define RCC_APB0RSTR_SYSCFGRST_Msk                                         (0x100UL)        /*!< RCC APB0RSTR: SYSCFGRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_SYSCFGRST                                             RCC_APB0RSTR_SYSCFGRST_Msk
#define RCC_APB0RSTR_TIM16RST_Pos                                          (1UL)        /*!<RCC APB0RSTR: TIM16RST (Bit 1) */
#define RCC_APB0RSTR_TIM16RST_Msk                                          (0x2UL)        /*!< RCC APB0RSTR: TIM16RST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_TIM16RST                                              RCC_APB0RSTR_TIM16RST_Msk
#define RCC_APB0RSTR_TIM2RST_Pos                                           (0UL)        /*!<RCC APB0RSTR: TIM2RST (Bit 0) */
#define RCC_APB0RSTR_TIM2RST_Msk                                           (0x1UL)        /*!< RCC APB0RSTR: TIM2RST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_TIM2RST                                               RCC_APB0RSTR_TIM2RST_Msk

/* =====================================================    APB1RSTR    =====================================================*/
#define RCC_APB1RSTR_I2C1RST_Pos                                           (21UL)        /*!<RCC APB1RSTR: I2C1RST (Bit 21) */
#define RCC_APB1RSTR_I2C1RST_Msk                                           (0x200000UL)        /*!< RCC APB1RSTR: I2C1RST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_I2C1RST                                               RCC_APB1RSTR_I2C1RST_Msk
#define RCC_APB1RSTR_SPI3RST_Pos                                           (14UL)        /*!<RCC APB1RSTR: SPI3RST (Bit 14) */
#define RCC_APB1RSTR_SPI3RST_Msk                                           (0x4000UL)        /*!< RCC APB1RSTR: SPI3RST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_SPI3RST                                               RCC_APB1RSTR_SPI3RST_Msk
#define RCC_APB1RSTR_USARTRST_Pos                                          (10UL)        /*!<RCC APB1RSTR: USARTRST (Bit 10) */
#define RCC_APB1RSTR_USARTRST_Msk                                          (0x400UL)        /*!< RCC APB1RSTR: USARTRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_USARTRST                                              RCC_APB1RSTR_USARTRST_Msk
#define RCC_APB1RSTR_LPUARTRST_Pos                                         (8UL)        /*!<RCC APB1RSTR: LPUARTRST (Bit 8) */
#define RCC_APB1RSTR_LPUARTRST_Msk                                         (0x100UL)        /*!< RCC APB1RSTR: LPUARTRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_LPUARTRST                                             RCC_APB1RSTR_LPUARTRST_Msk
#define RCC_APB1RSTR_ADCRST_Pos                                            (4UL)        /*!<RCC APB1RSTR: ADCRST (Bit 4) */
#define RCC_APB1RSTR_ADCRST_Msk                                            (0x10UL)        /*!< RCC APB1RSTR: ADCRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_ADCRST                                                RCC_APB1RSTR_ADCRST_Msk

/* =====================================================    APB2RSTR    =====================================================*/
#define RCC_APB2RSTR_MRSUBGRST_Pos                                         (0UL)        /*!<RCC APB2RSTR: MRSUBGRST (Bit 0) */
#define RCC_APB2RSTR_MRSUBGRST_Msk                                         (0x1UL)        /*!< RCC APB2RSTR: MRSUBGRST (Bitfield-Mask: 0x01) */
#define RCC_APB2RSTR_MRSUBGRST                                             RCC_APB2RSTR_MRSUBGRST_Msk

/* =====================================================    AHBENR    =====================================================*/
#define RCC_AHBENR_AESEN_Pos                                               (20UL)        /*!<RCC AHBENR: AESEN (Bit 20) */
#define RCC_AHBENR_AESEN_Msk                                               (0x100000UL)        /*!< RCC AHBENR: AESEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_AESEN                                                   RCC_AHBENR_AESEN_Msk
#define RCC_AHBENR_RNGEN_Pos                                               (18UL)        /*!<RCC AHBENR: RNGEN (Bit 18) */
#define RCC_AHBENR_RNGEN_Msk                                               (0x40000UL)        /*!< RCC AHBENR: RNGEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_RNGEN                                                   RCC_AHBENR_RNGEN_Msk
#define RCC_AHBENR_CRCEN_Pos                                               (12UL)        /*!<RCC AHBENR: CRCEN (Bit 12) */
#define RCC_AHBENR_CRCEN_Msk                                               (0x1000UL)        /*!< RCC AHBENR: CRCEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_CRCEN                                                   RCC_AHBENR_CRCEN_Msk
#define RCC_AHBENR_GPIOBEN_Pos                                             (3UL)        /*!<RCC AHBENR: GPIOBEN (Bit 3) */
#define RCC_AHBENR_GPIOBEN_Msk                                             (0x8UL)        /*!< RCC AHBENR: GPIOBEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_GPIOBEN                                                 RCC_AHBENR_GPIOBEN_Msk
#define RCC_AHBENR_GPIOAEN_Pos                                             (2UL)        /*!<RCC AHBENR: GPIOAEN (Bit 2) */
#define RCC_AHBENR_GPIOAEN_Msk                                             (0x4UL)        /*!< RCC AHBENR: GPIOAEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_GPIOAEN                                                 RCC_AHBENR_GPIOAEN_Msk
#define RCC_AHBENR_DMAEN_Pos                                               (0UL)        /*!<RCC AHBENR: DMAEN (Bit 0) */
#define RCC_AHBENR_DMAEN_Msk                                               (0x1UL)        /*!< RCC AHBENR: DMAEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_DMAEN                                                   RCC_AHBENR_DMAEN_Msk

/* =====================================================    APB0ENR    =====================================================*/
#define RCC_APB0ENR_DBGMCUEN_Pos                                           (15UL)        /*!<RCC APB0ENR: DBGMCUEN (Bit 15) */
#define RCC_APB0ENR_DBGMCUEN_Msk                                           (0x8000UL)        /*!< RCC APB0ENR: DBGMCUEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_DBGMCUEN                                               RCC_APB0ENR_DBGMCUEN_Msk
#define RCC_APB0ENR_WDGEN_Pos                                              (14UL)        /*!<RCC APB0ENR: WDGEN (Bit 14) */
#define RCC_APB0ENR_WDGEN_Msk                                              (0x4000UL)        /*!< RCC APB0ENR: WDGEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_WDGEN                                                  RCC_APB0ENR_WDGEN_Msk
#define RCC_APB0ENR_RTCEN_Pos                                              (12UL)        /*!<RCC APB0ENR: RTCEN (Bit 12) */
#define RCC_APB0ENR_RTCEN_Msk                                              (0x1000UL)        /*!< RCC APB0ENR: RTCEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_RTCEN                                                  RCC_APB0ENR_RTCEN_Msk
#define RCC_APB0ENR_SYSCFGEN_Pos                                           (8UL)        /*!<RCC APB0ENR: SYSCFGEN (Bit 8) */
#define RCC_APB0ENR_SYSCFGEN_Msk                                           (0x100UL)        /*!< RCC APB0ENR: SYSCFGEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_SYSCFGEN                                               RCC_APB0ENR_SYSCFGEN_Msk
#define RCC_APB0ENR_TIM16EN_Pos                                            (1UL)        /*!<RCC APB0ENR: TIM16EN (Bit 1) */
#define RCC_APB0ENR_TIM16EN_Msk                                            (0x2UL)        /*!< RCC APB0ENR: TIM16EN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_TIM16EN                                                RCC_APB0ENR_TIM16EN_Msk
#define RCC_APB0ENR_TIM2EN_Pos                                             (0UL)        /*!<RCC APB0ENR: TIM2EN (Bit 0) */
#define RCC_APB0ENR_TIM2EN_Msk                                             (0x1UL)        /*!< RCC APB0ENR: TIM2EN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_TIM2EN                                                 RCC_APB0ENR_TIM2EN_Msk

/* =====================================================    APB1ENR    =====================================================*/
#define RCC_APB1ENR_I2C1EN_Pos                                             (21UL)        /*!<RCC APB1ENR: I2C1EN (Bit 21) */
#define RCC_APB1ENR_I2C1EN_Msk                                             (0x200000UL)        /*!< RCC APB1ENR: I2C1EN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_I2C1EN                                                 RCC_APB1ENR_I2C1EN_Msk
#define RCC_APB1ENR_SPI3EN_Pos                                             (14UL)        /*!<RCC APB1ENR: SPI3EN (Bit 14) */
#define RCC_APB1ENR_SPI3EN_Msk                                             (0x4000UL)        /*!< RCC APB1ENR: SPI3EN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_SPI3EN                                                 RCC_APB1ENR_SPI3EN_Msk
#define RCC_APB1ENR_USARTEN_Pos                                            (10UL)        /*!<RCC APB1ENR: USARTEN (Bit 10) */
#define RCC_APB1ENR_USARTEN_Msk                                            (0x400UL)        /*!< RCC APB1ENR: USARTEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_USARTEN                                                RCC_APB1ENR_USARTEN_Msk
#define RCC_APB1ENR_LPUARTEN_Pos                                           (8UL)        /*!<RCC APB1ENR: LPUARTEN (Bit 8) */
#define RCC_APB1ENR_LPUARTEN_Msk                                           (0x100UL)        /*!< RCC APB1ENR: LPUARTEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_LPUARTEN                                               RCC_APB1ENR_LPUARTEN_Msk
#define RCC_APB1ENR_ADCANAEN_Pos                                           (5UL)        /*!<RCC APB1ENR: ADCANAEN (Bit 5) */
#define RCC_APB1ENR_ADCANAEN_Msk                                           (0x20UL)        /*!< RCC APB1ENR: ADCANAEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_ADCANAEN                                               RCC_APB1ENR_ADCANAEN_Msk
#define RCC_APB1ENR_ADCDIGEN_Pos                                           (4UL)        /*!<RCC APB1ENR: ADCDIGEN (Bit 4) */
#define RCC_APB1ENR_ADCDIGEN_Msk                                           (0x10UL)        /*!< RCC APB1ENR: ADCDIGEN (Bitfield-Mask: 0x01) */
#define RCC_APB1ENR_ADCDIGEN                                               RCC_APB1ENR_ADCDIGEN_Msk

/* =====================================================    APB2ENR    =====================================================*/
#define RCC_APB2ENR_MRSUBGEN_Pos                                           (0UL)        /*!<RCC APB2ENR: MRSUBGEN (Bit 0) */
#define RCC_APB2ENR_MRSUBGEN_Msk                                           (0x1UL)        /*!< RCC APB2ENR: MRSUBGEN (Bitfield-Mask: 0x01) */
#define RCC_APB2ENR_MRSUBGEN                                               RCC_APB2ENR_MRSUBGEN_Msk

/* =====================================================    CSR    =====================================================*/
#define RCC_CSR_LOCKUPRSTF_Pos                                             (30UL)        /*!<RCC CSR: LOCKUPRSTF (Bit 30) */
#define RCC_CSR_LOCKUPRSTF_Msk                                             (0x40000000UL)        /*!< RCC CSR: LOCKUPRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_LOCKUPRSTF                                                 RCC_CSR_LOCKUPRSTF_Msk
#define RCC_CSR_WDGRSTF_Pos                                                (29UL)        /*!<RCC CSR: WDGRSTF (Bit 29) */
#define RCC_CSR_WDGRSTF_Msk                                                (0x20000000UL)        /*!< RCC CSR: WDGRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_WDGRSTF                                                    RCC_CSR_WDGRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos                                                (28UL)        /*!<RCC CSR: SFTRSTF (Bit 28) */
#define RCC_CSR_SFTRSTF_Msk                                                (0x10000000UL)        /*!< RCC CSR: SFTRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_SFTRSTF                                                    RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_PORRSTF_Pos                                                (27UL)        /*!<RCC CSR: PORRSTF (Bit 27) */
#define RCC_CSR_PORRSTF_Msk                                                (0x8000000UL)        /*!< RCC CSR: PORRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_PORRSTF                                                    RCC_CSR_PORRSTF_Msk
#define RCC_CSR_PADRSTF_Pos                                                (26UL)        /*!<RCC CSR: PADRSTF (Bit 26) */
#define RCC_CSR_PADRSTF_Msk                                                (0x4000000UL)        /*!< RCC CSR: PADRSTF (Bitfield-Mask: 0x01) */
#define RCC_CSR_PADRSTF                                                    RCC_CSR_PADRSTF_Msk
#define RCC_CSR_RMVF_Pos                                                   (23UL)        /*!<RCC CSR: RMVF (Bit 23) */
#define RCC_CSR_RMVF_Msk                                                   (0x800000UL)        /*!< RCC CSR: RMVF (Bitfield-Mask: 0x01) */
#define RCC_CSR_RMVF                                                       RCC_CSR_RMVF_Msk

/* =====================================================    RFSWHSECR    =====================================================*/
#define RCC_RFSWHSECR_AMPLTHRESH_Pos                                       (16UL)        /*!<RCC RFSWHSECR: AMPLTHRESH (Bit 16) */
#define RCC_RFSWHSECR_AMPLTHRESH_Msk                                       (0x70000UL)        /*!< RCC RFSWHSECR: AMPLTHRESH (Bitfield-Mask: 0x07) */
#define RCC_RFSWHSECR_AMPLTHRESH                                           RCC_RFSWHSECR_AMPLTHRESH_Msk
#define RCC_RFSWHSECR_AMPLTHRESH_0                                         (0x1U << RCC_RFSWHSECR_AMPLTHRESH_Pos)
#define RCC_RFSWHSECR_AMPLTHRESH_1                                         (0x2U << RCC_RFSWHSECR_AMPLTHRESH_Pos)
#define RCC_RFSWHSECR_AMPLTHRESH_2                                         (0x4U << RCC_RFSWHSECR_AMPLTHRESH_Pos)
#define RCC_RFSWHSECR_ISTARTUP_Pos                                         (14UL)        /*!<RCC RFSWHSECR: ISTARTUP (Bit 14) */
#define RCC_RFSWHSECR_ISTARTUP_Msk                                         (0xc000UL)        /*!< RCC RFSWHSECR: ISTARTUP (Bitfield-Mask: 0x03) */
#define RCC_RFSWHSECR_ISTARTUP                                             RCC_RFSWHSECR_ISTARTUP_Msk
#define RCC_RFSWHSECR_ISTARTUP_0                                           (0x1U << RCC_RFSWHSECR_ISTARTUP_Pos)
#define RCC_RFSWHSECR_ISTARTUP_1                                           (0x2U << RCC_RFSWHSECR_ISTARTUP_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_Pos                                         (8UL)        /*!<RCC RFSWHSECR: SWXOTUNE (Bit 8) */
#define RCC_RFSWHSECR_SWXOTUNE_Msk                                         (0x3f00UL)        /*!< RCC RFSWHSECR: SWXOTUNE (Bitfield-Mask: 0x3f) */
#define RCC_RFSWHSECR_SWXOTUNE                                             RCC_RFSWHSECR_SWXOTUNE_Msk
#define RCC_RFSWHSECR_SWXOTUNE_0                                           (0x1U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_1                                           (0x2U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_2                                           (0x4U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_3                                           (0x8U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_4                                           (0x10U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNE_5                                           (0x20U << RCC_RFSWHSECR_SWXOTUNE_Pos)
#define RCC_RFSWHSECR_SWXOTUNEEN_Pos                                       (7UL)        /*!<RCC RFSWHSECR: SWXOTUNEEN (Bit 7) */
#define RCC_RFSWHSECR_SWXOTUNEEN_Msk                                       (0x80UL)        /*!< RCC RFSWHSECR: SWXOTUNEEN (Bitfield-Mask: 0x01) */
#define RCC_RFSWHSECR_SWXOTUNEEN                                           RCC_RFSWHSECR_SWXOTUNEEN_Msk
#define RCC_RFSWHSECR_GMC_Pos                                              (0UL)        /*!<RCC RFSWHSECR: GMC (Bit 0) */
#define RCC_RFSWHSECR_GMC_Msk                                              (0x7fUL)        /*!< RCC RFSWHSECR: GMC (Bitfield-Mask: 0x7f) */
#define RCC_RFSWHSECR_GMC                                                  RCC_RFSWHSECR_GMC_Msk
#define RCC_RFSWHSECR_GMC_0                                                (0x1U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_1                                                (0x2U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_2                                                (0x4U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_3                                                (0x8U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_4                                                (0x10U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_5                                                (0x20U << RCC_RFSWHSECR_GMC_Pos)
#define RCC_RFSWHSECR_GMC_6                                                (0x40U << RCC_RFSWHSECR_GMC_Pos)

/* =====================================================    RFHSECR    =====================================================*/
#define RCC_RFHSECR_AMPLREADY_Pos                                          (6UL)        /*!<RCC RFHSECR: AMPLREADY (Bit 6) */
#define RCC_RFHSECR_AMPLREADY_Msk                                          (0x40UL)        /*!< RCC RFHSECR: AMPLREADY (Bitfield-Mask: 0x01) */
#define RCC_RFHSECR_AMPLREADY                                              RCC_RFHSECR_AMPLREADY_Msk
#define RCC_RFHSECR_XOTUNE_Pos                                             (0UL)        /*!<RCC RFHSECR: XOTUNE (Bit 0) */
#define RCC_RFHSECR_XOTUNE_Msk                                             (0x3fUL)        /*!< RCC RFHSECR: XOTUNE (Bitfield-Mask: 0x3f) */
#define RCC_RFHSECR_XOTUNE                                                 RCC_RFHSECR_XOTUNE_Msk
#define RCC_RFHSECR_XOTUNE_0                                               (0x1U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_1                                               (0x2U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_2                                               (0x4U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_3                                               (0x8U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_4                                               (0x10U << RCC_RFHSECR_XOTUNE_Pos)
#define RCC_RFHSECR_XOTUNE_5                                               (0x20U << RCC_RFHSECR_XOTUNE_Pos)

/* =====================================================    AHBSMENR    =====================================================*/
#define RCC_AHBSMENR_AESSMEN_Pos                                           (20UL)        /*!<RCC AHBSMENR: AESSMEN (Bit 20) */
#define RCC_AHBSMENR_AESSMEN_Msk                                           (0x100000UL)        /*!< RCC AHBSMENR: AESSMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_AESSMEN                                               RCC_AHBSMENR_AESSMEN_Msk
#define RCC_AHBSMENR_RNGSMEN_Pos                                           (18UL)        /*!<RCC AHBSMENR: RNGSMEN (Bit 18) */
#define RCC_AHBSMENR_RNGSMEN_Msk                                           (0x40000UL)        /*!< RCC AHBSMENR: RNGSMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_RNGSMEN                                               RCC_AHBSMENR_RNGSMEN_Msk
#define RCC_AHBSMENR_CRCSMEN_Pos                                           (12UL)        /*!<RCC AHBSMENR: CRCSMEN (Bit 12) */
#define RCC_AHBSMENR_CRCSMEN_Msk                                           (0x1000UL)        /*!< RCC AHBSMENR: CRCSMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_CRCSMEN                                               RCC_AHBSMENR_CRCSMEN_Msk
#define RCC_AHBSMENR_SRAM1SMEN_Pos                                         (10UL)        /*!<RCC AHBSMENR: SRAM1SMEN (Bit 10) */
#define RCC_AHBSMENR_SRAM1SMEN_Msk                                         (0x400UL)        /*!< RCC AHBSMENR: SRAM1SMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_SRAM1SMEN                                             RCC_AHBSMENR_SRAM1SMEN_Msk
#define RCC_AHBSMENR_SRAM0SMEN_Pos                                         (9UL)        /*!<RCC AHBSMENR: SRAM0SMEN (Bit 9) */
#define RCC_AHBSMENR_SRAM0SMEN_Msk                                         (0x200UL)        /*!< RCC AHBSMENR: SRAM0SMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_SRAM0SMEN                                             RCC_AHBSMENR_SRAM0SMEN_Msk
#define RCC_AHBSMENR_GPIOBSMEN_Pos                                         (3UL)        /*!<RCC AHBSMENR: GPIOBSMEN (Bit 3) */
#define RCC_AHBSMENR_GPIOBSMEN_Msk                                         (0x8UL)        /*!< RCC AHBSMENR: GPIOBSMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_GPIOBSMEN                                             RCC_AHBSMENR_GPIOBSMEN_Msk
#define RCC_AHBSMENR_GPIOASMEN_Pos                                         (2UL)        /*!<RCC AHBSMENR: GPIOASMEN (Bit 2) */
#define RCC_AHBSMENR_GPIOASMEN_Msk                                         (0x4UL)        /*!< RCC AHBSMENR: GPIOASMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_GPIOASMEN                                             RCC_AHBSMENR_GPIOASMEN_Msk
#define RCC_AHBSMENR_DMASMEN_Pos                                           (0UL)        /*!<RCC AHBSMENR: DMASMEN (Bit 0) */
#define RCC_AHBSMENR_DMASMEN_Msk                                           (0x1UL)        /*!< RCC AHBSMENR: DMASMEN (Bitfield-Mask: 0x01) */
#define RCC_AHBSMENR_DMASMEN                                               RCC_AHBSMENR_DMASMEN_Msk

