stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    APB0SMENR    =====================================================*/
#define RCC_APB0SMENR_DBGMCUSMEN_Pos                                       (15UL)        /*!<RCC APB0SMENR: DBGMCUSMEN (Bit 15) */
#define RCC_APB0SMENR_DBGMCUSMEN_Msk                                       (0x8000UL)        /*!< RCC APB0SMENR: DBGMCUSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_DBGMCUSMEN                                           RCC_APB0SMENR_DBGMCUSMEN_Msk
#define RCC_APB0SMENR_WDGSMEN_Pos                                          (14UL)        /*!<RCC APB0SMENR: WDGSMEN (Bit 14) */
#define RCC_APB0SMENR_WDGSMEN_Msk                                          (0x4000UL)        /*!< RCC APB0SMENR: WDGSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_WDGSMEN                                              RCC_APB0SMENR_WDGSMEN_Msk
#define RCC_APB0SMENR_RTCSMEN_Pos                                          (12UL)        /*!<RCC APB0SMENR: RTCSMEN (Bit 12) */
#define RCC_APB0SMENR_RTCSMEN_Msk                                          (0x1000UL)        /*!< RCC APB0SMENR: RTCSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_RTCSMEN                                              RCC_APB0SMENR_RTCSMEN_Msk
#define RCC_APB0SMENR_SYSCFGSMEN_Pos                                       (8UL)        /*!<RCC APB0SMENR: SYSCFGSMEN (Bit 8) */
#define RCC_APB0SMENR_SYSCFGSMEN_Msk                                       (0x100UL)        /*!< RCC APB0SMENR: SYSCFGSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_SYSCFGSMEN                                           RCC_APB0SMENR_SYSCFGSMEN_Msk
#define RCC_APB0SMENR_TIM16SMEN_Pos                                        (1UL)        /*!<RCC APB0SMENR: TIM16SMEN (Bit 1) */
#define RCC_APB0SMENR_TIM16SMEN_Msk                                        (0x2UL)        /*!< RCC APB0SMENR: TIM16SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_TIM16SMEN                                            RCC_APB0SMENR_TIM16SMEN_Msk
#define RCC_APB0SMENR_TIM2SMEN_Pos                                         (0UL)        /*!<RCC APB0SMENR: TIM2SMEN (Bit 0) */
#define RCC_APB0SMENR_TIM2SMEN_Msk                                         (0x1UL)        /*!< RCC APB0SMENR: TIM2SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB0SMENR_TIM2SMEN                                             RCC_APB0SMENR_TIM2SMEN_Msk

/* =====================================================    APB1SMENR    =====================================================*/
#define RCC_APB1SMENR_I2C1SMEN_Pos                                         (21UL)        /*!<RCC APB1SMENR: I2C1SMEN (Bit 21) */
#define RCC_APB1SMENR_I2C1SMEN_Msk                                         (0x200000UL)        /*!< RCC APB1SMENR: I2C1SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_I2C1SMEN                                             RCC_APB1SMENR_I2C1SMEN_Msk
#define RCC_APB1SMENR_SPI3SMEN_Pos                                         (14UL)        /*!<RCC APB1SMENR: SPI3SMEN (Bit 14) */
#define RCC_APB1SMENR_SPI3SMEN_Msk                                         (0x4000UL)        /*!< RCC APB1SMENR: SPI3SMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_SPI3SMEN                                             RCC_APB1SMENR_SPI3SMEN_Msk
#define RCC_APB1SMENR_USARTSMEN_Pos                                        (10UL)        /*!<RCC APB1SMENR: USARTSMEN (Bit 10) */
#define RCC_APB1SMENR_USARTSMEN_Msk                                        (0x400UL)        /*!< RCC APB1SMENR: USARTSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_USARTSMEN                                            RCC_APB1SMENR_USARTSMEN_Msk
#define RCC_APB1SMENR_LPUARTSMEN_Pos                                       (8UL)        /*!<RCC APB1SMENR: LPUARTSMEN (Bit 8) */
#define RCC_APB1SMENR_LPUARTSMEN_Msk                                       (0x100UL)        /*!< RCC APB1SMENR: LPUARTSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_LPUARTSMEN                                           RCC_APB1SMENR_LPUARTSMEN_Msk
#define RCC_APB1SMENR_ADCANASMEN_Pos                                       (5UL)        /*!<RCC APB1SMENR: ADCANASMEN (Bit 5) */
#define RCC_APB1SMENR_ADCANASMEN_Msk                                       (0x20UL)        /*!< RCC APB1SMENR: ADCANASMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_ADCANASMEN                                           RCC_APB1SMENR_ADCANASMEN_Msk
#define RCC_APB1SMENR_ADCDIGSMEN_Pos                                       (4UL)        /*!<RCC APB1SMENR: ADCDIGSMEN (Bit 4) */
#define RCC_APB1SMENR_ADCDIGSMEN_Msk                                       (0x10UL)        /*!< RCC APB1SMENR: ADCDIGSMEN (Bitfield-Mask: 0x01) */
#define RCC_APB1SMENR_ADCDIGSMEN                                           RCC_APB1SMENR_ADCDIGSMEN_Msk


/* ============================================================================================================================*/
/*=====================                                        PWR                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR1    =====================================================*/
#define PWR_CR1_APC_Pos                                                    (4UL)        /*!<PWR CR1: APC (Bit 4) */
#define PWR_CR1_APC_Msk                                                    (0x10UL)        /*!< PWR CR1: APC (Bitfield-Mask: 0x01) */
#define PWR_CR1_APC                                                        PWR_CR1_APC_Msk
#define PWR_CR1_IBIAS_RUN_STATE_Pos                                        (3UL)        /*!<PWR CR1: IBIAS_RUN_STATE (Bit 3) */
#define PWR_CR1_IBIAS_RUN_STATE_Msk                                        (0x8UL)        /*!< PWR CR1: IBIAS_RUN_STATE (Bitfield-Mask: 0x01) */
#define PWR_CR1_IBIAS_RUN_STATE                                            PWR_CR1_IBIAS_RUN_STATE_Msk
#define PWR_CR1_IBIAS_RUN_AUTO_Pos                                         (2UL)        /*!<PWR CR1: IBIAS_RUN_AUTO (Bit 2) */
#define PWR_CR1_IBIAS_RUN_AUTO_Msk                                         (0x4UL)        /*!< PWR CR1: IBIAS_RUN_AUTO (Bitfield-Mask: 0x01) */
#define PWR_CR1_IBIAS_RUN_AUTO                                             PWR_CR1_IBIAS_RUN_AUTO_Msk
#define PWR_CR1_ENSDNBOR_Pos                                               (1UL)        /*!<PWR CR1: ENSDNBOR (Bit 1) */
#define PWR_CR1_ENSDNBOR_Msk                                               (0x2UL)        /*!< PWR CR1: ENSDNBOR (Bitfield-Mask: 0x01) */
#define PWR_CR1_ENSDNBOR                                                   PWR_CR1_ENSDNBOR_Msk
#define PWR_CR1_LPMS_Pos                                                   (0UL)        /*!<PWR CR1: LPMS (Bit 0) */
#define PWR_CR1_LPMS_Msk                                                   (0x1UL)        /*!< PWR CR1: LPMS (Bitfield-Mask: 0x01) */
#define PWR_CR1_LPMS                                                       PWR_CR1_LPMS_Msk

/* =====================================================    CR2    =====================================================*/
#define PWR_CR2_RFREGON_STATUS_Pos                                         (14UL)        /*!<PWR CR2: RFREGON_STATUS (Bit 14) */
#define PWR_CR2_RFREGON_STATUS_Msk                                         (0x4000UL)        /*!< PWR CR2: RFREGON_STATUS (Bitfield-Mask: 0x01) */
#define PWR_CR2_RFREGON_STATUS                                             PWR_CR2_RFREGON_STATUS_Msk
#define PWR_CR2_RFREGRDY_Pos                                               (13UL)        /*!<PWR CR2: RFREGRDY (Bit 13) */
#define PWR_CR2_RFREGRDY_Msk                                               (0x2000UL)        /*!< PWR CR2: RFREGRDY (Bitfield-Mask: 0x01) */
#define PWR_CR2_RFREGRDY                                                   PWR_CR2_RFREGRDY_Msk
#define PWR_CR2_RFREGBYP_Pos                                               (12UL)        /*!<PWR CR2: RFREGBYP (Bit 12) */
#define PWR_CR2_RFREGBYP_Msk                                               (0x1000UL)        /*!< PWR CR2: RFREGBYP (Bitfield-Mask: 0x01) */
#define PWR_CR2_RFREGBYP                                                   PWR_CR2_RFREGBYP_Msk
#define PWR_CR2_RFREGCEXT_Pos                                              (11UL)        /*!<PWR CR2: RFREGCEXT (Bit 11) */
#define PWR_CR2_RFREGCEXT_Msk                                              (0x800UL)        /*!< PWR CR2: RFREGCEXT (Bitfield-Mask: 0x01) */
#define PWR_CR2_RFREGCEXT                                                  PWR_CR2_RFREGCEXT_Msk
#define PWR_CR2_RFREGEN_Pos                                                (10UL)        /*!<PWR CR2: RFREGEN (Bit 10) */
#define PWR_CR2_RFREGEN_Msk                                                (0x400UL)        /*!< PWR CR2: RFREGEN (Bitfield-Mask: 0x01) */
#define PWR_CR2_RFREGEN                                                    PWR_CR2_RFREGEN_Msk
#define PWR_CR2_ENTS_Pos                                                   (9UL)        /*!<PWR CR2: ENTS (Bit 9) */
#define PWR_CR2_ENTS_Msk                                                   (0x200UL)        /*!< PWR CR2: ENTS (Bitfield-Mask: 0x01) */
#define PWR_CR2_ENTS                                                       PWR_CR2_ENTS_Msk
#define PWR_CR2_GPIORET_Pos                                                (8UL)        /*!<PWR CR2: GPIORET (Bit 8) */
#define PWR_CR2_GPIORET_Msk                                                (0x100UL)        /*!< PWR CR2: GPIORET (Bitfield-Mask: 0x01) */
#define PWR_CR2_GPIORET                                                    PWR_CR2_GPIORET_Msk
#define PWR_CR2_LPREG_VH_STATUS_Pos                                        (7UL)        /*!<PWR CR2: LPREG_VH_STATUS (Bit 7) */
#define PWR_CR2_LPREG_VH_STATUS_Msk                                        (0x80UL)        /*!< PWR CR2: LPREG_VH_STATUS (Bitfield-Mask: 0x01) */
#define PWR_CR2_LPREG_VH_STATUS                                            PWR_CR2_LPREG_VH_STATUS_Msk
#define PWR_CR2_LPREG_FORCE_VH_Pos                                         (6UL)        /*!<PWR CR2: LPREG_FORCE_VH (Bit 6) */
#define PWR_CR2_LPREG_FORCE_VH_Msk                                         (0x40UL)        /*!< PWR CR2: LPREG_FORCE_VH (Bitfield-Mask: 0x01) */
#define PWR_CR2_LPREG_FORCE_VH                                             PWR_CR2_LPREG_FORCE_VH_Msk
#define PWR_CR2_RAMRET1_Pos                                                (5UL)        /*!<PWR CR2: RAMRET1 (Bit 5) */
#define PWR_CR2_RAMRET1_Msk                                                (0x20UL)        /*!< PWR CR2: RAMRET1 (Bitfield-Mask: 0x01) */
#define PWR_CR2_RAMRET1                                                    PWR_CR2_RAMRET1_Msk
#define PWR_CR2_DBGRET_Pos                                                 (4UL)        /*!<PWR CR2: DBGRET (Bit 4) */
#define PWR_CR2_DBGRET_Msk                                                 (0x10UL)        /*!< PWR CR2: DBGRET (Bitfield-Mask: 0x01) */
#define PWR_CR2_DBGRET                                                     PWR_CR2_DBGRET_Msk
#define PWR_CR2_PVDLS_Pos                                                  (1UL)        /*!<PWR CR2: PVDLS (Bit 1) */
#define PWR_CR2_PVDLS_Msk                                                  (0xeUL)        /*!< PWR CR2: PVDLS (Bitfield-Mask: 0x07) */
#define PWR_CR2_PVDLS                                                      PWR_CR2_PVDLS_Msk
#define PWR_CR2_PVDLS_0                                                    (0x1U << PWR_CR2_PVDLS_Pos)
#define PWR_CR2_PVDLS_1                                                    (0x2U << PWR_CR2_PVDLS_Pos)
#define PWR_CR2_PVDLS_2                                                    (0x4U << PWR_CR2_PVDLS_Pos)
#define PWR_CR2_PVDE_Pos                                                   (0UL)        /*!<PWR CR2: PVDE (Bit 0) */
#define PWR_CR2_PVDE_Msk                                                   (0x1UL)        /*!< PWR CR2: PVDE (Bitfield-Mask: 0x01) */
#define PWR_CR2_PVDE                                                       PWR_CR2_PVDE_Msk

/* =====================================================    IEWU    =====================================================*/
#define PWR_IEWU_EWMRSUBGHCPU_Pos                                          (9UL)        /*!<PWR IEWU: EWMRSUBGHCPU (Bit 9) */
#define PWR_IEWU_EWMRSUBGHCPU_Msk                                          (0x200UL)        /*!< PWR IEWU: EWMRSUBGHCPU (Bitfield-Mask: 0x01) */
#define PWR_IEWU_EWMRSUBGHCPU                                              PWR_IEWU_EWMRSUBGHCPU_Msk
#define PWR_IEWU_EWMRSUBG_Pos                                              (8UL)        /*!<PWR IEWU: EWMRSUBG (Bit 8) */
#define PWR_IEWU_EWMRSUBG_Msk                                              (0x100UL)        /*!< PWR IEWU: EWMRSUBG (Bitfield-Mask: 0x01) */
#define PWR_IEWU_EWMRSUBG                                                  PWR_IEWU_EWMRSUBG_Msk
#define PWR_IEWU_EIWL1_Pos                                                 (1UL)        /*!<PWR IEWU: EIWL1 (Bit 1) */
#define PWR_IEWU_EIWL1_Msk                                                 (0x2UL)        /*!< PWR IEWU: EIWL1 (Bitfield-Mask: 0x01) */
#define PWR_IEWU_EIWL1                                                     PWR_IEWU_EIWL1_Msk
#define PWR_IEWU_EIWL0_Pos                                                 (0UL)        /*!<PWR IEWU: EIWL0 (Bit 0) */
#define PWR_IEWU_EIWL0_Msk                                                 (0x1UL)        /*!< PWR IEWU: EIWL0 (Bitfield-Mask: 0x01) */
#define PWR_IEWU_EIWL0                                                     PWR_IEWU_EIWL0_Msk

/* =====================================================    IWUP    =====================================================*/
#define PWR_IWUP_WMRSUBGHCPUP_Pos                                          (9UL)        /*!<PWR IWUP: WMRSUBGHCPUP (Bit 9) */
#define PWR_IWUP_WMRSUBGHCPUP_Msk                                          (0x200UL)        /*!< PWR IWUP: WMRSUBGHCPUP (Bitfield-Mask: 0x01) */
#define PWR_IWUP_WMRSUBGHCPUP                                              PWR_IWUP_WMRSUBGHCPUP_Msk
#define PWR_IWUP_WMRSUBGP_Pos                                              (8UL)        /*!<PWR IWUP: WMRSUBGP (Bit 8) */
#define PWR_IWUP_WMRSUBGP_Msk                                              (0x100UL)        /*!< PWR IWUP: WMRSUBGP (Bitfield-Mask: 0x01) */
#define PWR_IWUP_WMRSUBGP                                                  PWR_IWUP_WMRSUBGP_Msk
#define PWR_IWUP_IWUP4_Pos                                                 (4UL)        /*!<PWR IWUP: IWUP4 (Bit 4) */
#define PWR_IWUP_IWUP4_Msk                                                 (0x10UL)        /*!< PWR IWUP: IWUP4 (Bitfield-Mask: 0x01) */
#define PWR_IWUP_IWUP4                                                     PWR_IWUP_IWUP4_Msk
#define PWR_IWUP_IWUP3_Pos                                                 (3UL)        /*!<PWR IWUP: IWUP3 (Bit 3) */
#define PWR_IWUP_IWUP3_Msk                                                 (0x8UL)        /*!< PWR IWUP: IWUP3 (Bitfield-Mask: 0x01) */
#define PWR_IWUP_IWUP3                                                     PWR_IWUP_IWUP3_Msk
#define PWR_IWUP_IWUP2_Pos                                                 (2UL)        /*!<PWR IWUP: IWUP2 (Bit 2) */
#define PWR_IWUP_IWUP2_Msk                                                 (0x4UL)        /*!< PWR IWUP: IWUP2 (Bitfield-Mask: 0x01) */
#define PWR_IWUP_IWUP2                                                     PWR_IWUP_IWUP2_Msk
#define PWR_IWUP_IWUP1_Pos                                                 (1UL)        /*!<PWR IWUP: IWUP1 (Bit 1) */
#define PWR_IWUP_IWUP1_Msk                                                 (0x2UL)        /*!< PWR IWUP: IWUP1 (Bitfield-Mask: 0x01) */
#define PWR_IWUP_IWUP1                                                     PWR_IWUP_IWUP1_Msk
#define PWR_IWUP_IWUP0_Pos                                                 (0UL)        /*!<PWR IWUP: IWUP0 (Bit 0) */
#define PWR_IWUP_IWUP0_Msk                                                 (0x1UL)        /*!< PWR IWUP: IWUP0 (Bitfield-Mask: 0x01) */
#define PWR_IWUP_IWUP0                                                     PWR_IWUP_IWUP0_Msk

