stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    PUCRA    =====================================================*/
#define PWR_PUCRA_PA15_Pos                                                 (15UL)        /*!<PWR PUCRA: PA15 (Bit 15) */
#define PWR_PUCRA_PA15_Msk                                                 (0x8000UL)        /*!< PWR PUCRA: PA15 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA15                                                     PWR_PUCRA_PA15_Msk
#define PWR_PUCRA_PA14_Pos                                                 (14UL)        /*!<PWR PUCRA: PA14 (Bit 14) */
#define PWR_PUCRA_PA14_Msk                                                 (0x4000UL)        /*!< PWR PUCRA: PA14 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA14                                                     PWR_PUCRA_PA14_Msk
#define PWR_PUCRA_PA13_Pos                                                 (13UL)        /*!<PWR PUCRA: PA13 (Bit 13) */
#define PWR_PUCRA_PA13_Msk                                                 (0x2000UL)        /*!< PWR PUCRA: PA13 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA13                                                     PWR_PUCRA_PA13_Msk
#define PWR_PUCRA_PA12_Pos                                                 (12UL)        /*!<PWR PUCRA: PA12 (Bit 12) */
#define PWR_PUCRA_PA12_Msk                                                 (0x1000UL)        /*!< PWR PUCRA: PA12 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA12                                                     PWR_PUCRA_PA12_Msk
#define PWR_PUCRA_PA11_Pos                                                 (11UL)        /*!<PWR PUCRA: PA11 (Bit 11) */
#define PWR_PUCRA_PA11_Msk                                                 (0x800UL)        /*!< PWR PUCRA: PA11 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA11                                                     PWR_PUCRA_PA11_Msk
#define PWR_PUCRA_PA10_Pos                                                 (10UL)        /*!<PWR PUCRA: PA10 (Bit 10) */
#define PWR_PUCRA_PA10_Msk                                                 (0x400UL)        /*!< PWR PUCRA: PA10 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA10                                                     PWR_PUCRA_PA10_Msk
#define PWR_PUCRA_PA9_Pos                                                  (9UL)        /*!<PWR PUCRA: PA9 (Bit 9) */
#define PWR_PUCRA_PA9_Msk                                                  (0x200UL)        /*!< PWR PUCRA: PA9 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA9                                                      PWR_PUCRA_PA9_Msk
#define PWR_PUCRA_PA8_Pos                                                  (8UL)        /*!<PWR PUCRA: PA8 (Bit 8) */
#define PWR_PUCRA_PA8_Msk                                                  (0x100UL)        /*!< PWR PUCRA: PA8 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA8                                                      PWR_PUCRA_PA8_Msk
#define PWR_PUCRA_PA7_Pos                                                  (7UL)        /*!<PWR PUCRA: PA7 (Bit 7) */
#define PWR_PUCRA_PA7_Msk                                                  (0x80UL)        /*!< PWR PUCRA: PA7 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA7                                                      PWR_PUCRA_PA7_Msk
#define PWR_PUCRA_PA6_Pos                                                  (6UL)        /*!<PWR PUCRA: PA6 (Bit 6) */
#define PWR_PUCRA_PA6_Msk                                                  (0x40UL)        /*!< PWR PUCRA: PA6 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA6                                                      PWR_PUCRA_PA6_Msk
#define PWR_PUCRA_PA5_Pos                                                  (5UL)        /*!<PWR PUCRA: PA5 (Bit 5) */
#define PWR_PUCRA_PA5_Msk                                                  (0x20UL)        /*!< PWR PUCRA: PA5 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA5                                                      PWR_PUCRA_PA5_Msk
#define PWR_PUCRA_PA4_Pos                                                  (4UL)        /*!<PWR PUCRA: PA4 (Bit 4) */
#define PWR_PUCRA_PA4_Msk                                                  (0x10UL)        /*!< PWR PUCRA: PA4 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA4                                                      PWR_PUCRA_PA4_Msk
#define PWR_PUCRA_PA3_Pos                                                  (3UL)        /*!<PWR PUCRA: PA3 (Bit 3) */
#define PWR_PUCRA_PA3_Msk                                                  (0x8UL)        /*!< PWR PUCRA: PA3 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA3                                                      PWR_PUCRA_PA3_Msk
#define PWR_PUCRA_PA2_Pos                                                  (2UL)        /*!<PWR PUCRA: PA2 (Bit 2) */
#define PWR_PUCRA_PA2_Msk                                                  (0x4UL)        /*!< PWR PUCRA: PA2 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA2                                                      PWR_PUCRA_PA2_Msk
#define PWR_PUCRA_PA1_Pos                                                  (1UL)        /*!<PWR PUCRA: PA1 (Bit 1) */
#define PWR_PUCRA_PA1_Msk                                                  (0x2UL)        /*!< PWR PUCRA: PA1 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA1                                                      PWR_PUCRA_PA1_Msk
#define PWR_PUCRA_PA0_Pos                                                  (0UL)        /*!<PWR PUCRA: PA0 (Bit 0) */
#define PWR_PUCRA_PA0_Msk                                                  (0x1UL)        /*!< PWR PUCRA: PA0 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA0                                                      PWR_PUCRA_PA0_Msk

/* =====================================================    PDCRA    =====================================================*/
#define PWR_PDCRA_PA15_Pos                                                 (15UL)        /*!<PWR PDCRA: PA15 (Bit 15) */
#define PWR_PDCRA_PA15_Msk                                                 (0x8000UL)        /*!< PWR PDCRA: PA15 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA15                                                     PWR_PDCRA_PA15_Msk
#define PWR_PDCRA_PA14_Pos                                                 (14UL)        /*!<PWR PDCRA: PA14 (Bit 14) */
#define PWR_PDCRA_PA14_Msk                                                 (0x4000UL)        /*!< PWR PDCRA: PA14 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA14                                                     PWR_PDCRA_PA14_Msk
#define PWR_PDCRA_PA13_Pos                                                 (13UL)        /*!<PWR PDCRA: PA13 (Bit 13) */
#define PWR_PDCRA_PA13_Msk                                                 (0x2000UL)        /*!< PWR PDCRA: PA13 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA13                                                     PWR_PDCRA_PA13_Msk
#define PWR_PDCRA_PA12_Pos                                                 (12UL)        /*!<PWR PDCRA: PA12 (Bit 12) */
#define PWR_PDCRA_PA12_Msk                                                 (0x1000UL)        /*!< PWR PDCRA: PA12 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA12                                                     PWR_PDCRA_PA12_Msk
#define PWR_PDCRA_PA11_Pos                                                 (11UL)        /*!<PWR PDCRA: PA11 (Bit 11) */
#define PWR_PDCRA_PA11_Msk                                                 (0x800UL)        /*!< PWR PDCRA: PA11 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA11                                                     PWR_PDCRA_PA11_Msk
#define PWR_PDCRA_PA10_Pos                                                 (10UL)        /*!<PWR PDCRA: PA10 (Bit 10) */
#define PWR_PDCRA_PA10_Msk                                                 (0x400UL)        /*!< PWR PDCRA: PA10 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA10                                                     PWR_PDCRA_PA10_Msk
#define PWR_PDCRA_PA9_Pos                                                  (9UL)        /*!<PWR PDCRA: PA9 (Bit 9) */
#define PWR_PDCRA_PA9_Msk                                                  (0x200UL)        /*!< PWR PDCRA: PA9 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA9                                                      PWR_PDCRA_PA9_Msk
#define PWR_PDCRA_PA8_Pos                                                  (8UL)        /*!<PWR PDCRA: PA8 (Bit 8) */
#define PWR_PDCRA_PA8_Msk                                                  (0x100UL)        /*!< PWR PDCRA: PA8 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA8                                                      PWR_PDCRA_PA8_Msk
#define PWR_PDCRA_PA7_Pos                                                  (7UL)        /*!<PWR PDCRA: PA7 (Bit 7) */
#define PWR_PDCRA_PA7_Msk                                                  (0x80UL)        /*!< PWR PDCRA: PA7 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA7                                                      PWR_PDCRA_PA7_Msk
#define PWR_PDCRA_UDP_Pos                                                  (6UL)        /*!<PWR PDCRA: UDP (Bit 6) */
#define PWR_PDCRA_UDP_Msk                                                  (0x40UL)        /*!< PWR PDCRA: UDP (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_UDP                                                      PWR_PDCRA_UDP_Msk
#define PWR_PDCRA_PA5_Pos                                                  (5UL)        /*!<PWR PDCRA: PA5 (Bit 5) */
#define PWR_PDCRA_PA5_Msk                                                  (0x20UL)        /*!< PWR PDCRA: PA5 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA5                                                      PWR_PDCRA_PA5_Msk
#define PWR_PDCRA_PA4_Pos                                                  (4UL)        /*!<PWR PDCRA: PA4 (Bit 4) */
#define PWR_PDCRA_PA4_Msk                                                  (0x10UL)        /*!< PWR PDCRA: PA4 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA4                                                      PWR_PDCRA_PA4_Msk
#define PWR_PDCRA_PA3_Pos                                                  (3UL)        /*!<PWR PDCRA: PA3 (Bit 3) */
#define PWR_PDCRA_PA3_Msk                                                  (0x8UL)        /*!< PWR PDCRA: PA3 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA3                                                      PWR_PDCRA_PA3_Msk
#define PWR_PDCRA_PA2_Pos                                                  (2UL)        /*!<PWR PDCRA: PA2 (Bit 2) */
#define PWR_PDCRA_PA2_Msk                                                  (0x4UL)        /*!< PWR PDCRA: PA2 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA2                                                      PWR_PDCRA_PA2_Msk
#define PWR_PDCRA_PA1_Pos                                                  (1UL)        /*!<PWR PDCRA: PA1 (Bit 1) */
#define PWR_PDCRA_PA1_Msk                                                  (0x2UL)        /*!< PWR PDCRA: PA1 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA1                                                      PWR_PDCRA_PA1_Msk
#define PWR_PDCRA_PA0_Pos                                                  (0UL)        /*!<PWR PDCRA: PA0 (Bit 0) */
#define PWR_PDCRA_PA0_Msk                                                  (0x1UL)        /*!< PWR PDCRA: PA0 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA0                                                      PWR_PDCRA_PA0_Msk

