stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    EWUA    =====================================================*/
#define PWR_EWUA_EWU15_Pos                                                 (15UL)        /*!<PWR EWUA: EWU15 (Bit 15) */
#define PWR_EWUA_EWU15_Msk                                                 (0x8000UL)        /*!< PWR EWUA: EWU15 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU15                                                     PWR_EWUA_EWU15_Msk
#define PWR_EWUA_EWU14_Pos                                                 (14UL)        /*!<PWR EWUA: EWU14 (Bit 14) */
#define PWR_EWUA_EWU14_Msk                                                 (0x4000UL)        /*!< PWR EWUA: EWU14 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU14                                                     PWR_EWUA_EWU14_Msk
#define PWR_EWUA_EWU13_Pos                                                 (13UL)        /*!<PWR EWUA: EWU13 (Bit 13) */
#define PWR_EWUA_EWU13_Msk                                                 (0x2000UL)        /*!< PWR EWUA: EWU13 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU13                                                     PWR_EWUA_EWU13_Msk
#define PWR_EWUA_EWU12_Pos                                                 (12UL)        /*!<PWR EWUA: EWU12 (Bit 12) */
#define PWR_EWUA_EWU12_Msk                                                 (0x1000UL)        /*!< PWR EWUA: EWU12 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU12                                                     PWR_EWUA_EWU12_Msk
#define PWR_EWUA_EWU11_Pos                                                 (11UL)        /*!<PWR EWUA: EWU11 (Bit 11) */
#define PWR_EWUA_EWU11_Msk                                                 (0x800UL)        /*!< PWR EWUA: EWU11 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU11                                                     PWR_EWUA_EWU11_Msk
#define PWR_EWUA_EWU10_Pos                                                 (10UL)        /*!<PWR EWUA: EWU10 (Bit 10) */
#define PWR_EWUA_EWU10_Msk                                                 (0x400UL)        /*!< PWR EWUA: EWU10 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU10                                                     PWR_EWUA_EWU10_Msk
#define PWR_EWUA_EWU9_Pos                                                  (9UL)        /*!<PWR EWUA: EWU9 (Bit 9) */
#define PWR_EWUA_EWU9_Msk                                                  (0x200UL)        /*!< PWR EWUA: EWU9 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU9                                                      PWR_EWUA_EWU9_Msk
#define PWR_EWUA_EWU8_Pos                                                  (8UL)        /*!<PWR EWUA: EWU8 (Bit 8) */
#define PWR_EWUA_EWU8_Msk                                                  (0x100UL)        /*!< PWR EWUA: EWU8 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU8                                                      PWR_EWUA_EWU8_Msk
#define PWR_EWUA_EWU7_Pos                                                  (7UL)        /*!<PWR EWUA: EWU7 (Bit 7) */
#define PWR_EWUA_EWU7_Msk                                                  (0x80UL)        /*!< PWR EWUA: EWU7 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU7                                                      PWR_EWUA_EWU7_Msk
#define PWR_EWUA_EWU6_Pos                                                  (6UL)        /*!<PWR EWUA: EWU6 (Bit 6) */
#define PWR_EWUA_EWU6_Msk                                                  (0x40UL)        /*!< PWR EWUA: EWU6 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU6                                                      PWR_EWUA_EWU6_Msk
#define PWR_EWUA_EWU5_Pos                                                  (5UL)        /*!<PWR EWUA: EWU5 (Bit 5) */
#define PWR_EWUA_EWU5_Msk                                                  (0x20UL)        /*!< PWR EWUA: EWU5 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU5                                                      PWR_EWUA_EWU5_Msk
#define PWR_EWUA_EWU4_Pos                                                  (4UL)        /*!<PWR EWUA: EWU4 (Bit 4) */
#define PWR_EWUA_EWU4_Msk                                                  (0x10UL)        /*!< PWR EWUA: EWU4 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU4                                                      PWR_EWUA_EWU4_Msk
#define PWR_EWUA_EWU3_Pos                                                  (3UL)        /*!<PWR EWUA: EWU3 (Bit 3) */
#define PWR_EWUA_EWU3_Msk                                                  (0x8UL)        /*!< PWR EWUA: EWU3 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU3                                                      PWR_EWUA_EWU3_Msk
#define PWR_EWUA_EWU2_Pos                                                  (2UL)        /*!<PWR EWUA: EWU2 (Bit 2) */
#define PWR_EWUA_EWU2_Msk                                                  (0x4UL)        /*!< PWR EWUA: EWU2 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU2                                                      PWR_EWUA_EWU2_Msk
#define PWR_EWUA_EWU1_Pos                                                  (1UL)        /*!<PWR EWUA: EWU1 (Bit 1) */
#define PWR_EWUA_EWU1_Msk                                                  (0x2UL)        /*!< PWR EWUA: EWU1 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU1                                                      PWR_EWUA_EWU1_Msk
#define PWR_EWUA_EWU0_Pos                                                  (0UL)        /*!<PWR EWUA: EWU0 (Bit 0) */
#define PWR_EWUA_EWU0_Msk                                                  (0x1UL)        /*!< PWR EWUA: EWU0 (Bitfield-Mask: 0x01) */
#define PWR_EWUA_EWU0                                                      PWR_EWUA_EWU0_Msk

/* =====================================================    WUPA    =====================================================*/
#define PWR_WUPA_WUP15_Pos                                                 (15UL)        /*!<PWR WUPA: WUP15 (Bit 15) */
#define PWR_WUPA_WUP15_Msk                                                 (0x8000UL)        /*!< PWR WUPA: WUP15 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP15                                                     PWR_WUPA_WUP15_Msk
#define PWR_WUPA_WUP14_Pos                                                 (14UL)        /*!<PWR WUPA: WUP14 (Bit 14) */
#define PWR_WUPA_WUP14_Msk                                                 (0x4000UL)        /*!< PWR WUPA: WUP14 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP14                                                     PWR_WUPA_WUP14_Msk
#define PWR_WUPA_WUP13_Pos                                                 (13UL)        /*!<PWR WUPA: WUP13 (Bit 13) */
#define PWR_WUPA_WUP13_Msk                                                 (0x2000UL)        /*!< PWR WUPA: WUP13 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP13                                                     PWR_WUPA_WUP13_Msk
#define PWR_WUPA_WUP12_Pos                                                 (12UL)        /*!<PWR WUPA: WUP12 (Bit 12) */
#define PWR_WUPA_WUP12_Msk                                                 (0x1000UL)        /*!< PWR WUPA: WUP12 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP12                                                     PWR_WUPA_WUP12_Msk
#define PWR_WUPA_WUP11_Pos                                                 (11UL)        /*!<PWR WUPA: WUP11 (Bit 11) */
#define PWR_WUPA_WUP11_Msk                                                 (0x800UL)        /*!< PWR WUPA: WUP11 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP11                                                     PWR_WUPA_WUP11_Msk
#define PWR_WUPA_WUP10_Pos                                                 (10UL)        /*!<PWR WUPA: WUP10 (Bit 10) */
#define PWR_WUPA_WUP10_Msk                                                 (0x400UL)        /*!< PWR WUPA: WUP10 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP10                                                     PWR_WUPA_WUP10_Msk
#define PWR_WUPA_WUP9_Pos                                                  (9UL)        /*!<PWR WUPA: WUP9 (Bit 9) */
#define PWR_WUPA_WUP9_Msk                                                  (0x200UL)        /*!< PWR WUPA: WUP9 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP9                                                      PWR_WUPA_WUP9_Msk
#define PWR_WUPA_WUP8_Pos                                                  (8UL)        /*!<PWR WUPA: WUP8 (Bit 8) */
#define PWR_WUPA_WUP8_Msk                                                  (0x100UL)        /*!< PWR WUPA: WUP8 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP8                                                      PWR_WUPA_WUP8_Msk
#define PWR_WUPA_WUP7_Pos                                                  (7UL)        /*!<PWR WUPA: WUP7 (Bit 7) */
#define PWR_WUPA_WUP7_Msk                                                  (0x80UL)        /*!< PWR WUPA: WUP7 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP7                                                      PWR_WUPA_WUP7_Msk
#define PWR_WUPA_WUP6_Pos                                                  (6UL)        /*!<PWR WUPA: WUP6 (Bit 6) */
#define PWR_WUPA_WUP6_Msk                                                  (0x40UL)        /*!< PWR WUPA: WUP6 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP6                                                      PWR_WUPA_WUP6_Msk
#define PWR_WUPA_WUP5_Pos                                                  (5UL)        /*!<PWR WUPA: WUP5 (Bit 5) */
#define PWR_WUPA_WUP5_Msk                                                  (0x20UL)        /*!< PWR WUPA: WUP5 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP5                                                      PWR_WUPA_WUP5_Msk
#define PWR_WUPA_WUP4_Pos                                                  (4UL)        /*!<PWR WUPA: WUP4 (Bit 4) */
#define PWR_WUPA_WUP4_Msk                                                  (0x10UL)        /*!< PWR WUPA: WUP4 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP4                                                      PWR_WUPA_WUP4_Msk
#define PWR_WUPA_WUP3_Pos                                                  (3UL)        /*!<PWR WUPA: WUP3 (Bit 3) */
#define PWR_WUPA_WUP3_Msk                                                  (0x8UL)        /*!< PWR WUPA: WUP3 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP3                                                      PWR_WUPA_WUP3_Msk
#define PWR_WUPA_WUP2_Pos                                                  (2UL)        /*!<PWR WUPA: WUP2 (Bit 2) */
#define PWR_WUPA_WUP2_Msk                                                  (0x4UL)        /*!< PWR WUPA: WUP2 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP2                                                      PWR_WUPA_WUP2_Msk
#define PWR_WUPA_WUP1_Pos                                                  (1UL)        /*!<PWR WUPA: WUP1 (Bit 1) */
#define PWR_WUPA_WUP1_Msk                                                  (0x2UL)        /*!< PWR WUPA: WUP1 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP1                                                      PWR_WUPA_WUP1_Msk
#define PWR_WUPA_WUP0_Pos                                                  (0UL)        /*!<PWR WUPA: WUP0 (Bit 0) */
#define PWR_WUPA_WUP0_Msk                                                  (0x1UL)        /*!< PWR WUPA: WUP0 (Bitfield-Mask: 0x01) */
#define PWR_WUPA_WUP0                                                      PWR_WUPA_WUP0_Msk

/* =====================================================    WUFA    =====================================================*/
#define PWR_WUFA_WUF15_Pos                                                 (15UL)        /*!<PWR WUFA: WUF15 (Bit 15) */
#define PWR_WUFA_WUF15_Msk                                                 (0x8000UL)        /*!< PWR WUFA: WUF15 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF15                                                     PWR_WUFA_WUF15_Msk
#define PWR_WUFA_WUF14_Pos                                                 (14UL)        /*!<PWR WUFA: WUF14 (Bit 14) */
#define PWR_WUFA_WUF14_Msk                                                 (0x4000UL)        /*!< PWR WUFA: WUF14 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF14                                                     PWR_WUFA_WUF14_Msk
#define PWR_WUFA_WUF13_Pos                                                 (13UL)        /*!<PWR WUFA: WUF13 (Bit 13) */
#define PWR_WUFA_WUF13_Msk                                                 (0x2000UL)        /*!< PWR WUFA: WUF13 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF13                                                     PWR_WUFA_WUF13_Msk
#define PWR_WUFA_WUF12_Pos                                                 (12UL)        /*!<PWR WUFA: WUF12 (Bit 12) */
#define PWR_WUFA_WUF12_Msk                                                 (0x1000UL)        /*!< PWR WUFA: WUF12 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF12                                                     PWR_WUFA_WUF12_Msk
#define PWR_WUFA_WUF11_Pos                                                 (11UL)        /*!<PWR WUFA: WUF11 (Bit 11) */
#define PWR_WUFA_WUF11_Msk                                                 (0x800UL)        /*!< PWR WUFA: WUF11 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF11                                                     PWR_WUFA_WUF11_Msk
#define PWR_WUFA_WUF10_Pos                                                 (10UL)        /*!<PWR WUFA: WUF10 (Bit 10) */
#define PWR_WUFA_WUF10_Msk                                                 (0x400UL)        /*!< PWR WUFA: WUF10 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF10                                                     PWR_WUFA_WUF10_Msk
#define PWR_WUFA_WUF9_Pos                                                  (9UL)        /*!<PWR WUFA: WUF9 (Bit 9) */
#define PWR_WUFA_WUF9_Msk                                                  (0x200UL)        /*!< PWR WUFA: WUF9 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF9                                                      PWR_WUFA_WUF9_Msk
#define PWR_WUFA_WUF8_Pos                                                  (8UL)        /*!<PWR WUFA: WUF8 (Bit 8) */
#define PWR_WUFA_WUF8_Msk                                                  (0x100UL)        /*!< PWR WUFA: WUF8 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF8                                                      PWR_WUFA_WUF8_Msk
#define PWR_WUFA_WUF7_Pos                                                  (7UL)        /*!<PWR WUFA: WUF7 (Bit 7) */
#define PWR_WUFA_WUF7_Msk                                                  (0x80UL)        /*!< PWR WUFA: WUF7 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF7                                                      PWR_WUFA_WUF7_Msk
#define PWR_WUFA_WUF6_Pos                                                  (6UL)        /*!<PWR WUFA: WUF6 (Bit 6) */
#define PWR_WUFA_WUF6_Msk                                                  (0x40UL)        /*!< PWR WUFA: WUF6 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF6                                                      PWR_WUFA_WUF6_Msk
#define PWR_WUFA_WUF5_Pos                                                  (5UL)        /*!<PWR WUFA: WUF5 (Bit 5) */
#define PWR_WUFA_WUF5_Msk                                                  (0x20UL)        /*!< PWR WUFA: WUF5 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF5                                                      PWR_WUFA_WUF5_Msk
#define PWR_WUFA_WUF4_Pos                                                  (4UL)        /*!<PWR WUFA: WUF4 (Bit 4) */
#define PWR_WUFA_WUF4_Msk                                                  (0x10UL)        /*!< PWR WUFA: WUF4 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF4                                                      PWR_WUFA_WUF4_Msk
#define PWR_WUFA_WUF3_Pos                                                  (3UL)        /*!<PWR WUFA: WUF3 (Bit 3) */
#define PWR_WUFA_WUF3_Msk                                                  (0x8UL)        /*!< PWR WUFA: WUF3 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF3                                                      PWR_WUFA_WUF3_Msk
#define PWR_WUFA_WUF2_Pos                                                  (2UL)        /*!<PWR WUFA: WUF2 (Bit 2) */
#define PWR_WUFA_WUF2_Msk                                                  (0x4UL)        /*!< PWR WUFA: WUF2 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF2                                                      PWR_WUFA_WUF2_Msk
#define PWR_WUFA_WUF1_Pos                                                  (1UL)        /*!<PWR WUFA: WUF1 (Bit 1) */
#define PWR_WUFA_WUF1_Msk                                                  (0x2UL)        /*!< PWR WUFA: WUF1 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF1                                                      PWR_WUFA_WUF1_Msk
#define PWR_WUFA_WUF0_Pos                                                  (0UL)        /*!<PWR WUFA: WUF0 (Bit 0) */
#define PWR_WUFA_WUF0_Msk                                                  (0x1UL)        /*!< PWR WUFA: WUF0 (Bitfield-Mask: 0x01) */
#define PWR_WUFA_WUF0                                                      PWR_WUFA_WUF0_Msk

