stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    IVR0    =====================================================*/
#define AES_IVR0_IVI_Pos                                                   (0UL)        /*!<AES IVR0: IVI (Bit 0) */
#define AES_IVR0_IVI_Msk                                                   (0xffffffffUL)        /*!< AES IVR0: IVI (Bitfield-Mask: 0xffffffff) */
#define AES_IVR0_IVI                                                       AES_IVR0_IVI_Msk
#define AES_IVR0_IVI_0                                                     (0x1U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_1                                                     (0x2U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_2                                                     (0x4U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_3                                                     (0x8U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_4                                                     (0x10U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_5                                                     (0x20U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_6                                                     (0x40U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_7                                                     (0x80U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_8                                                     (0x100U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_9                                                     (0x200U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_10                                                    (0x400U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_11                                                    (0x800U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_12                                                    (0x1000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_13                                                    (0x2000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_14                                                    (0x4000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_15                                                    (0x8000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_16                                                    (0x10000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_17                                                    (0x20000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_18                                                    (0x40000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_19                                                    (0x80000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_20                                                    (0x100000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_21                                                    (0x200000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_22                                                    (0x400000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_23                                                    (0x800000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_24                                                    (0x1000000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_25                                                    (0x2000000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_26                                                    (0x4000000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_27                                                    (0x8000000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_28                                                    (0x10000000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_29                                                    (0x20000000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_30                                                    (0x40000000U << AES_IVR0_IVI_Pos)
#define AES_IVR0_IVI_31                                                    (0x80000000UL << AES_IVR0_IVI_Pos)

/* =====================================================    IVR1    =====================================================*/
#define AES_IVR1_IVI_Pos                                                   (0UL)        /*!<AES IVR1: IVI (Bit 0) */
#define AES_IVR1_IVI_Msk                                                   (0xffffffffUL)        /*!< AES IVR1: IVI (Bitfield-Mask: 0xffffffff) */
#define AES_IVR1_IVI                                                       AES_IVR1_IVI_Msk
#define AES_IVR1_IVI_0                                                     (0x1U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_1                                                     (0x2U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_2                                                     (0x4U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_3                                                     (0x8U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_4                                                     (0x10U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_5                                                     (0x20U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_6                                                     (0x40U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_7                                                     (0x80U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_8                                                     (0x100U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_9                                                     (0x200U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_10                                                    (0x400U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_11                                                    (0x800U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_12                                                    (0x1000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_13                                                    (0x2000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_14                                                    (0x4000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_15                                                    (0x8000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_16                                                    (0x10000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_17                                                    (0x20000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_18                                                    (0x40000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_19                                                    (0x80000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_20                                                    (0x100000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_21                                                    (0x200000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_22                                                    (0x400000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_23                                                    (0x800000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_24                                                    (0x1000000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_25                                                    (0x2000000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_26                                                    (0x4000000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_27                                                    (0x8000000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_28                                                    (0x10000000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_29                                                    (0x20000000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_30                                                    (0x40000000U << AES_IVR1_IVI_Pos)
#define AES_IVR1_IVI_31                                                    (0x80000000UL << AES_IVR1_IVI_Pos)

/* =====================================================    IVR2    =====================================================*/
#define AES_IVR2_IVI_Pos                                                   (0UL)        /*!<AES IVR2: IVI (Bit 0) */
#define AES_IVR2_IVI_Msk                                                   (0xffffffffUL)        /*!< AES IVR2: IVI (Bitfield-Mask: 0xffffffff) */
#define AES_IVR2_IVI                                                       AES_IVR2_IVI_Msk
#define AES_IVR2_IVI_0                                                     (0x1U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_1                                                     (0x2U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_2                                                     (0x4U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_3                                                     (0x8U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_4                                                     (0x10U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_5                                                     (0x20U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_6                                                     (0x40U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_7                                                     (0x80U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_8                                                     (0x100U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_9                                                     (0x200U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_10                                                    (0x400U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_11                                                    (0x800U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_12                                                    (0x1000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_13                                                    (0x2000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_14                                                    (0x4000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_15                                                    (0x8000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_16                                                    (0x10000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_17                                                    (0x20000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_18                                                    (0x40000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_19                                                    (0x80000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_20                                                    (0x100000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_21                                                    (0x200000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_22                                                    (0x400000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_23                                                    (0x800000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_24                                                    (0x1000000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_25                                                    (0x2000000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_26                                                    (0x4000000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_27                                                    (0x8000000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_28                                                    (0x10000000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_29                                                    (0x20000000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_30                                                    (0x40000000U << AES_IVR2_IVI_Pos)
#define AES_IVR2_IVI_31                                                    (0x80000000UL << AES_IVR2_IVI_Pos)

