stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    KEYR5    =====================================================*/
#define AES_KEYR5_KEY_Pos                                                  (0UL)        /*!<AES KEYR5: KEY (Bit 0) */
#define AES_KEYR5_KEY_Msk                                                  (0xffffffffUL)        /*!< AES KEYR5: KEY (Bitfield-Mask: 0xffffffff) */
#define AES_KEYR5_KEY                                                      AES_KEYR5_KEY_Msk
#define AES_KEYR5_KEY_0                                                    (0x1U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_1                                                    (0x2U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_2                                                    (0x4U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_3                                                    (0x8U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_4                                                    (0x10U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_5                                                    (0x20U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_6                                                    (0x40U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_7                                                    (0x80U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_8                                                    (0x100U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_9                                                    (0x200U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_10                                                   (0x400U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_11                                                   (0x800U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_12                                                   (0x1000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_13                                                   (0x2000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_14                                                   (0x4000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_15                                                   (0x8000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_16                                                   (0x10000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_17                                                   (0x20000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_18                                                   (0x40000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_19                                                   (0x80000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_20                                                   (0x100000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_21                                                   (0x200000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_22                                                   (0x400000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_23                                                   (0x800000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_24                                                   (0x1000000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_25                                                   (0x2000000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_26                                                   (0x4000000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_27                                                   (0x8000000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_28                                                   (0x10000000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_29                                                   (0x20000000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_30                                                   (0x40000000U << AES_KEYR5_KEY_Pos)
#define AES_KEYR5_KEY_31                                                   (0x80000000UL << AES_KEYR5_KEY_Pos)

/* =====================================================    KEYR6    =====================================================*/
#define AES_KEYR6_KEY_Pos                                                  (0UL)        /*!<AES KEYR6: KEY (Bit 0) */
#define AES_KEYR6_KEY_Msk                                                  (0xffffffffUL)        /*!< AES KEYR6: KEY (Bitfield-Mask: 0xffffffff) */
#define AES_KEYR6_KEY                                                      AES_KEYR6_KEY_Msk
#define AES_KEYR6_KEY_0                                                    (0x1U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_1                                                    (0x2U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_2                                                    (0x4U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_3                                                    (0x8U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_4                                                    (0x10U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_5                                                    (0x20U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_6                                                    (0x40U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_7                                                    (0x80U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_8                                                    (0x100U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_9                                                    (0x200U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_10                                                   (0x400U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_11                                                   (0x800U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_12                                                   (0x1000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_13                                                   (0x2000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_14                                                   (0x4000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_15                                                   (0x8000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_16                                                   (0x10000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_17                                                   (0x20000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_18                                                   (0x40000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_19                                                   (0x80000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_20                                                   (0x100000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_21                                                   (0x200000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_22                                                   (0x400000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_23                                                   (0x800000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_24                                                   (0x1000000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_25                                                   (0x2000000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_26                                                   (0x4000000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_27                                                   (0x8000000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_28                                                   (0x10000000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_29                                                   (0x20000000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_30                                                   (0x40000000U << AES_KEYR6_KEY_Pos)
#define AES_KEYR6_KEY_31                                                   (0x80000000UL << AES_KEYR6_KEY_Pos)

/* =====================================================    KEYR7    =====================================================*/
#define AES_KEYR7_KEY_Pos                                                  (0UL)        /*!<AES KEYR7: KEY (Bit 0) */
#define AES_KEYR7_KEY_Msk                                                  (0xffffffffUL)        /*!< AES KEYR7: KEY (Bitfield-Mask: 0xffffffff) */
#define AES_KEYR7_KEY                                                      AES_KEYR7_KEY_Msk
#define AES_KEYR7_KEY_0                                                    (0x1U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_1                                                    (0x2U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_2                                                    (0x4U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_3                                                    (0x8U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_4                                                    (0x10U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_5                                                    (0x20U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_6                                                    (0x40U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_7                                                    (0x80U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_8                                                    (0x100U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_9                                                    (0x200U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_10                                                   (0x400U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_11                                                   (0x800U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_12                                                   (0x1000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_13                                                   (0x2000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_14                                                   (0x4000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_15                                                   (0x8000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_16                                                   (0x10000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_17                                                   (0x20000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_18                                                   (0x40000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_19                                                   (0x80000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_20                                                   (0x100000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_21                                                   (0x200000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_22                                                   (0x400000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_23                                                   (0x800000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_24                                                   (0x1000000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_25                                                   (0x2000000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_26                                                   (0x4000000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_27                                                   (0x8000000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_28                                                   (0x10000000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_29                                                   (0x20000000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_30                                                   (0x40000000U << AES_KEYR7_KEY_Pos)
#define AES_KEYR7_KEY_31                                                   (0x80000000UL << AES_KEYR7_KEY_Pos)

/* =====================================================    SUSP0    =====================================================*/
#define AES_SUSP0_SUSP_Pos                                                 (0UL)        /*!<AES SUSP0: SUSP (Bit 0) */
#define AES_SUSP0_SUSP_Msk                                                 (0xffffffffUL)        /*!< AES SUSP0: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP0_SUSP                                                     AES_SUSP0_SUSP_Msk
#define AES_SUSP0_SUSP_0                                                   (0x1U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_1                                                   (0x2U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_2                                                   (0x4U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_3                                                   (0x8U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_4                                                   (0x10U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_5                                                   (0x20U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_6                                                   (0x40U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_7                                                   (0x80U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_8                                                   (0x100U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_9                                                   (0x200U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_10                                                  (0x400U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_11                                                  (0x800U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_12                                                  (0x1000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_13                                                  (0x2000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_14                                                  (0x4000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_15                                                  (0x8000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_16                                                  (0x10000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_17                                                  (0x20000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_18                                                  (0x40000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_19                                                  (0x80000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_20                                                  (0x100000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_21                                                  (0x200000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_22                                                  (0x400000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_23                                                  (0x800000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_24                                                  (0x1000000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_25                                                  (0x2000000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_26                                                  (0x4000000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_27                                                  (0x8000000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_28                                                  (0x10000000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_29                                                  (0x20000000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_30                                                  (0x40000000U << AES_SUSP0_SUSP_Pos)
#define AES_SUSP0_SUSP_31                                                  (0x80000000UL << AES_SUSP0_SUSP_Pos)

/* =====================================================    SUSP1    =====================================================*/
#define AES_SUSP1_SUSP_Pos                                                 (0UL)        /*!<AES SUSP1: SUSP (Bit 0) */
#define AES_SUSP1_SUSP_Msk                                                 (0xffffffffUL)        /*!< AES SUSP1: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP1_SUSP                                                     AES_SUSP1_SUSP_Msk
#define AES_SUSP1_SUSP_0                                                   (0x1U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_1                                                   (0x2U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_2                                                   (0x4U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_3                                                   (0x8U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_4                                                   (0x10U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_5                                                   (0x20U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_6                                                   (0x40U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_7                                                   (0x80U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_8                                                   (0x100U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_9                                                   (0x200U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_10                                                  (0x400U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_11                                                  (0x800U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_12                                                  (0x1000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_13                                                  (0x2000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_14                                                  (0x4000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_15                                                  (0x8000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_16                                                  (0x10000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_17                                                  (0x20000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_18                                                  (0x40000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_19                                                  (0x80000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_20                                                  (0x100000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_21                                                  (0x200000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_22                                                  (0x400000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_23                                                  (0x800000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_24                                                  (0x1000000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_25                                                  (0x2000000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_26                                                  (0x4000000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_27                                                  (0x8000000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_28                                                  (0x10000000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_29                                                  (0x20000000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_30                                                  (0x40000000U << AES_SUSP1_SUSP_Pos)
#define AES_SUSP1_SUSP_31                                                  (0x80000000UL << AES_SUSP1_SUSP_Pos)

/* =====================================================    SUSP2    =====================================================*/
#define AES_SUSP2_SUSP_Pos                                                 (0UL)        /*!<AES SUSP2: SUSP (Bit 0) */
#define AES_SUSP2_SUSP_Msk                                                 (0xffffffffUL)        /*!< AES SUSP2: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP2_SUSP                                                     AES_SUSP2_SUSP_Msk
#define AES_SUSP2_SUSP_0                                                   (0x1U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_1                                                   (0x2U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_2                                                   (0x4U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_3                                                   (0x8U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_4                                                   (0x10U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_5                                                   (0x20U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_6                                                   (0x40U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_7                                                   (0x80U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_8                                                   (0x100U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_9                                                   (0x200U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_10                                                  (0x400U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_11                                                  (0x800U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_12                                                  (0x1000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_13                                                  (0x2000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_14                                                  (0x4000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_15                                                  (0x8000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_16                                                  (0x10000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_17                                                  (0x20000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_18                                                  (0x40000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_19                                                  (0x80000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_20                                                  (0x100000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_21                                                  (0x200000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_22                                                  (0x400000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_23                                                  (0x800000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_24                                                  (0x1000000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_25                                                  (0x2000000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_26                                                  (0x4000000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_27                                                  (0x8000000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_28                                                  (0x10000000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_29                                                  (0x20000000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_30                                                  (0x40000000U << AES_SUSP2_SUSP_Pos)
#define AES_SUSP2_SUSP_31                                                  (0x80000000UL << AES_SUSP2_SUSP_Pos)

