stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* ============================================================================================================================*/
/*=====================                                 MR_SUBG_GLOB_MISC                                 =====================*/
/* ============================================================================================================================*/

/* =====================================================    RFIP_VERSION    =====================================================*/
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_Pos                         (12UL)        /*!<MR_SUBG_GLOB_MISC RFIP_VERSION: PRODUCT (Bit 12) */
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_Msk                         (0xf000UL)        /*!< MR_SUBG_GLOB_MISC RFIP_VERSION: PRODUCT (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT                             MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_Msk
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_0                           (0x1U << MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_1                           (0x2U << MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_2                           (0x4U << MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_3                           (0x8U << MR_SUBG_GLOB_MISC_RFIP_VERSION_PRODUCT_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_Pos                         (8UL)        /*!<MR_SUBG_GLOB_MISC RFIP_VERSION: VERSION (Bit 8) */
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_Msk                         (0xf00UL)        /*!< MR_SUBG_GLOB_MISC RFIP_VERSION: VERSION (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION                             MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_Msk
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_0                           (0x1U << MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_1                           (0x2U << MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_2                           (0x4U << MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_3                           (0x8U << MR_SUBG_GLOB_MISC_RFIP_VERSION_VERSION_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_Pos                        (4UL)        /*!<MR_SUBG_GLOB_MISC RFIP_VERSION: REVISION (Bit 4) */
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_Msk                        (0xf0UL)        /*!< MR_SUBG_GLOB_MISC RFIP_VERSION: REVISION (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION                            MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_Msk
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_0                          (0x1U << MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_1                          (0x2U << MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_2                          (0x4U << MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_Pos)
#define MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_3                          (0x8U << MR_SUBG_GLOB_MISC_RFIP_VERSION_REVISION_Pos)

/* =====================================================    RRM_UDRA_CTRL    =====================================================*/
#define MR_SUBG_GLOB_MISC_RRM_UDRA_CTRL_RRM_CMD_REQ_Pos                    (0UL)        /*!<MR_SUBG_GLOB_MISC RRM_UDRA_CTRL: RRM_CMD_REQ (Bit 0) */
#define MR_SUBG_GLOB_MISC_RRM_UDRA_CTRL_RRM_CMD_REQ_Msk                    (0x1UL)        /*!< MR_SUBG_GLOB_MISC RRM_UDRA_CTRL: RRM_CMD_REQ (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_MISC_RRM_UDRA_CTRL_RRM_CMD_REQ                        MR_SUBG_GLOB_MISC_RRM_UDRA_CTRL_RRM_CMD_REQ_Msk

/* =====================================================    SEQUENCER_CTRL    =====================================================*/
#define MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_DISABLE_SEQ_Pos                   (1UL)        /*!<MR_SUBG_GLOB_MISC SEQUENCER_CTRL: DISABLE_SEQ (Bit 1) */
#define MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_DISABLE_SEQ_Msk                   (0x2UL)        /*!< MR_SUBG_GLOB_MISC SEQUENCER_CTRL: DISABLE_SEQ (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_DISABLE_SEQ                       MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_DISABLE_SEQ_Msk
#define MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_GEN_SEQ_TRIGGER_Pos               (0UL)        /*!<MR_SUBG_GLOB_MISC SEQUENCER_CTRL: GEN_SEQ_TRIGGER (Bit 0) */
#define MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_GEN_SEQ_TRIGGER_Msk               (0x1UL)        /*!< MR_SUBG_GLOB_MISC SEQUENCER_CTRL: GEN_SEQ_TRIGGER (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_GEN_SEQ_TRIGGER                   MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_GEN_SEQ_TRIGGER_Msk

/* =====================================================    ABSOLUTE_TIME    =====================================================*/
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos                  (0UL)        /*!<MR_SUBG_GLOB_MISC ABSOLUTE_TIME: ABSOLUTE_TIME (Bit 0) */
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Msk                  (0xffffffffUL)        /*!< MR_SUBG_GLOB_MISC ABSOLUTE_TIME: ABSOLUTE_TIME (Bitfield-Mask: 0xffffffff) */
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME                      MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Msk
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_0                    (0x1U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_1                    (0x2U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_2                    (0x4U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_3                    (0x8U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_4                    (0x10U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_5                    (0x20U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_6                    (0x40U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_7                    (0x80U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_8                    (0x100U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_9                    (0x200U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_10                   (0x400U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_11                   (0x800U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_12                   (0x1000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_13                   (0x2000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_14                   (0x4000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_15                   (0x8000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_16                   (0x10000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_17                   (0x20000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_18                   (0x40000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_19                   (0x80000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_20                   (0x100000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_21                   (0x200000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_22                   (0x400000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_23                   (0x800000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_24                   (0x1000000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_25                   (0x2000000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_26                   (0x4000000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_27                   (0x8000000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_28                   (0x10000000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_29                   (0x20000000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_30                   (0x40000000U << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)
#define MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_31                   (0x80000000UL << MR_SUBG_GLOB_MISC_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)

/* =====================================================    SCM_COUNTER_VAL    =====================================================*/
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos          (0UL)        /*!<MR_SUBG_GLOB_MISC SCM_COUNTER_VAL: SCM_COUNTER_CURRVAL (Bit 0) */
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Msk          (0x7fffUL)        /*!< MR_SUBG_GLOB_MISC SCM_COUNTER_VAL: SCM_COUNTER_CURRVAL (Bitfield-Mask: 0x7fff) */
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL              MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Msk
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_0            (0x1U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_1            (0x2U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_2            (0x4U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_3            (0x8U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_4            (0x10U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_5            (0x20U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_6            (0x40U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_7            (0x80U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_8            (0x100U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_9            (0x200U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_10           (0x400U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_11           (0x800U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_12           (0x1000U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_13           (0x2000U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_14           (0x4000U << MR_SUBG_GLOB_MISC_SCM_COUNTER_VAL_SCM_COUNTER_CURRVAL_Pos)

/* =====================================================    SCM_MIN_MAX    =====================================================*/
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_CLEAR_MIN_MAX_Pos                    (31UL)        /*!<MR_SUBG_GLOB_MISC SCM_MIN_MAX: CLEAR_MIN_MAX (Bit 31) */
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_CLEAR_MIN_MAX_Msk                    (0x80000000UL)        /*!< MR_SUBG_GLOB_MISC SCM_MIN_MAX: CLEAR_MIN_MAX (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_CLEAR_MIN_MAX                        MR_SUBG_GLOB_MISC_SCM_MIN_MAX_CLEAR_MIN_MAX_Msk
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos               (16UL)        /*!<MR_SUBG_GLOB_MISC SCM_MIN_MAX: SCM_COUNTER_MAXVAL (Bit 16) */
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Msk               (0x7fff0000UL)        /*!< MR_SUBG_GLOB_MISC SCM_MIN_MAX: SCM_COUNTER_MAXVAL (Bitfield-Mask: 0x7fff) */
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL                   MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Msk
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_0                 (0x1U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_1                 (0x2U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_2                 (0x4U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_3                 (0x8U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_4                 (0x10U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_5                 (0x20U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_6                 (0x40U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_7                 (0x80U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_8                 (0x100U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_9                 (0x200U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_10                (0x400U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_11                (0x800U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_12                (0x1000U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_13                (0x2000U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_14                (0x4000U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MAXVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos               (0UL)        /*!<MR_SUBG_GLOB_MISC SCM_MIN_MAX: SCM_COUNTER_MINVAL (Bit 0) */
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Msk               (0x7fffUL)        /*!< MR_SUBG_GLOB_MISC SCM_MIN_MAX: SCM_COUNTER_MINVAL (Bitfield-Mask: 0x7fff) */
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL                   MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Msk
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_0                 (0x1U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_1                 (0x2U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_2                 (0x4U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_3                 (0x8U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_4                 (0x10U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_5                 (0x20U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_6                 (0x40U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_7                 (0x80U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_8                 (0x100U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_9                 (0x200U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_10                (0x400U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_11                (0x800U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_12                (0x1000U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_13                (0x2000U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)
#define MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_14                (0x4000U << MR_SUBG_GLOB_MISC_SCM_MIN_MAX_SCM_COUNTER_MINVAL_Pos)

