stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    SEQ_EVENT_STATUS    =====================================================*/
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos          (0UL)        /*!<MR_SUBG_GLOB_STATUS SEQ_EVENT_STATUS: SEQ_EVENT_STATUS (Bit 0) */
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Msk          (0xffffffffUL)        /*!< MR_SUBG_GLOB_STATUS SEQ_EVENT_STATUS: SEQ_EVENT_STATUS (Bitfield-Mask: 0xffffffff) */
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS              MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Msk
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_0            (0x1U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_1            (0x2U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_2            (0x4U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_3            (0x8U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_4            (0x10U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_5            (0x20U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_6            (0x40U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_7            (0x80U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_8            (0x100U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_9            (0x200U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_10           (0x400U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_11           (0x800U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_12           (0x1000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_13           (0x2000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_14           (0x4000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_15           (0x8000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_16           (0x10000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_17           (0x20000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_18           (0x40000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_19           (0x80000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_20           (0x100000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_21           (0x200000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_22           (0x400000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_23           (0x800000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_24           (0x1000000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_25           (0x2000000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_26           (0x4000000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_27           (0x8000000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_28           (0x10000000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_29           (0x20000000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_30           (0x40000000U << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_31           (0x80000000UL << MR_SUBG_GLOB_STATUS_SEQ_EVENT_STATUS_SEQ_EVENT_STATUS_Pos)


/* ============================================================================================================================*/
/*=====================                                   MR_SUBG_RADIO                                   =====================*/
/* ============================================================================================================================*/

/* =====================================================    RF_FSM0_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos                  (0UL)        /*!<MR_SUBG_RADIO RF_FSM0_TIMEOUT: ENA_RFREG_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Msk                  (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM0_TIMEOUT: ENA_RFREG_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER                      MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_0                    (0x1U << MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_1                    (0x2U << MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_2                    (0x4U << MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_3                    (0x8U << MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_4                    (0x10U << MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_5                    (0x20U << MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_6                    (0x40U << MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_7                    (0x80U << MR_SUBG_RADIO_RF_FSM0_TIMEOUT_ENA_RFREG_TIMER_Pos)

/* =====================================================    RF_FSM1_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos                (0UL)        /*!<MR_SUBG_RADIO RF_FSM1_TIMEOUT: SYNTH_SETUP_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Msk                (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM1_TIMEOUT: SYNTH_SETUP_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER                    MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_0                  (0x1U << MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_1                  (0x2U << MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_2                  (0x4U << MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_3                  (0x8U << MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_4                  (0x10U << MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_5                  (0x20U << MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_6                  (0x40U << MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_7                  (0x80U << MR_SUBG_RADIO_RF_FSM1_TIMEOUT_SYNTH_SETUP_TIMER_Pos)

/* =====================================================    RF_FSM2_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos             (0UL)        /*!<MR_SUBG_RADIO RF_FSM2_TIMEOUT: VCO_CALIB_LOCK_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Msk             (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM2_TIMEOUT: VCO_CALIB_LOCK_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER                 MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_0               (0x1U << MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_1               (0x2U << MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_2               (0x4U << MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_3               (0x8U << MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_4               (0x10U << MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_5               (0x20U << MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_6               (0x40U << MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_7               (0x80U << MR_SUBG_RADIO_RF_FSM2_TIMEOUT_VCO_CALIB_LOCK_TIMER_Pos)

/* =====================================================    RF_FSM3_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos                   (0UL)        /*!<MR_SUBG_RADIO RF_FSM3_TIMEOUT: VCO_LOCK_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Msk                   (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM3_TIMEOUT: VCO_LOCK_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER                       MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_0                     (0x1U << MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_1                     (0x2U << MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_2                     (0x4U << MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_3                     (0x8U << MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_4                     (0x10U << MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_5                     (0x20U << MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_6                     (0x40U << MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_7                     (0x80U << MR_SUBG_RADIO_RF_FSM3_TIMEOUT_VCO_LOCK_TIMER_Pos)

/* =====================================================    RF_FSM4_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos                      (0UL)        /*!<MR_SUBG_RADIO RF_FSM4_TIMEOUT: EN_RX_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Msk                      (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM4_TIMEOUT: EN_RX_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER                          MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_0                        (0x1U << MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_1                        (0x2U << MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_2                        (0x4U << MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_3                        (0x8U << MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_4                        (0x10U << MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_5                        (0x20U << MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_6                        (0x40U << MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_7                        (0x80U << MR_SUBG_RADIO_RF_FSM4_TIMEOUT_EN_RX_TIMER_Pos)

