stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    DCREM_CTRL1    =====================================================*/
#define MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_Pos                          (0UL)        /*!<MR_SUBG_RADIO DCREM_CTRL1: LN2TIME2SET (Bit 0) */
#define MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_Msk                          (0xfUL)        /*!< MR_SUBG_RADIO DCREM_CTRL1: LN2TIME2SET (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET                              MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_Msk
#define MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_0                            (0x1U << MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_Pos)
#define MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_1                            (0x2U << MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_Pos)
#define MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_2                            (0x4U << MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_Pos)
#define MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_3                            (0x8U << MR_SUBG_RADIO_DCREM_CTRL1_LN2TIME2SET_Pos)

/* =====================================================    IQC_CTRL0    =====================================================*/
#define MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_Pos                              (4UL)        /*!<MR_SUBG_RADIO IQC_CTRL0: SLOW_GAIN (Bit 4) */
#define MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_Msk                              (0xf0UL)        /*!< MR_SUBG_RADIO IQC_CTRL0: SLOW_GAIN (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN                                  MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_Msk
#define MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_0                                (0x1U << MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_Pos)
#define MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_1                                (0x2U << MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_Pos)
#define MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_2                                (0x4U << MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_Pos)
#define MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_3                                (0x8U << MR_SUBG_RADIO_IQC_CTRL0_SLOW_GAIN_Pos)
#define MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_Pos                              (0UL)        /*!<MR_SUBG_RADIO IQC_CTRL0: FAST_GAIN (Bit 0) */
#define MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_Msk                              (0xfUL)        /*!< MR_SUBG_RADIO IQC_CTRL0: FAST_GAIN (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN                                  MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_Msk
#define MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_0                                (0x1U << MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_Pos)
#define MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_1                                (0x2U << MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_Pos)
#define MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_2                                (0x4U << MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_Pos)
#define MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_3                                (0x8U << MR_SUBG_RADIO_IQC_CTRL0_FAST_GAIN_Pos)

/* =====================================================    IQC_CTRL1    =====================================================*/
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos                             (0UL)        /*!<MR_SUBG_RADIO IQC_CTRL1: QPD_ATTACK (Bit 0) */
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Msk                             (0xffUL)        /*!< MR_SUBG_RADIO IQC_CTRL1: QPD_ATTACK (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK                                 MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Msk
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_0                               (0x1U << MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos)
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_1                               (0x2U << MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos)
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_2                               (0x4U << MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos)
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_3                               (0x8U << MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos)
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_4                               (0x10U << MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos)
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_5                               (0x20U << MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos)
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_6                               (0x40U << MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos)
#define MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_7                               (0x80U << MR_SUBG_RADIO_IQC_CTRL1_QPD_ATTACK_Pos)

/* =====================================================    IQC_CTRL2    =====================================================*/
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos                              (0UL)        /*!<MR_SUBG_RADIO IQC_CTRL2: QPD_DECAY (Bit 0) */
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Msk                              (0xffUL)        /*!< MR_SUBG_RADIO IQC_CTRL2: QPD_DECAY (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY                                  MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Msk
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_0                                (0x1U << MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos)
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_1                                (0x2U << MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos)
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_2                                (0x4U << MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos)
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_3                                (0x8U << MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos)
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_4                                (0x10U << MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos)
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_5                                (0x20U << MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos)
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_6                                (0x40U << MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos)
#define MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_7                                (0x80U << MR_SUBG_RADIO_IQC_CTRL2_QPD_DECAY_Pos)

/* =====================================================    IQC_CTRL3    =====================================================*/
#define MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_Pos                              (0UL)        /*!<MR_SUBG_RADIO IQC_CTRL3: FAST_TIME (Bit 0) */
#define MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_Msk                              (0xfUL)        /*!< MR_SUBG_RADIO IQC_CTRL3: FAST_TIME (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME                                  MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_Msk
#define MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_0                                (0x1U << MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_Pos)
#define MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_1                                (0x2U << MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_Pos)
#define MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_2                                (0x4U << MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_Pos)
#define MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_3                                (0x8U << MR_SUBG_RADIO_IQC_CTRL3_FAST_TIME_Pos)

