stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3rx.h
/* =====================================================    RXADC_HWDELAYTRIM_OUT    =====================================================*/
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_Pos       (3UL)        /*!<MR_SUBG_RADIO RXADC_HWDELAYTRIM_OUT: RXADC_HW_DELAYTRIM_Q (Bit 3) */
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_Msk       (0x38UL)        /*!< MR_SUBG_RADIO RXADC_HWDELAYTRIM_OUT: RXADC_HW_DELAYTRIM_Q (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q           MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_Msk
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_0         (0x1U << MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_Pos)
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_1         (0x2U << MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_Pos)
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_2         (0x4U << MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_Q_Pos)
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_Pos       (0UL)        /*!<MR_SUBG_RADIO RXADC_HWDELAYTRIM_OUT: RXADC_HW_DELAYTRIM_I (Bit 0) */
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_Msk       (0x7UL)        /*!< MR_SUBG_RADIO RXADC_HWDELAYTRIM_OUT: RXADC_HW_DELAYTRIM_I (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I           MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_Msk
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_0         (0x1U << MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_Pos)
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_1         (0x2U << MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_Pos)
#define MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_2         (0x4U << MR_SUBG_RADIO_RXADC_HWDELAYTRIM_OUT_RXADC_HW_DELAYTRIM_I_Pos)

/* =====================================================    RX_AAF_HWTRIM_OUT    =====================================================*/
#define MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_Pos                  (0UL)        /*!<MR_SUBG_RADIO RX_AAF_HWTRIM_OUT: AAF_HW_FCTRIM (Bit 0) */
#define MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_Msk                  (0xfUL)        /*!< MR_SUBG_RADIO RX_AAF_HWTRIM_OUT: AAF_HW_FCTRIM (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM                      MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_Msk
#define MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_0                    (0x1U << MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_Pos)
#define MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_1                    (0x2U << MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_Pos)
#define MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_2                    (0x4U << MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_Pos)
#define MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_3                    (0x8U << MR_SUBG_RADIO_RX_AAF_HWTRIM_OUT_AAF_HW_FCTRIM_Pos)

/* =====================================================    SINGEN_ANA_ENG    =====================================================*/
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_LBE_Pos                    (2UL)        /*!<MR_SUBG_RADIO SINGEN_ANA_ENG: RFD_SINGEN_LBE (Bit 2) */
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_LBE_Msk                    (0x4UL)        /*!< MR_SUBG_RADIO SINGEN_ANA_ENG: RFD_SINGEN_LBE (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_LBE                        MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_LBE_Msk
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_DIV2_PUP_Pos               (1UL)        /*!<MR_SUBG_RADIO SINGEN_ANA_ENG: RFD_SINGEN_DIV2_PUP (Bit 1) */
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_DIV2_PUP_Msk               (0x2UL)        /*!< MR_SUBG_RADIO SINGEN_ANA_ENG: RFD_SINGEN_DIV2_PUP (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_DIV2_PUP                   MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_DIV2_PUP_Msk
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_ENA_Pos                    (0UL)        /*!<MR_SUBG_RADIO SINGEN_ANA_ENG: RFD_SINGEN_ENA (Bit 0) */
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_ENA_Msk                    (0x1UL)        /*!< MR_SUBG_RADIO SINGEN_ANA_ENG: RFD_SINGEN_ENA (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_ENA                        MR_SUBG_RADIO_SINGEN_ANA_ENG_RFD_SINGEN_ENA_Msk

/* =====================================================    RF_INFO_OUT    =====================================================*/
#define MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_Pos                           (4UL)         /*!<MR_SUBG_RADIO RF_INFO_OUT: RFSUBG_ID (Bit 4) */
#define MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_Msk                           (0xf0UL)      /*!< MR_SUBG_RADIO RF_INFO_OUT: RFSUBG_ID (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID                                MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_Msk
#define MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_0                             (0x1U << MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_Pos)
#define MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_1                             (0x2U << MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_Pos)
#define MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_2                             (0x4U << MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_Pos)
#define MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_3                             (0x8U << MR_SUBG_RADIO_RF_INFO_OUT_RFSUBG_ID_Pos)
/* =====================================================    RFANA_PLL_IN    =====================================================*/
#define MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL_Pos                          (6UL)        /*!MR_SUBG_RADIO_RFANA_PLL_IN: DIV12_SEL (Bit 6) */
#define MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL_Msk                          (0x40UL)        /*!< MR_SUBG_RADIO RFANA_PLL_IN: DIV12_SEL (Bitfield-Mask: 0x40) */
#define MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL                              MR_SUBG_RADIO_RFANA_PLL_IN_DIV12_SEL_Msk

/* =====================================================    RF_FSM8_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos                 (0UL)        /*!<MR_SUBG_RADIO RF_FSM8_TIMEOUT: SYNTH_PDWN_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Msk                 (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM8_TIMEOUT: SYNTH_PDWN_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER                     MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_0                   (0x1U << MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_1                   (0x2U << MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_2                   (0x4U << MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_3                   (0x8U << MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_4                   (0x10U << MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_5                   (0x20U << MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_6                   (0x40U << MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_7                   (0x80U << MR_SUBG_RADIO_RF_FSM8_TIMEOUT_SYNTH_PDWN_TIMER_Pos)

/* =====================================================    RF_FSM9_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos                     (0UL)        /*!<MR_SUBG_RADIO RF_FSM9_TIMEOUT: END_RX_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Msk                     (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM9_TIMEOUT: END_RX_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER                         MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_0                       (0x1U << MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_1                       (0x2U << MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_2                       (0x4U << MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_3                       (0x8U << MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_4                       (0x10U << MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_5                       (0x20U << MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_6                       (0x40U << MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_7                       (0x80U << MR_SUBG_RADIO_RF_FSM9_TIMEOUT_END_RX_TIMER_Pos)

/* =====================================================    RF_FSM10_TIMEOUT    =====================================================*/
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos                    (0UL)        /*!<MR_SUBG_RADIO RF_FSM10_TIMEOUT: END_TX_TIMER (Bit 0) */
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Msk                    (0xffUL)        /*!< MR_SUBG_RADIO RF_FSM10_TIMEOUT: END_TX_TIMER (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER                        MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Msk
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_0                      (0x1U << MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_1                      (0x2U << MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_2                      (0x4U << MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_3                      (0x8U << MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_4                      (0x10U << MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_5                      (0x20U << MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_6                      (0x40U << MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos)
#define MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_7                      (0x80U << MR_SUBG_RADIO_RF_FSM10_TIMEOUT_END_TX_TIMER_Pos)

/* =====================================================    SUBG_DIG_CTRL0    =====================================================*/
#define MR_SUBG_RADIO_SUBG_DIG_CTRL0_FORCE_GPIO_OUTPUT_Pos                 (0UL)        /*!<MR_SUBG_RADIO SUBG_DIG_CTRL0: FORCE_GPIO_OUTPUT (Bit 0) */
#define MR_SUBG_RADIO_SUBG_DIG_CTRL0_FORCE_GPIO_OUTPUT_Msk                 (0x1UL)        /*!< MR_SUBG_RADIO SUBG_DIG_CTRL0: FORCE_GPIO_OUTPUT (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_SUBG_DIG_CTRL0_FORCE_GPIO_OUTPUT                     MR_SUBG_RADIO_SUBG_DIG_CTRL0_FORCE_GPIO_OUTPUT_Msk


/** @} */ /* End of group PosMask_peripherals */

/** @addtogroup Exported_macros
  * @{
  */

/*********************** UART Instances : Asynchronous mode *******************/
#define IS_UART_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

